#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AbilityFunctionLibrary

#include "Basic.hpp"

#include "M1Data_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "M1_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AbilityFunctionLibrary.AbilityFunctionLibrary_C.AttatchArcheShield
// 0x0020 (0x0020 - 0x0000)
struct AbilityFunctionLibrary_C_AttatchArcheShield final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   ArcheSheildRowName;                                // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbilityFunctionLibrary_C_AttatchArcheShield) == 0x000008, "Wrong alignment on AbilityFunctionLibrary_C_AttatchArcheShield");
static_assert(sizeof(AbilityFunctionLibrary_C_AttatchArcheShield) == 0x000020, "Wrong size on AbilityFunctionLibrary_C_AttatchArcheShield");
static_assert(offsetof(AbilityFunctionLibrary_C_AttatchArcheShield, SpawnLocation) == 0x000000, "Member 'AbilityFunctionLibrary_C_AttatchArcheShield::SpawnLocation' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_AttatchArcheShield, __WorldContext) == 0x000010, "Member 'AbilityFunctionLibrary_C_AttatchArcheShield::__WorldContext' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_AttatchArcheShield, ArcheSheildRowName) == 0x000018, "Member 'AbilityFunctionLibrary_C_AttatchArcheShield::ArcheSheildRowName' has a wrong offset!");

// Function AbilityFunctionLibrary.AbilityFunctionLibrary_C.CalcPivotLocation
// 0x0070 (0x0070 - 0x0000)
struct AbilityFunctionLibrary_C_CalcPivotLocation final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        MinPivotForwardDistance;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxPivotForwardDistance;                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PivotLocation;                                     // 0x0020(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbilityFunctionLibrary_C_CalcPivotLocation) == 0x000008, "Wrong alignment on AbilityFunctionLibrary_C_CalcPivotLocation");
static_assert(sizeof(AbilityFunctionLibrary_C_CalcPivotLocation) == 0x000070, "Wrong size on AbilityFunctionLibrary_C_CalcPivotLocation");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcPivotLocation, OwnerActor) == 0x000000, "Member 'AbilityFunctionLibrary_C_CalcPivotLocation::OwnerActor' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcPivotLocation, MinPivotForwardDistance) == 0x000008, "Member 'AbilityFunctionLibrary_C_CalcPivotLocation::MinPivotForwardDistance' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcPivotLocation, MaxPivotForwardDistance) == 0x000010, "Member 'AbilityFunctionLibrary_C_CalcPivotLocation::MaxPivotForwardDistance' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcPivotLocation, __WorldContext) == 0x000018, "Member 'AbilityFunctionLibrary_C_CalcPivotLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcPivotLocation, PivotLocation) == 0x000020, "Member 'AbilityFunctionLibrary_C_CalcPivotLocation::PivotLocation' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcPivotLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00002C, "Member 'AbilityFunctionLibrary_C_CalcPivotLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcPivotLocation, CallFunc_RandomFloatInRange_ReturnValue) == 0x000038, "Member 'AbilityFunctionLibrary_C_CalcPivotLocation::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcPivotLocation, CallFunc_GetActorForwardVector_ReturnValue) == 0x000040, "Member 'AbilityFunctionLibrary_C_CalcPivotLocation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcPivotLocation, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x00004C, "Member 'AbilityFunctionLibrary_C_CalcPivotLocation::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcPivotLocation, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000058, "Member 'AbilityFunctionLibrary_C_CalcPivotLocation::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcPivotLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000064, "Member 'AbilityFunctionLibrary_C_CalcPivotLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function AbilityFunctionLibrary.AbilityFunctionLibrary_C.CalcSummonsFireStartEndLocation
// 0x0180 (0x0180 - 0x0000)
struct AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation final
{
public:
	class AActor*                                 InOwner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InTargetLoc;                                       // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InFireSocketLoc;                                   // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InAxisSocketLoc;                                   // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSpreadSize;                                      // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FireLoc;                                           // 0x0038(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndLoc;                                            // 0x0044(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FireLocation;                                      // 0x0050(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndLocation;                                       // 0x005C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetAimPitch;                                    // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OwnerRightVector;                                  // 0x0070(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpreadSize;                                        // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AxisSocketLoc;                                     // 0x0080(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FireSocketLoc;                                     // 0x008C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0098(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UM1MonsterAnimInstance*                 K2Node_DynamicCast_AsM1Monster_Anim_Instance;      // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ApplyRandomSpread_ReturnValue;            // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast;    // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_TargetAimPitch_ImplicitCast;    // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation) == 0x000008, "Wrong alignment on AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation");
static_assert(sizeof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation) == 0x000180, "Wrong size on AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, InOwner) == 0x000000, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::InOwner' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, InTargetLoc) == 0x000008, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::InTargetLoc' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, InFireSocketLoc) == 0x000014, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::InFireSocketLoc' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, InAxisSocketLoc) == 0x000020, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::InAxisSocketLoc' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, InSpreadSize) == 0x00002C, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::InSpreadSize' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, __WorldContext) == 0x000030, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, FireLoc) == 0x000038, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::FireLoc' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, EndLoc) == 0x000044, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::EndLoc' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, FireLocation) == 0x000050, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::FireLocation' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, EndLocation) == 0x00005C, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::EndLocation' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, TargetAimPitch) == 0x000068, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::TargetAimPitch' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, OwnerRightVector) == 0x000070, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::OwnerRightVector' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, SpreadSize) == 0x00007C, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::SpreadSize' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, AxisSocketLoc) == 0x000080, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::AxisSocketLoc' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, FireSocketLoc) == 0x00008C, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::FireSocketLoc' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, TargetLocation) == 0x000098, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::TargetLocation' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, Owner) == 0x0000A8, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::Owner' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000B0, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_GetComponentByClass_ReturnValue) == 0x0000C0, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_GetRightVector_ReturnValue) == 0x0000C8, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_IsValid_ReturnValue) == 0x0000D4, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_GetAnimInstance_ReturnValue) == 0x0000D8, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, K2Node_DynamicCast_AsM1Monster_Anim_Instance) == 0x0000E0, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::K2Node_DynamicCast_AsM1Monster_Anim_Instance' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_BreakRotator_Roll) == 0x0000EC, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_BreakRotator_Pitch) == 0x0000F0, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_BreakRotator_Yaw) == 0x0000F4, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000F8, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_VSize_ReturnValue) == 0x000108, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_Normal_ReturnValue) == 0x000110, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_ApplyRandomSpread_ReturnValue) == 0x00011C, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_ApplyRandomSpread_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000128, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000134, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000140, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x00014C, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_RotateAngleAxis_ReturnValue) == 0x000158, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000164, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast) == 0x000170, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation, K2Node_VariableSet_TargetAimPitch_ImplicitCast) == 0x000178, "Member 'AbilityFunctionLibrary_C_CalcSummonsFireStartEndLocation::K2Node_VariableSet_TargetAimPitch_ImplicitCast' has a wrong offset!");

// Function AbilityFunctionLibrary.AbilityFunctionLibrary_C.CheckSpawnedCount
// 0x0078 (0x0078 - 0x0000)
struct AbilityFunctionLibrary_C_CheckSpawnedCount final
{
public:
	TArray<class AM1Monster*>                     InSpawnedMonsters;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         MonsterCount;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LimitedSpawnedCount;                               // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanSpawn;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AM1Monster*>                     SpawnedMonsters;                                   // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AM1Monster*>                     ValidSpawnedMonsters;                              // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AM1Monster*                             CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbilityFunctionLibrary_C_CheckSpawnedCount) == 0x000008, "Wrong alignment on AbilityFunctionLibrary_C_CheckSpawnedCount");
static_assert(sizeof(AbilityFunctionLibrary_C_CheckSpawnedCount) == 0x000078, "Wrong size on AbilityFunctionLibrary_C_CheckSpawnedCount");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, InSpawnedMonsters) == 0x000000, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::InSpawnedMonsters' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, MonsterCount) == 0x000010, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::MonsterCount' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, LimitedSpawnedCount) == 0x000014, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::LimitedSpawnedCount' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, __WorldContext) == 0x000018, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::__WorldContext' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, bCanSpawn) == 0x000020, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::bCanSpawn' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, SpawnedMonsters) == 0x000028, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::SpawnedMonsters' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, ValidSpawnedMonsters) == 0x000038, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::ValidSpawnedMonsters' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, CallFunc_Array_Get_Item) == 0x000058, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, CallFunc_IsDead_ReturnValue) == 0x000061, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, CallFunc_Less_IntInt_ReturnValue) == 0x000062, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, CallFunc_Add_IntInt_ReturnValue_1) == 0x00006C, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnedCount, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000074, "Member 'AbilityFunctionLibrary_C_CheckSpawnedCount::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function AbilityFunctionLibrary.AbilityFunctionLibrary_C.CheckSpawnPoint
// 0x01B8 (0x01B8 - 0x0000)
struct AbilityFunctionLibrary_C_CheckSpawnPoint final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PivotLocation;                                     // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinRadius;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLimitedSight;                                     // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AM1Monster*                             OwnerMonster;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InMinRadius;                                       // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0048(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0084(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123[0x1];                                      // 0x0123(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AE[0x2];                                      // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbilityFunctionLibrary_C_CheckSpawnPoint) == 0x000008, "Wrong alignment on AbilityFunctionLibrary_C_CheckSpawnPoint");
static_assert(sizeof(AbilityFunctionLibrary_C_CheckSpawnPoint) == 0x0001B8, "Wrong size on AbilityFunctionLibrary_C_CheckSpawnPoint");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, SpawnLocation) == 0x000000, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::SpawnLocation' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, PivotLocation) == 0x00000C, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::PivotLocation' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, MinRadius) == 0x000018, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::MinRadius' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, bLimitedSight) == 0x000020, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::bLimitedSight' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, OwnerMonster) == 0x000028, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::OwnerMonster' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, __WorldContext) == 0x000030, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::__WorldContext' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, Success) == 0x000038, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::Success' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, InMinRadius) == 0x000039, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::InMinRadius' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_Vector_Distance2D_ReturnValue) == 0x000040, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, Temp_object_Variable) == 0x000048, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000058, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x00005C, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_MakeVector_ReturnValue) == 0x00006C, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_Add_VectorVector_ReturnValue) == 0x000078, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_LineTraceSingle_OutHit) == 0x000084, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_LineTraceSingle_ReturnValue) == 0x000120, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_bBlockingHit) == 0x000121, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_bInitialOverlap) == 0x000122, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_Time) == 0x000124, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_Distance) == 0x000128, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_Location) == 0x00012C, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_ImpactPoint) == 0x000138, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_Normal) == 0x000144, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_ImpactNormal) == 0x000150, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_PhysMat) == 0x000160, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_HitActor) == 0x000168, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_HitComponent) == 0x000170, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_HitBoneName) == 0x000178, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_BoneName) == 0x000180, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_HitItem) == 0x000188, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_ElementIndex) == 0x00018C, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_FaceIndex) == 0x000190, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_TraceStart) == 0x000194, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BreakHitResult_TraceEnd) == 0x0001A0, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_Not_PreBool_ReturnValue) == 0x0001AC, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_BooleanAND_ReturnValue) == 0x0001AD, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CheckSpawnPoint, CallFunc_MakeVector_Z_ImplicitCast) == 0x0001B0, "Member 'AbilityFunctionLibrary_C_CheckSpawnPoint::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");

// Function AbilityFunctionLibrary.AbilityFunctionLibrary_C.CreateAOEActorManager
// 0x0100 (0x0100 - 0x0000)
struct AbilityFunctionLibrary_C_CreateAOEActorManager final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    PrimitiveComp;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EM1RelationsCheckType                         RelationsType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  SEForwardingContextTags;                           // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTagContainer                  SEInvokeTags;                                      // 0x0038(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         Period;                                            // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  PeriodOpTags;                                      // 0x0060(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   PeriodHitFXName;                                   // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStartOverlap;                                     // 0x0088(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNeedEndSE;                                        // 0x0089(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  PeriodSEForwardingContextTags;                     // 0x0090(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTagContainer                  PeriodSEInvokeTags;                                // 0x00B0(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UM1AOECollisionManager_C*               ReturnValue;                                       // 0x00D8(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UM1AOECollisionManager_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AM1AbilityActor*                        K2Node_DynamicCast_AsM1Ability_Actor;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetDoublePropertyByName_Value_ImplicitCast; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbilityFunctionLibrary_C_CreateAOEActorManager) == 0x000008, "Wrong alignment on AbilityFunctionLibrary_C_CreateAOEActorManager");
static_assert(sizeof(AbilityFunctionLibrary_C_CreateAOEActorManager) == 0x000100, "Wrong size on AbilityFunctionLibrary_C_CreateAOEActorManager");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, Outer_0) == 0x000000, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::Outer_0' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, PrimitiveComp) == 0x000008, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::PrimitiveComp' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, RelationsType) == 0x000010, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::RelationsType' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, SEForwardingContextTags) == 0x000018, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::SEForwardingContextTags' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, SEInvokeTags) == 0x000038, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::SEInvokeTags' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, Period) == 0x000058, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::Period' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, PeriodOpTags) == 0x000060, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::PeriodOpTags' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, PeriodHitFXName) == 0x000080, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::PeriodHitFXName' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, bStartOverlap) == 0x000088, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::bStartOverlap' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, bNeedEndSE) == 0x000089, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::bNeedEndSE' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, PeriodSEForwardingContextTags) == 0x000090, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::PeriodSEForwardingContextTags' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, PeriodSEInvokeTags) == 0x0000B0, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::PeriodSEInvokeTags' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, __WorldContext) == 0x0000D0, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::__WorldContext' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, ReturnValue) == 0x0000D8, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, CallFunc_SpawnObject_ReturnValue) == 0x0000E0, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, K2Node_DynamicCast_AsM1Ability_Actor) == 0x0000E8, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::K2Node_DynamicCast_AsM1Ability_Actor' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, CallFunc_IsValid_ReturnValue) == 0x0000F1, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityFunctionLibrary_C_CreateAOEActorManager, CallFunc_SetDoublePropertyByName_Value_ImplicitCast) == 0x0000F8, "Member 'AbilityFunctionLibrary_C_CreateAOEActorManager::CallFunc_SetDoublePropertyByName_Value_ImplicitCast' has a wrong offset!");

// Function AbilityFunctionLibrary.AbilityFunctionLibrary_C.FindRandomTeleportLocationFromSpawnTransformMaker
// 0x0140 (0x0140 - 0x0000)
struct AbilityFunctionLibrary_C_FindRandomTeleportLocationFromSpawnTransformMaker final
{
public:
