#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MissionSubTaskOccuaption

#include "Basic.hpp"

#include "M1_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MissionSubTaskOccuaption.BP_MissionSubTaskOccuaption_C
// 0x0028 (0x0688 - 0x0660)
class ABP_MissionSubTaskOccuaption_C final : public AM1MissionSubTaskActorOccupation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      InteractableArea;                                  // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MissionSubTaskOccuaption(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MissionSubTaskOccuaption_C">();
	}
	static class ABP_MissionSubTaskOccuaption_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MissionSubTaskOccuaption_C>();
	}
};
static_assert(alignof(ABP_MissionSubTaskOccuaption_C) == 0x000008, "Wrong alignment on ABP_MissionSubTaskOccuaption_C");
static_assert(sizeof(ABP_MissionSubTaskOccuaption_C) == 0x000688, "Wrong size on ABP_MissionSubTaskOccuaption_C");
static_assert(offsetof(ABP_MissionSubTaskOccuaption_C, UberGraphFrame) == 0x000660, "Member 'ABP_MissionSubTaskOccuaption_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MissionSubTaskOccuaption_C, InteractableArea) == 0x000668, "Member 'ABP_MissionSubTaskOccuaption_C::InteractableArea' has a wrong offset!");
static_assert(offsetof(ABP_MissionSubTaskOccuaption_C, Billboard) == 0x000670, "Member 'ABP_MissionSubTaskOccuaption_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_MissionSubTaskOccuaption_C, Arrow) == 0x000678, "Member 'ABP_MissionSubTaskOccuaption_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_MissionSubTaskOccuaption_C, NiagaraComponent) == 0x000680, "Member 'ABP_MissionSubTaskOccuaption_C::NiagaraComponent' has a wrong offset!");

}

