#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MIS_Prologue_Door_004

#include "Basic.hpp"

#include "M1_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MIS_Prologue_Door_004.BP_MIS_Prologue_Door_004_C
// 0x0130 (0x05B8 - 0x0488)
class ABP_MIS_Prologue_Door_004_C final : public AM1MissionTaskDoor
{
public:
	class UStaticMeshComponent*                   SM_HeavenRuin_Barricade01A_CSW4;                   // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Barricade01A_CSW3;                   // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Door_01;                                           // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Door_02;                                           // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door_Root_02;                                      // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door_Root_01;                                      // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door_Ani;                                          // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collision3;                                        // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collision2;                                        // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collision1;                                        // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collision;                                         // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar02A_HJS5;                      // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Door_Collion_02;                                   // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar02A_HJS2;                      // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar02A_HJS3;                      // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_ThinWall01A_CSW1;                    // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar02A_HJS4;                      // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_ThinWall01A_CSW;                     // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Door_Collion_01;                                   // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar02A_HJS7;                      // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar02A_HJS6;                      // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar02A_HJS;                       // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar02A_HJS1;                      // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Barricade01A_CSW2;                   // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Platform02A_CSW1;                    // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW5;                       // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW1;                       // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Platform02A_CSW;                     // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW6;                       // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW4;                       // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW3;                       // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW2;                       // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW7;                       // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Barricade01A_CSW;                    // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW8;                       // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW;                        // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW9;                       // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Barricade01A_CSW1;                   // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MIS_Prologue_Door_004_C">();
	}
	static class ABP_MIS_Prologue_Door_004_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MIS_Prologue_Door_004_C>();
	}
};
static_assert(alignof(ABP_MIS_Prologue_Door_004_C) == 0x000008, "Wrong alignment on ABP_MIS_Prologue_Door_004_C");
static_assert(sizeof(ABP_MIS_Prologue_Door_004_C) == 0x0005B8, "Wrong size on ABP_MIS_Prologue_Door_004_C");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Barricade01A_CSW4) == 0x000488, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Barricade01A_CSW4' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Barricade01A_CSW3) == 0x000490, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Barricade01A_CSW3' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, Door_01) == 0x000498, "Member 'ABP_MIS_Prologue_Door_004_C::Door_01' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, Door_02) == 0x0004A0, "Member 'ABP_MIS_Prologue_Door_004_C::Door_02' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, Door_Root_02) == 0x0004A8, "Member 'ABP_MIS_Prologue_Door_004_C::Door_Root_02' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, Door_Root_01) == 0x0004B0, "Member 'ABP_MIS_Prologue_Door_004_C::Door_Root_01' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, Door_Ani) == 0x0004B8, "Member 'ABP_MIS_Prologue_Door_004_C::Door_Ani' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, Collision3) == 0x0004C0, "Member 'ABP_MIS_Prologue_Door_004_C::Collision3' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, Collision2) == 0x0004C8, "Member 'ABP_MIS_Prologue_Door_004_C::Collision2' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, Collision1) == 0x0004D0, "Member 'ABP_MIS_Prologue_Door_004_C::Collision1' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, Collision) == 0x0004D8, "Member 'ABP_MIS_Prologue_Door_004_C::Collision' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar02A_HJS5) == 0x0004E0, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar02A_HJS5' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, Door_Collion_02) == 0x0004E8, "Member 'ABP_MIS_Prologue_Door_004_C::Door_Collion_02' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar02A_HJS2) == 0x0004F0, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar02A_HJS2' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar02A_HJS3) == 0x0004F8, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar02A_HJS3' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_ThinWall01A_CSW1) == 0x000500, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_ThinWall01A_CSW1' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar02A_HJS4) == 0x000508, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar02A_HJS4' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_ThinWall01A_CSW) == 0x000510, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_ThinWall01A_CSW' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, Door_Collion_01) == 0x000518, "Member 'ABP_MIS_Prologue_Door_004_C::Door_Collion_01' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar02A_HJS7) == 0x000520, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar02A_HJS7' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar02A_HJS6) == 0x000528, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar02A_HJS6' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar02A_HJS) == 0x000530, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar02A_HJS' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar02A_HJS1) == 0x000538, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar02A_HJS1' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Barricade01A_CSW2) == 0x000540, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Barricade01A_CSW2' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Platform02A_CSW1) == 0x000548, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Platform02A_CSW1' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar06_CSW5) == 0x000550, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar06_CSW5' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar06_CSW1) == 0x000558, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar06_CSW1' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Platform02A_CSW) == 0x000560, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Platform02A_CSW' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar06_CSW6) == 0x000568, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar06_CSW6' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar06_CSW4) == 0x000570, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar06_CSW4' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar06_CSW3) == 0x000578, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar06_CSW3' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar06_CSW2) == 0x000580, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar06_CSW2' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar06_CSW7) == 0x000588, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar06_CSW7' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Barricade01A_CSW) == 0x000590, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Barricade01A_CSW' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar06_CSW8) == 0x000598, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar06_CSW8' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar06_CSW) == 0x0005A0, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar06_CSW' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Pillar06_CSW9) == 0x0005A8, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Pillar06_CSW9' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_004_C, SM_HeavenRuin_Barricade01A_CSW1) == 0x0005B0, "Member 'ABP_MIS_Prologue_Door_004_C::SM_HeavenRuin_Barricade01A_CSW1' has a wrong offset!");

}

