#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MissionTaskEffectDoor_Base

#include "Basic.hpp"

#include "M1_structs.hpp"


namespace SDK::Params
{

// Function BP_MissionTaskEffectDoor_Base.BP_MissionTaskEffectDoor_Base_C.BP_HandleDoorState
// 0x0002 (0x0002 - 0x0000)
struct BP_MissionTaskEffectDoor_Base_C_BP_HandleDoorState final
{
public:
	EM1DoorState                                  InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1DoorTiming                                 InTiming;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionTaskEffectDoor_Base_C_BP_HandleDoorState) == 0x000001, "Wrong alignment on BP_MissionTaskEffectDoor_Base_C_BP_HandleDoorState");
static_assert(sizeof(BP_MissionTaskEffectDoor_Base_C_BP_HandleDoorState) == 0x000002, "Wrong size on BP_MissionTaskEffectDoor_Base_C_BP_HandleDoorState");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_BP_HandleDoorState, InState) == 0x000000, "Member 'BP_MissionTaskEffectDoor_Base_C_BP_HandleDoorState::InState' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_BP_HandleDoorState, InTiming) == 0x000001, "Member 'BP_MissionTaskEffectDoor_Base_C_BP_HandleDoorState::InTiming' has a wrong offset!");

// Function BP_MissionTaskEffectDoor_Base.BP_MissionTaskEffectDoor_Base_C.ExecuteUbergraph_BP_MissionTaskEffectDoor_Base
// 0x0060 (0x0060 - 0x0000)
struct BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1DoorState                                  K2Node_Event_InState;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1DoorTiming                                 K2Node_Event_InTiming;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsCollisionEnabled_ReturnValue;        // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base) == 0x000008, "Wrong alignment on BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base");
static_assert(sizeof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base) == 0x000060, "Wrong size on BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, EntryPoint) == 0x000000, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, K2Node_Event_InState) == 0x00001C, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::K2Node_Event_InState' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, K2Node_Event_InTiming) == 0x00001D, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::K2Node_Event_InTiming' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000020, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, K2Node_SwitchEnum_CmpSuccess) == 0x000030, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, CallFunc_K2_IsCollisionEnabled_ReturnValue) == 0x000044, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::CallFunc_K2_IsCollisionEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000045, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, CallFunc_Array_AddUnique_ReturnValue) == 0x000050, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base, CallFunc_Less_IntInt_ReturnValue_1) == 0x00005C, "Member 'BP_MissionTaskEffectDoor_Base_C_ExecuteUbergraph_BP_MissionTaskEffectDoor_Base::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

}

