#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MissionTaskEffectDoor_Base

#include "Basic.hpp"

#include "M1_structs.hpp"
#include "BP_MissionTaskDoor_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MissionTaskEffectDoor_Base.BP_MissionTaskEffectDoor_Base_C
// 0x0020 (0x04A8 - 0x0488)
class ABP_MissionTaskEffectDoor_Base_C : public ABP_MissionTaskDoor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            CollisionComponents;                               // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BP_HandleDoorState(EM1DoorState InState, EM1DoorTiming InTiming);
	void ExecuteUbergraph_BP_MissionTaskEffectDoor_Base(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MissionTaskEffectDoor_Base_C">();
	}
	static class ABP_MissionTaskEffectDoor_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MissionTaskEffectDoor_Base_C>();
	}
};
static_assert(alignof(ABP_MissionTaskEffectDoor_Base_C) == 0x000008, "Wrong alignment on ABP_MissionTaskEffectDoor_Base_C");
static_assert(sizeof(ABP_MissionTaskEffectDoor_Base_C) == 0x0004A8, "Wrong size on ABP_MissionTaskEffectDoor_Base_C");
static_assert(offsetof(ABP_MissionTaskEffectDoor_Base_C, UberGraphFrame) == 0x000488, "Member 'ABP_MissionTaskEffectDoor_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MissionTaskEffectDoor_Base_C, Billboard) == 0x000490, "Member 'ABP_MissionTaskEffectDoor_Base_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_MissionTaskEffectDoor_Base_C, CollisionComponents) == 0x000498, "Member 'ABP_MissionTaskEffectDoor_Base_C::CollisionComponents' has a wrong offset!");

}

