#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MIS_Prologue_Door_001

#include "Basic.hpp"

#include "M1_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MIS_Prologue_Door_001.BP_MIS_Prologue_Door_001_C
// 0x01C0 (0x0648 - 0x0488)
class ABP_MIS_Prologue_Door_001_C final : public AM1MissionTaskDoor
{
public:
	class UBoxComponent*                          Door_02;                                           // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Door_01;                                           // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door_Root_02;                                      // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door_Root_01;                                      // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door_Ani;                                          // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collision_Door_01;                                 // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar02A_HJS2;                      // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar02A_HJS4;                      // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar02A_HJS6;                      // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collision_Door_02;                                 // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_ThinWall01A_CSW1;                    // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar02A_HJS3;                      // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar02A_HJS1;                      // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_ThinWall01A_CSW;                     // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar02A_HJS7;                      // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar02A_HJS5;                      // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar02A_HJS;                       // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Barricade01A_CSW6;                   // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Barricade01B_CSW1;                   // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar05_CSW;                        // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Barricade01A_CSW;                    // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Barricade01A_CSW5;                   // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar05_CSW5;                       // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar05_CSW4;                       // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar05_CSW6;                       // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW4;                       // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_PillarB02B_CSW1;                     // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_PillarB02A_CSW2;                     // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar05_CSW2;                       // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Barricade01A_CSW4;                   // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Barricade01B_CSW;                    // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar05_CSW1;                       // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Barricade01A_CSW3;                   // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Barricade01A_CSW2;                   // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Barricade01A_CSW1;                   // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW2;                       // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW1;                       // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar05_CSW8;                       // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW;                        // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW3;                       // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_PillarB02A_CSW;                      // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW7;                       // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Platform02C_CSW1;                    // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar05_CSW7;                       // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Platform02C_CSW;                     // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar05_CSW3;                       // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW6;                       // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_PillarB02A_CSW1;                     // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_PillarB02B_CSW;                      // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Pillar06_CSW5;                       // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collision5;                                        // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collision4;                                        // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collision3;                                        // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collision2;                                        // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collision1;                                        // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collision;                                         // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	class UShapeComponent* BP_GetNavObstacleComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MIS_Prologue_Door_001_C">();
	}
	static class ABP_MIS_Prologue_Door_001_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MIS_Prologue_Door_001_C>();
	}
};
static_assert(alignof(ABP_MIS_Prologue_Door_001_C) == 0x000008, "Wrong alignment on ABP_MIS_Prologue_Door_001_C");
static_assert(sizeof(ABP_MIS_Prologue_Door_001_C) == 0x000648, "Wrong size on ABP_MIS_Prologue_Door_001_C");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, Door_02) == 0x000488, "Member 'ABP_MIS_Prologue_Door_001_C::Door_02' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, Door_01) == 0x000490, "Member 'ABP_MIS_Prologue_Door_001_C::Door_01' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, Door_Root_02) == 0x000498, "Member 'ABP_MIS_Prologue_Door_001_C::Door_Root_02' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, Door_Root_01) == 0x0004A0, "Member 'ABP_MIS_Prologue_Door_001_C::Door_Root_01' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, Door_Ani) == 0x0004A8, "Member 'ABP_MIS_Prologue_Door_001_C::Door_Ani' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, Collision_Door_01) == 0x0004B0, "Member 'ABP_MIS_Prologue_Door_001_C::Collision_Door_01' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar02A_HJS2) == 0x0004B8, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar02A_HJS2' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar02A_HJS4) == 0x0004C0, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar02A_HJS4' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar02A_HJS6) == 0x0004C8, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar02A_HJS6' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, Collision_Door_02) == 0x0004D0, "Member 'ABP_MIS_Prologue_Door_001_C::Collision_Door_02' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_ThinWall01A_CSW1) == 0x0004D8, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_ThinWall01A_CSW1' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar02A_HJS3) == 0x0004E0, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar02A_HJS3' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar02A_HJS1) == 0x0004E8, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar02A_HJS1' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_ThinWall01A_CSW) == 0x0004F0, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_ThinWall01A_CSW' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar02A_HJS7) == 0x0004F8, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar02A_HJS7' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar02A_HJS5) == 0x000500, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar02A_HJS5' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar02A_HJS) == 0x000508, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar02A_HJS' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Barricade01A_CSW6) == 0x000510, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Barricade01A_CSW6' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Barricade01B_CSW1) == 0x000518, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Barricade01B_CSW1' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar05_CSW) == 0x000520, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar05_CSW' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Barricade01A_CSW) == 0x000528, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Barricade01A_CSW' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Barricade01A_CSW5) == 0x000530, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Barricade01A_CSW5' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar05_CSW5) == 0x000538, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar05_CSW5' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar05_CSW4) == 0x000540, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar05_CSW4' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar05_CSW6) == 0x000548, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar05_CSW6' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar06_CSW4) == 0x000550, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar06_CSW4' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_PillarB02B_CSW1) == 0x000558, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_PillarB02B_CSW1' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_PillarB02A_CSW2) == 0x000560, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_PillarB02A_CSW2' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar05_CSW2) == 0x000568, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar05_CSW2' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Barricade01A_CSW4) == 0x000570, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Barricade01A_CSW4' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Barricade01B_CSW) == 0x000578, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Barricade01B_CSW' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar05_CSW1) == 0x000580, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar05_CSW1' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Barricade01A_CSW3) == 0x000588, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Barricade01A_CSW3' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Barricade01A_CSW2) == 0x000590, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Barricade01A_CSW2' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Barricade01A_CSW1) == 0x000598, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Barricade01A_CSW1' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar06_CSW2) == 0x0005A0, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar06_CSW2' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar06_CSW1) == 0x0005A8, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar06_CSW1' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar05_CSW8) == 0x0005B0, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar05_CSW8' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar06_CSW) == 0x0005B8, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar06_CSW' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar06_CSW3) == 0x0005C0, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar06_CSW3' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_PillarB02A_CSW) == 0x0005C8, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_PillarB02A_CSW' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar06_CSW7) == 0x0005D0, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar06_CSW7' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Platform02C_CSW1) == 0x0005D8, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Platform02C_CSW1' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar05_CSW7) == 0x0005E0, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar05_CSW7' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Platform02C_CSW) == 0x0005E8, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Platform02C_CSW' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar05_CSW3) == 0x0005F0, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar05_CSW3' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar06_CSW6) == 0x0005F8, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar06_CSW6' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_PillarB02A_CSW1) == 0x000600, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_PillarB02A_CSW1' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_PillarB02B_CSW) == 0x000608, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_PillarB02B_CSW' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, SM_HeavenRuin_Pillar06_CSW5) == 0x000610, "Member 'ABP_MIS_Prologue_Door_001_C::SM_HeavenRuin_Pillar06_CSW5' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, Collision5) == 0x000618, "Member 'ABP_MIS_Prologue_Door_001_C::Collision5' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, Collision4) == 0x000620, "Member 'ABP_MIS_Prologue_Door_001_C::Collision4' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, Collision3) == 0x000628, "Member 'ABP_MIS_Prologue_Door_001_C::Collision3' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, Collision2) == 0x000630, "Member 'ABP_MIS_Prologue_Door_001_C::Collision2' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, Collision1) == 0x000638, "Member 'ABP_MIS_Prologue_Door_001_C::Collision1' has a wrong offset!");
static_assert(offsetof(ABP_MIS_Prologue_Door_001_C, Collision) == 0x000640, "Member 'ABP_MIS_Prologue_Door_001_C::Collision' has a wrong offset!");

}

