#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Prologue_Viessa_Door_HJS

#include "Basic.hpp"

#include "M1_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Prologue_Viessa_Door_HJS.BP_Prologue_Viessa_Door_HJS_C
// 0x0020 (0x04A8 - 0x0488)
class ABP_Prologue_Viessa_Door_HJS_C final : public AM1MissionTaskDoor
{
public:
	class UStaticMeshComponent*                   SM_HeavenRuin_Map_ShortWall00A_SSA;                // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_CircleQuarter02_CSW;                 // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_RoundRoof03_KJY;                     // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HeavenRuin_Wall03_CSW;                          // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Prologue_Viessa_Door_HJS_C">();
	}
	static class ABP_Prologue_Viessa_Door_HJS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Prologue_Viessa_Door_HJS_C>();
	}
};
static_assert(alignof(ABP_Prologue_Viessa_Door_HJS_C) == 0x000008, "Wrong alignment on ABP_Prologue_Viessa_Door_HJS_C");
static_assert(sizeof(ABP_Prologue_Viessa_Door_HJS_C) == 0x0004A8, "Wrong size on ABP_Prologue_Viessa_Door_HJS_C");
static_assert(offsetof(ABP_Prologue_Viessa_Door_HJS_C, SM_HeavenRuin_Map_ShortWall00A_SSA) == 0x000488, "Member 'ABP_Prologue_Viessa_Door_HJS_C::SM_HeavenRuin_Map_ShortWall00A_SSA' has a wrong offset!");
static_assert(offsetof(ABP_Prologue_Viessa_Door_HJS_C, SM_HeavenRuin_CircleQuarter02_CSW) == 0x000490, "Member 'ABP_Prologue_Viessa_Door_HJS_C::SM_HeavenRuin_CircleQuarter02_CSW' has a wrong offset!");
static_assert(offsetof(ABP_Prologue_Viessa_Door_HJS_C, SM_HeavenRuin_RoundRoof03_KJY) == 0x000498, "Member 'ABP_Prologue_Viessa_Door_HJS_C::SM_HeavenRuin_RoundRoof03_KJY' has a wrong offset!");
static_assert(offsetof(ABP_Prologue_Viessa_Door_HJS_C, SM_HeavenRuin_Wall03_CSW) == 0x0004A0, "Member 'ABP_Prologue_Viessa_Door_HJS_C::SM_HeavenRuin_Wall03_CSW' has a wrong offset!");

}

