#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Sec_PC_003_A0101

#include "Basic.hpp"

#include "M1AnimPhys_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "M1_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Sec_PC_003_A0101.BP_Sec_PC_003_A0101_C
// 0x3F90 (0x42B0 - 0x0320)
class UBP_Sec_PC_003_A0101_C final : public UAnimInstance
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0328(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0330(0x0008)()
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_15;                       // 0x0340(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_14;                       // 0x0710(0x03D0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0AE0(0x00C8)()
	uint8                                         Pad_BA8[0x8];                                      // 0x0BA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_13;                       // 0x0BB0(0x03D0)()
	struct FM1AnimNode_ModifyBone_Expression      M1AnimGraphNode_ModifyBone_Expression;             // 0x0F80(0x0170)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x10F0(0x0020)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_12;                       // 0x1110(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_11;                       // 0x14E0(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_10;                       // 0x18B0(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_9;                        // 0x1C80(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_8;                        // 0x2050(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_7;                        // 0x2420(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_6;                        // 0x27F0(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_5;                        // 0x2BC0(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_4;                        // 0x2F90(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_3;                        // 0x3360(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_2;                        // 0x3730(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_1;                        // 0x3B00(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys;                          // 0x3ED0(0x03D0)()
	double                                        KawaiiAlpha;                                       // 0x42A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Sec_PC_003_A0101(int32 EntryPoint);
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Sec_PC_003_A0101_C">();
	}
	static class UBP_Sec_PC_003_A0101_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Sec_PC_003_A0101_C>();
	}
};
static_assert(alignof(UBP_Sec_PC_003_A0101_C) == 0x000010, "Wrong alignment on UBP_Sec_PC_003_A0101_C");
static_assert(sizeof(UBP_Sec_PC_003_A0101_C) == 0x0042B0, "Wrong size on UBP_Sec_PC_003_A0101_C");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, UberGraphFrame) == 0x000320, "Member 'UBP_Sec_PC_003_A0101_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, AnimBlueprintExtension_PropertyAccess) == 0x000328, "Member 'UBP_Sec_PC_003_A0101_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, AnimBlueprintExtension_Base) == 0x000330, "Member 'UBP_Sec_PC_003_A0101_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_AnimPhys_15) == 0x000340, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_AnimPhys_15' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_AnimPhys_14) == 0x000710, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_AnimPhys_14' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, AnimGraphNode_LinkedInputPose) == 0x000AE0, "Member 'UBP_Sec_PC_003_A0101_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_AnimPhys_13) == 0x000BB0, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_AnimPhys_13' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_ModifyBone_Expression) == 0x000F80, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_ModifyBone_Expression' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, AnimGraphNode_Root) == 0x0010F0, "Member 'UBP_Sec_PC_003_A0101_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_AnimPhys_12) == 0x001110, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_AnimPhys_12' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_AnimPhys_11) == 0x0014E0, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_AnimPhys_11' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_AnimPhys_10) == 0x0018B0, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_AnimPhys_10' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_AnimPhys_9) == 0x001C80, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_AnimPhys_9' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_AnimPhys_8) == 0x002050, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_AnimPhys_8' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_AnimPhys_7) == 0x002420, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_AnimPhys_7' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_AnimPhys_6) == 0x0027F0, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_AnimPhys_6' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_AnimPhys_5) == 0x002BC0, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_AnimPhys_5' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_AnimPhys_4) == 0x002F90, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_AnimPhys_4' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_AnimPhys_3) == 0x003360, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_AnimPhys_3' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_AnimPhys_2) == 0x003730, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_AnimPhys_2' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_AnimPhys_1) == 0x003B00, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_AnimPhys_1' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, M1AnimGraphNode_AnimPhys) == 0x003ED0, "Member 'UBP_Sec_PC_003_A0101_C::M1AnimGraphNode_AnimPhys' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_003_A0101_C, KawaiiAlpha) == 0x0042A0, "Member 'UBP_Sec_PC_003_A0101_C::KawaiiAlpha' has a wrong offset!");

}

