#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WorldViewControllerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_WorldViewControllerComponent.BP_WorldViewControllerComponent_C.ExecuteUbergraph_BP_WorldViewControllerComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_WorldViewControllerComponent_C_ExecuteUbergraph_BP_WorldViewControllerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorldViewControllerComponent_C_ExecuteUbergraph_BP_WorldViewControllerComponent) == 0x000004, "Wrong alignment on BP_WorldViewControllerComponent_C_ExecuteUbergraph_BP_WorldViewControllerComponent");
static_assert(sizeof(BP_WorldViewControllerComponent_C_ExecuteUbergraph_BP_WorldViewControllerComponent) == 0x000008, "Wrong size on BP_WorldViewControllerComponent_C_ExecuteUbergraph_BP_WorldViewControllerComponent");
static_assert(offsetof(BP_WorldViewControllerComponent_C_ExecuteUbergraph_BP_WorldViewControllerComponent, EntryPoint) == 0x000000, "Member 'BP_WorldViewControllerComponent_C_ExecuteUbergraph_BP_WorldViewControllerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WorldViewControllerComponent_C_ExecuteUbergraph_BP_WorldViewControllerComponent, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_WorldViewControllerComponent_C_ExecuteUbergraph_BP_WorldViewControllerComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorldViewControllerComponent_C_ExecuteUbergraph_BP_WorldViewControllerComponent, K2Node_Event_EndPlayReason) == 0x000005, "Member 'BP_WorldViewControllerComponent_C_ExecuteUbergraph_BP_WorldViewControllerComponent::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_WorldViewControllerComponent.BP_WorldViewControllerComponent_C.PlayWorldViewMovie
// 0x0018 (0x0018 - 0x0000)
struct BP_WorldViewControllerComponent_C_PlayWorldViewMovie final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Prologue_WorldViewMovie_C*          CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddToPlayerScreen_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorldViewControllerComponent_C_PlayWorldViewMovie) == 0x000008, "Wrong alignment on BP_WorldViewControllerComponent_C_PlayWorldViewMovie");
static_assert(sizeof(BP_WorldViewControllerComponent_C_PlayWorldViewMovie) == 0x000018, "Wrong size on BP_WorldViewControllerComponent_C_PlayWorldViewMovie");
static_assert(offsetof(BP_WorldViewControllerComponent_C_PlayWorldViewMovie, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'BP_WorldViewControllerComponent_C_PlayWorldViewMovie::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorldViewControllerComponent_C_PlayWorldViewMovie, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_WorldViewControllerComponent_C_PlayWorldViewMovie::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorldViewControllerComponent_C_PlayWorldViewMovie, CallFunc_AddToPlayerScreen_ReturnValue) == 0x000010, "Member 'BP_WorldViewControllerComponent_C_PlayWorldViewMovie::CallFunc_AddToPlayerScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WorldViewControllerComponent_C_PlayWorldViewMovie, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_WorldViewControllerComponent_C_PlayWorldViewMovie::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_WorldViewControllerComponent.BP_WorldViewControllerComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_WorldViewControllerComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WorldViewControllerComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_WorldViewControllerComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_WorldViewControllerComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_WorldViewControllerComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_WorldViewControllerComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_WorldViewControllerComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

