#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bunny

#include "Basic.hpp"

#include "PlayerBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bunny.Bunny_C
// 0x0010 (0x10F0 - 0x10E0)
class ABunny_C : public APlayerBase_C
{
public:
	class UM1PlayerBeamComponent*                 M1PlayerBeam_Lv3;                                  // 0x10D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UM1PlayerBeamComponent*                 M1PlayerBeam_Lv2;                                  // 0x10E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UM1PlayerBeamComponent*                 M1PlayerBeam_Lv1;                                  // 0x10E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bunny_C">();
	}
	static class ABunny_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABunny_C>();
	}
};
static_assert(alignof(ABunny_C) == 0x000010, "Wrong alignment on ABunny_C");
static_assert(sizeof(ABunny_C) == 0x0010F0, "Wrong size on ABunny_C");
static_assert(offsetof(ABunny_C, M1PlayerBeam_Lv3) == 0x0010D8, "Member 'ABunny_C::M1PlayerBeam_Lv3' has a wrong offset!");
static_assert(offsetof(ABunny_C, M1PlayerBeam_Lv2) == 0x0010E0, "Member 'ABunny_C::M1PlayerBeam_Lv2' has a wrong offset!");
static_assert(offsetof(ABunny_C, M1PlayerBeam_Lv1) == 0x0010E8, "Member 'ABunny_C::M1PlayerBeam_Lv1' has a wrong offset!");

}

