#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalcRecoveryHPAndOther

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "M1_structs.hpp"
#include "M1Data_structs.hpp"


namespace SDK::Params
{

// Function CalcRecoveryHPAndOther.CalcRecoveryHPAndOther_C.ApplyCommonRecovery
// 0x01C0 (0x01C0 - 0x0000)
struct CalcRecoveryHPAndOther_C_ApplyCommonRecovery final
{
public:
	struct FM1AbilityOpCalcParam                  Param;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0008(0x0140)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	double                                        RecoveryAmount_0;                                  // 0x0148(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1RecoveryType                               RecoveryType_0;                                    // 0x0150(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1StatType                                   RecoveryStat;                                      // 0x0151(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1ScaledInteger                       Amount;                                            // 0x0158(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	EM1StatType                                   MaxStat;                                           // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue;                    // 0x0168(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue_1;                  // 0x0178(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue;                   // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue_2;                  // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Multiply_ScaledIntScaledInt_ReturnValue;  // 0x0190(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_1;                 // 0x01A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Multiply_ScaledIntScaledInt_ReturnValue_1; // 0x01A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FromFloat_InValue_ImplicitCast;           // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast_1;         // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast_2;         // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery) == 0x000008, "Wrong alignment on CalcRecoveryHPAndOther_C_ApplyCommonRecovery");
static_assert(sizeof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery) == 0x0001C0, "Wrong size on CalcRecoveryHPAndOther_C_ApplyCommonRecovery");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, Param) == 0x000000, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::Param' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, DamageInfo) == 0x000008, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::DamageInfo' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, RecoveryAmount_0) == 0x000148, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::RecoveryAmount_0' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, RecoveryType_0) == 0x000150, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::RecoveryType_0' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, RecoveryStat) == 0x000151, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::RecoveryStat' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, Amount) == 0x000158, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::Amount' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, MaxStat) == 0x000160, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::MaxStat' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000161, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, CallFunc_FromFloat_ReturnValue) == 0x000168, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::CallFunc_FromFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000170, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, CallFunc_FromFloat_ReturnValue_1) == 0x000178, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::CallFunc_FromFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, CallFunc_GetRefStat_ReturnValue) == 0x000180, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::CallFunc_GetRefStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, CallFunc_FromFloat_ReturnValue_2) == 0x000188, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::CallFunc_FromFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, CallFunc_Multiply_ScaledIntScaledInt_ReturnValue) == 0x000190, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::CallFunc_Multiply_ScaledIntScaledInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000198, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000199, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00019A, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, CallFunc_GetRefStat_ReturnValue_1) == 0x0001A0, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::CallFunc_GetRefStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, CallFunc_Multiply_ScaledIntScaledInt_ReturnValue_1) == 0x0001A8, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::CallFunc_Multiply_ScaledIntScaledInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, K2Node_SwitchEnum_CmpSuccess) == 0x0001B0, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, CallFunc_FromFloat_InValue_ImplicitCast) == 0x0001B4, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::CallFunc_FromFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, CallFunc_FromFloat_InValue_ImplicitCast_1) == 0x0001B8, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::CallFunc_FromFloat_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyCommonRecovery, CallFunc_FromFloat_InValue_ImplicitCast_2) == 0x0001BC, "Member 'CalcRecoveryHPAndOther_C_ApplyCommonRecovery::CallFunc_FromFloat_InValue_ImplicitCast_2' has a wrong offset!");

// Function CalcRecoveryHPAndOther.CalcRecoveryHPAndOther_C.ApplyMaxStatBaseRecovery
// 0x0198 (0x0198 - 0x0000)
struct CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery final
{
public:
	struct FM1AbilityOpCalcParam                  Param;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FM1CalcDamageInfo                      Damage_info;                                       // 0x0008(0x0140)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	EM1StatType                                   BaseStatType;                                      // 0x0148(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RecoveryAmount_0;                                  // 0x0150(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1StatType                                   RecoveryStatType;                                  // 0x0158(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1ScaledInteger                       Amount;                                            // 0x0160(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue;                   // 0x0168(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_ScaledIntToFloat_ReturnValue;        // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue;                    // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast;           // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery) == 0x000008, "Wrong alignment on CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery");
static_assert(sizeof(CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery) == 0x000198, "Wrong size on CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery, Param) == 0x000000, "Member 'CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery::Param' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery, Damage_info) == 0x000008, "Member 'CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery::Damage_info' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery, BaseStatType) == 0x000148, "Member 'CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery::BaseStatType' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery, RecoveryAmount_0) == 0x000150, "Member 'CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery::RecoveryAmount_0' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery, RecoveryStatType) == 0x000158, "Member 'CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery::RecoveryStatType' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery, Amount) == 0x000160, "Member 'CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery::Amount' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery, CallFunc_GetRefStat_ReturnValue) == 0x000168, "Member 'CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery::CallFunc_GetRefStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery, CallFunc_Conv_ScaledIntToFloat_ReturnValue) == 0x000170, "Member 'CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery::CallFunc_Conv_ScaledIntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000178, "Member 'CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery, CallFunc_FromFloat_ReturnValue) == 0x000180, "Member 'CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery::CallFunc_FromFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000188, "Member 'CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery, CallFunc_FromFloat_InValue_ImplicitCast) == 0x000190, "Member 'CalcRecoveryHPAndOther_C_ApplyMaxStatBaseRecovery::CallFunc_FromFloat_InValue_ImplicitCast' has a wrong offset!");

// Function CalcRecoveryHPAndOther.CalcRecoveryHPAndOther_C.ApplyRecoveryCoefficient
// 0x0490 (0x0490 - 0x0000)
struct CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient final
{
public:
	bool                                          UseRecoveryCoefficient;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityOpCalcParam                  Param;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0010(0x0140)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	EM1StatType                                   GiveRecoveryCoefficientStatType;                   // 0x0150(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1StatType                                   TakeRecoveryCoefficientStatType;                   // 0x0151(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue;       // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0168(0x0018)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0190(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01F8(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0258(0x0018)()
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue;                   // 0x0270(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0278(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_1;     // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x02D8(0x0018)()
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_1;                 // 0x02F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x02F8(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_2;     // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0358(0x0018)()
	struct FM1ScaledInteger                       CallFunc_ScaledIntegerOne_ReturnValue;             // 0x0370(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0378(0x0050)(HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Add_ScaledIntScaledInt_ReturnValue;       // 0x03C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Add_ScaledIntScaledInt_ReturnValue_1;     // 0x03D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_3;     // 0x03D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Multiply_ScaledIntScaledInt_ReturnValue;  // 0x03E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x03F0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0408(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0458(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0468(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0480(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient) == 0x000008, "Wrong alignment on CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient");
static_assert(sizeof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient) == 0x000490, "Wrong size on CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, UseRecoveryCoefficient) == 0x000000, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::UseRecoveryCoefficient' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, Param) == 0x000008, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::Param' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, DamageInfo) == 0x000010, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::DamageInfo' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, GiveRecoveryCoefficientStatType) == 0x000150, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::GiveRecoveryCoefficientStatType' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, TakeRecoveryCoefficientStatType) == 0x000151, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::TakeRecoveryCoefficientStatType' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_Conv_ScaledIntToString_ReturnValue) == 0x000158, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_Conv_ScaledIntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_Conv_StringToText_ReturnValue) == 0x000168, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000180, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, K2Node_MakeStruct_FormatArgumentData) == 0x000190, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001E0, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001F8, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000248, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000258, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_GetRefStat_ReturnValue) == 0x000270, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_GetRefStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, K2Node_MakeStruct_FormatArgumentData_2) == 0x000278, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_Conv_ScaledIntToString_ReturnValue_1) == 0x0002C8, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_Conv_ScaledIntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0002D8, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_GetRefStat_ReturnValue_1) == 0x0002F0, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_GetRefStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, K2Node_MakeStruct_FormatArgumentData_3) == 0x0002F8, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_Conv_ScaledIntToString_ReturnValue_2) == 0x000348, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_Conv_ScaledIntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000358, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_ScaledIntegerOne_ReturnValue) == 0x000370, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_ScaledIntegerOne_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, K2Node_MakeStruct_FormatArgumentData_4) == 0x000378, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_Add_ScaledIntScaledInt_ReturnValue) == 0x0003C8, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_Add_ScaledIntScaledInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_Add_ScaledIntScaledInt_ReturnValue_1) == 0x0003D0, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_Add_ScaledIntScaledInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_Conv_ScaledIntToString_ReturnValue_3) == 0x0003D8, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_Conv_ScaledIntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_Multiply_ScaledIntScaledInt_ReturnValue) == 0x0003E8, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_Multiply_ScaledIntScaledInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_Conv_StringToText_ReturnValue_5) == 0x0003F0, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_Conv_StringToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, K2Node_MakeStruct_FormatArgumentData_5) == 0x000408, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, K2Node_MakeArray_Array) == 0x000458, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_Format_ReturnValue) == 0x000468, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient, CallFunc_Conv_TextToString_ReturnValue) == 0x000480, "Member 'CalcRecoveryHPAndOther_C_ApplyRecoveryCoefficient::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function CalcRecoveryHPAndOther.CalcRecoveryHPAndOther_C.ApplySkillATK
// 0x0930 (0x0930 - 0x0000)
struct CalcRecoveryHPAndOther_C_ApplySkillATK final
{
public:
	struct FM1AbilityOpCalcParam                  Param;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0008(0x0140)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	EM1ElementalDamageChannel                     ElementalChannel;                                  // 0x0148(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1SkillArcheType                             ArcheType;                                         // 0x0149(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1ScaledInteger                       AddPower;                                          // 0x0150(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       AddAttack;                                         // 0x0158(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHittingPC;                                       // 0x0160(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1StatType                                   ATKStat;                                           // 0x0161(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1ScaledInteger                       ArcheSkillAttack;                                  // 0x0168(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       ArcheSkillPower;                                   // 0x0170(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       ElementSkillAttack;                                // 0x0178(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       ElementSkillPower;                                 // 0x0180(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue;       // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0198(0x0018)()
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_1;     // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01C0(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0210(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0228(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_2;     // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0288(0x0018)()
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_3;     // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x02B0(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0300(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0318(0x0050)(HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_ScaledIntegerOne_ReturnValue;             // 0x0368(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Add_ScaledIntScaledInt_ReturnValue;       // 0x0370(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue;                   // 0x0378(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_4;     // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x03A0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x03B8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x03D0(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0420(0x0050)(HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_1;                 // 0x0470(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_5;     // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0488(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x0498(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_7;          // 0x04B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x04C8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0518(0x0050)(HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_2;                 // 0x0568(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_6;     // 0x0570(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_8;          // 0x0580(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x0598(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x05E8(0x0010)(ReferenceParm)
	struct FM1ScaledInteger                       CallFunc_ScaledIntegerOne_ReturnValue_1;           // 0x05F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0600(0x0018)()
	struct FM1ScaledInteger                       CallFunc_Add_ScaledIntScaledInt_ReturnValue_1;     // 0x0618(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0620(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Add_ScaledIntScaledInt_ReturnValue_2;     // 0x0630(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Add_ScaledIntScaledInt_ReturnValue_3;     // 0x0638(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_ScaledIntegerOne_ReturnValue_2;           // 0x0640(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Add_ScaledIntScaledInt_ReturnValue_4;     // 0x0648(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Add_ScaledIntScaledInt_ReturnValue_5;     // 0x0650(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_7;     // 0x0658(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_9;          // 0x0668(0x0018)()
	struct FM1ScaledInteger                       CallFunc_ScaledIntegerOne_ReturnValue_3;           // 0x0680(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x0688(0x0050)(HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Add_ScaledIntScaledInt_ReturnValue_6;     // 0x06D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x06E0(0x0010)(ReferenceParm)
	struct FM1ScaledInteger                       CallFunc_ScaledIntegerOne_ReturnValue_4;           // 0x06F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x06F8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0710(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_3;                 // 0x0720(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_4;                 // 0x0728(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Add_ScaledIntScaledInt_ReturnValue_7;     // 0x0730(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Multiply_ScaledIntScaledInt_ReturnValue;  // 0x0738(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_5;                 // 0x0740(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Multiply_ScaledIntScaledInt_ReturnValue_1; // 0x0748(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_8;     // 0x0750(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Multiply_ScaledIntScaledInt_ReturnValue_2; // 0x0760(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_10;         // 0x0768(0x0018)()
	struct FM1ScaledInteger                       CallFunc_Multiply_ScaledIntScaledInt_ReturnValue_3; // 0x0780(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_10;           // 0x0788(0x0050)(HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Multiply_ScaledIntScaledInt_ReturnValue_4; // 0x07D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_9;     // 0x07E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_11;         // 0x07F0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_11;           // 0x0808(0x0050)(HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_6;                 // 0x0858(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0860(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0870(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0888(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_7;                 // 0x0898(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_8;                 // 0x08A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_9;                 // 0x08A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_10;                // 0x08B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_11;                // 0x08B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_12;                // 0x08C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_13;                // 0x08C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x08D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D1[0x7];                                      // 0x08D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_14;                // 0x08D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_15;                // 0x08E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_16;                // 0x08E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_17;                // 0x08F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_18;                // 0x08F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_19;                // 0x0900(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_20;                // 0x0908(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_21;                // 0x0910(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_22;                // 0x0918(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_23;                // 0x0920(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalcRecoveryHPAndOther_C_ApplySkillATK) == 0x000008, "Wrong alignment on CalcRecoveryHPAndOther_C_ApplySkillATK");
static_assert(sizeof(CalcRecoveryHPAndOther_C_ApplySkillATK) == 0x000930, "Wrong size on CalcRecoveryHPAndOther_C_ApplySkillATK");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, Param) == 0x000000, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::Param' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, DamageInfo) == 0x000008, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::DamageInfo' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, ElementalChannel) == 0x000148, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::ElementalChannel' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, ArcheType) == 0x000149, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::ArcheType' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, AddPower) == 0x000150, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::AddPower' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, AddAttack) == 0x000158, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::AddAttack' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, IsHittingPC) == 0x000160, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::IsHittingPC' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, ATKStat) == 0x000161, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::ATKStat' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, ArcheSkillAttack) == 0x000168, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::ArcheSkillAttack' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, ArcheSkillPower) == 0x000170, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::ArcheSkillPower' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, ElementSkillAttack) == 0x000178, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::ElementSkillAttack' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, ElementSkillPower) == 0x000180, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::ElementSkillPower' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_ScaledIntToString_ReturnValue) == 0x000188, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_ScaledIntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_StringToText_ReturnValue) == 0x000198, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_ScaledIntToString_ReturnValue_1) == 0x0001B0, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_ScaledIntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, K2Node_MakeStruct_FormatArgumentData) == 0x0001C0, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000210, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, K2Node_MakeStruct_FormatArgumentData_1) == 0x000228, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_ScaledIntToString_ReturnValue_2) == 0x000278, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_ScaledIntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000288, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_ScaledIntToString_ReturnValue_3) == 0x0002A0, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_ScaledIntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, K2Node_MakeStruct_FormatArgumentData_2) == 0x0002B0, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000300, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, K2Node_MakeStruct_FormatArgumentData_3) == 0x000318, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_ScaledIntegerOne_ReturnValue) == 0x000368, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_ScaledIntegerOne_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Add_ScaledIntScaledInt_ReturnValue) == 0x000370, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Add_ScaledIntScaledInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_GetRefStat_ReturnValue) == 0x000378, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_GetRefStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000380, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_ScaledIntToString_ReturnValue_4) == 0x000390, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_ScaledIntToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_StringToText_ReturnValue_4) == 0x0003A0, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_StringToText_ReturnValue_5) == 0x0003B8, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_StringToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, K2Node_MakeStruct_FormatArgumentData_4) == 0x0003D0, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, K2Node_MakeStruct_FormatArgumentData_5) == 0x000420, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_GetRefStat_ReturnValue_1) == 0x000470, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_GetRefStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_ScaledIntToString_ReturnValue_5) == 0x000478, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_ScaledIntToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000488, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_StringToText_ReturnValue_6) == 0x000498, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_StringToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_StringToText_ReturnValue_7) == 0x0004B0, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_StringToText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, K2Node_MakeStruct_FormatArgumentData_6) == 0x0004C8, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, K2Node_MakeStruct_FormatArgumentData_7) == 0x000518, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_GetRefStat_ReturnValue_2) == 0x000568, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_GetRefStat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_ScaledIntToString_ReturnValue_6) == 0x000570, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_ScaledIntToString_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_StringToText_ReturnValue_8) == 0x000580, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_StringToText_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, K2Node_MakeStruct_FormatArgumentData_8) == 0x000598, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::K2Node_MakeStruct_FormatArgumentData_8' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, K2Node_MakeArray_Array) == 0x0005E8, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_ScaledIntegerOne_ReturnValue_1) == 0x0005F8, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_ScaledIntegerOne_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Format_ReturnValue) == 0x000600, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Add_ScaledIntScaledInt_ReturnValue_1) == 0x000618, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Add_ScaledIntScaledInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_TextToString_ReturnValue) == 0x000620, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Add_ScaledIntScaledInt_ReturnValue_2) == 0x000630, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Add_ScaledIntScaledInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Add_ScaledIntScaledInt_ReturnValue_3) == 0x000638, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Add_ScaledIntScaledInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_ScaledIntegerOne_ReturnValue_2) == 0x000640, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_ScaledIntegerOne_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Add_ScaledIntScaledInt_ReturnValue_4) == 0x000648, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Add_ScaledIntScaledInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Add_ScaledIntScaledInt_ReturnValue_5) == 0x000650, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Add_ScaledIntScaledInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_ScaledIntToString_ReturnValue_7) == 0x000658, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_ScaledIntToString_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Conv_StringToText_ReturnValue_9) == 0x000668, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Conv_StringToText_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_ScaledIntegerOne_ReturnValue_3) == 0x000680, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_ScaledIntegerOne_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, K2Node_MakeStruct_FormatArgumentData_9) == 0x000688, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::K2Node_MakeStruct_FormatArgumentData_9' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_Add_ScaledIntScaledInt_ReturnValue_6) == 0x0006D8, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_Add_ScaledIntScaledInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, K2Node_MakeArray_Array_1) == 0x0006E0, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(CalcRecoveryHPAndOther_C_ApplySkillATK, CallFunc_ScaledIntegerOne_ReturnValue_4) == 0x0006F0, "Member 'CalcRecoveryHPAndOther_C_ApplySkillATK::CallFunc_ScaledIntegerOne_ReturnValue_4' has a wrong offset!");
