#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalcUltimateFreynaSkillCost

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "M1_structs.hpp"
#include "M1Data_structs.hpp"


namespace SDK::Params
{

// Function CalcUltimateFreynaSkillCost.CalcUltimateFreynaSkillCost_C.DoCalculation
// 0x0390 (0x0390 - 0x0000)
struct CalcUltimateFreynaSkillCost_C_DoCalculation final
{
public:
	struct FM1AbilityOpCalcParam                  Param;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0008(0x0140)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FM1AbilityOpExecCalcOutput             Output;                                            // 0x0148(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0168(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0180(0x0050)(HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue;                    // 0x01D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1StatTypeOpValue                     K2Node_MakeStruct_M1StatTypeOpValue;               // 0x01D8(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1ScaledInteger                       CallFunc_FromInt_ReturnValue;                      // 0x01F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue;                   // 0x01F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_1;                 // 0x0200(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Divide_ScaledIntScaledInt_ReturnValue;    // 0x0208(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue_1;                  // 0x0218(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_2;                 // 0x0220(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_ScaledIntScaledInt_ReturnValue; // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_ScaledIntScaledInt_ReturnValue_1; // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22B[0x5];                                      // 0x022B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0240(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0258(0x0050)(HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_3;                 // 0x02A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Multiply_ScaledIntScaledInt_ReturnValue;  // 0x02B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_4;                 // 0x02B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1StatTypeOpValue                     K2Node_MakeStruct_M1StatTypeOpValue_1;             // 0x02C0(0x0010)(NoDestructor)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue;       // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x02E8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0300(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0350(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0360(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast;           // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast_1;         // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalcUltimateFreynaSkillCost_C_DoCalculation) == 0x000008, "Wrong alignment on CalcUltimateFreynaSkillCost_C_DoCalculation");
static_assert(sizeof(CalcUltimateFreynaSkillCost_C_DoCalculation) == 0x000390, "Wrong size on CalcUltimateFreynaSkillCost_C_DoCalculation");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, Param) == 0x000000, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::Param' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, DamageInfo) == 0x000008, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::DamageInfo' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, Output) == 0x000148, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::Output' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000158, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue) == 0x000168, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData) == 0x000180, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_FromFloat_ReturnValue) == 0x0001D0, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_FromFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, K2Node_MakeStruct_M1StatTypeOpValue) == 0x0001D8, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::K2Node_MakeStruct_M1StatTypeOpValue' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_Array_Add_ReturnValue) == 0x0001E8, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_FromInt_ReturnValue) == 0x0001F0, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_FromInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_GetRefStat_ReturnValue) == 0x0001F8, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_GetRefStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_GetRefStat_ReturnValue_1) == 0x000200, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_GetRefStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_Divide_ScaledIntScaledInt_ReturnValue) == 0x000208, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_Divide_ScaledIntScaledInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_Abs_ReturnValue) == 0x000210, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_FromFloat_ReturnValue_1) == 0x000218, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_FromFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_GetRefStat_ReturnValue_2) == 0x000220, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_GetRefStat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_LessEqual_ScaledIntScaledInt_ReturnValue) == 0x000228, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_LessEqual_ScaledIntScaledInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_LessEqual_ScaledIntScaledInt_ReturnValue_1) == 0x000229, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_LessEqual_ScaledIntScaledInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_BooleanOR_ReturnValue) == 0x00022A, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000230, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000240, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_1) == 0x000258, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_GetRefStat_ReturnValue_3) == 0x0002A8, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_GetRefStat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_Multiply_ScaledIntScaledInt_ReturnValue) == 0x0002B0, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_Multiply_ScaledIntScaledInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_GetRefStat_ReturnValue_4) == 0x0002B8, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_GetRefStat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, K2Node_MakeStruct_M1StatTypeOpValue_1) == 0x0002C0, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::K2Node_MakeStruct_M1StatTypeOpValue_1' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_Conv_ScaledIntToString_ReturnValue) == 0x0002D0, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_Conv_ScaledIntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_Array_Add_ReturnValue_1) == 0x0002E0, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0002E8, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_2) == 0x000300, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, K2Node_MakeArray_Array) == 0x000350, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_Format_ReturnValue) == 0x000360, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_Conv_TextToString_ReturnValue) == 0x000378, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_FromFloat_InValue_ImplicitCast) == 0x000388, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_FromFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CalcUltimateFreynaSkillCost_C_DoCalculation, CallFunc_FromFloat_InValue_ImplicitCast_1) == 0x00038C, "Member 'CalcUltimateFreynaSkillCost_C_DoCalculation::CallFunc_FromFloat_InValue_ImplicitCast_1' has a wrong offset!");

}

