#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalcMaxStatBaseRecovery

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "M1_structs.hpp"
#include "M1Data_structs.hpp"


namespace SDK::Params
{

// Function CalcMaxStatBaseRecovery.CalcMaxStatBaseRecovery_C.DoCalculation
// 0x0440 (0x0440 - 0x0000)
struct CalcMaxStatBaseRecovery_C_DoCalculation final
{
public:
	struct FM1AbilityOpCalcParam                  Param;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0008(0x0140)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue;       // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0158(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0170(0x0050)(HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue;                   // 0x01C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_1;     // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01E8(0x0018)()
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0208(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0260(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x02C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x02D8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0328(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_DetermineRecoveryCoefficient_UseRecoveryCoefficient; // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1StatType                                   CallFunc_DetermineRecoveryCoefficient_TakeRecoveryCoefficient; // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1StatType                                   CallFunc_DetermineRecoveryCoefficient_GiveRecoveryCoefficient; // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B[0x5];                                      // 0x037B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1ScaledInteger                       CallFunc_ScaledIntegerOne_ReturnValue;             // 0x0380(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_ScaledIntegerMax_ReturnValue;             // 0x0388(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_1;                 // 0x0390(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_2;     // 0x0398(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x03B8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0408(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0418(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0430(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CalcMaxStatBaseRecovery_C_DoCalculation) == 0x000008, "Wrong alignment on CalcMaxStatBaseRecovery_C_DoCalculation");
static_assert(sizeof(CalcMaxStatBaseRecovery_C_DoCalculation) == 0x000440, "Wrong size on CalcMaxStatBaseRecovery_C_DoCalculation");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, Param) == 0x000000, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::Param' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, DamageInfo) == 0x000008, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::DamageInfo' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_Conv_ScaledIntToString_ReturnValue) == 0x000148, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_Conv_ScaledIntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue) == 0x000158, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData) == 0x000170, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_GetRefStat_ReturnValue) == 0x0001C0, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_GetRefStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0001C8, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_Conv_ScaledIntToString_ReturnValue_1) == 0x0001D8, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_Conv_ScaledIntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001E8, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_Conv_StringToInt_ReturnValue) == 0x000200, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_1) == 0x000208, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000258, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_2) == 0x000260, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x0002B0, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0002C0, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_3) == 0x0002D8, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_4) == 0x000328, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_DetermineRecoveryCoefficient_UseRecoveryCoefficient) == 0x000378, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_DetermineRecoveryCoefficient_UseRecoveryCoefficient' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_DetermineRecoveryCoefficient_TakeRecoveryCoefficient) == 0x000379, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_DetermineRecoveryCoefficient_TakeRecoveryCoefficient' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_DetermineRecoveryCoefficient_GiveRecoveryCoefficient) == 0x00037A, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_DetermineRecoveryCoefficient_GiveRecoveryCoefficient' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_ScaledIntegerOne_ReturnValue) == 0x000380, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_ScaledIntegerOne_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_ScaledIntegerMax_ReturnValue) == 0x000388, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_ScaledIntegerMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_GetRefStat_ReturnValue_1) == 0x000390, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_GetRefStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_Conv_ScaledIntToString_ReturnValue_2) == 0x000398, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_Conv_ScaledIntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_Conv_StringToInt_ReturnValue_1) == 0x0003A8, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_Conv_StringToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0003B0, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_5) == 0x0003B8, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, K2Node_MakeArray_Array) == 0x000408, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_Format_ReturnValue) == 0x000418, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcMaxStatBaseRecovery_C_DoCalculation, CallFunc_Conv_TextToString_ReturnValue) == 0x000430, "Member 'CalcMaxStatBaseRecovery_C_DoCalculation::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

}

