#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalcWeaponInstantHitDamage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "M1_structs.hpp"
#include "M1Data_structs.hpp"


namespace SDK::Params
{

// Function CalcWeaponInstantHitDamage.CalcWeaponInstantHitDamage_C.DoCalculation
// 0x0388 (0x0388 - 0x0000)
struct CalcWeaponInstantHitDamage_C_DoCalculation final
{
public:
	struct FM1AbilityOpCalcParam                  Param;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0008(0x0140)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FM1ScaledInteger                       ATKMultiplierByDistance;                           // 0x0148(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue;       // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0160(0x0018)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0188(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01D8(0x0018)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01F8(0x0050)(HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Array_Get_Item;                           // 0x0248(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_1;     // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_2;     // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0270(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0288(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x02A0(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x02F0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0340(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0350(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_DetermineATKMultiplierByDistance_RetATKMultiplierByDistance; // 0x0378(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyATKMultiplierByCharge_ATKMultiplierByCharge_ImplicitCast; // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalcWeaponInstantHitDamage_C_DoCalculation) == 0x000008, "Wrong alignment on CalcWeaponInstantHitDamage_C_DoCalculation");
static_assert(sizeof(CalcWeaponInstantHitDamage_C_DoCalculation) == 0x000388, "Wrong size on CalcWeaponInstantHitDamage_C_DoCalculation");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, Param) == 0x000000, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::Param' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, DamageInfo) == 0x000008, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::DamageInfo' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, ATKMultiplierByDistance) == 0x000148, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::ATKMultiplierByDistance' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, CallFunc_Conv_ScaledIntToString_ReturnValue) == 0x000150, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::CallFunc_Conv_ScaledIntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue) == 0x000160, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000178, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData) == 0x000188, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001D8, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0001F0, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001F8, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, CallFunc_Array_Get_Item) == 0x000248, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, CallFunc_Conv_ScaledIntToString_ReturnValue_1) == 0x000250, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::CallFunc_Conv_ScaledIntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, CallFunc_Conv_ScaledIntToString_ReturnValue_2) == 0x000260, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::CallFunc_Conv_ScaledIntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000270, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000288, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_2) == 0x0002A0, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_3) == 0x0002F0, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, K2Node_MakeArray_Array) == 0x000340, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, CallFunc_Format_ReturnValue) == 0x000350, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, CallFunc_Conv_TextToString_ReturnValue) == 0x000368, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, CallFunc_DetermineATKMultiplierByDistance_RetATKMultiplierByDistance) == 0x000378, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::CallFunc_DetermineATKMultiplierByDistance_RetATKMultiplierByDistance' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_DoCalculation, CallFunc_ApplyATKMultiplierByCharge_ATKMultiplierByCharge_ImplicitCast) == 0x000380, "Member 'CalcWeaponInstantHitDamage_C_DoCalculation::CallFunc_ApplyATKMultiplierByCharge_ATKMultiplierByCharge_ImplicitCast' has a wrong offset!");

// Function CalcWeaponInstantHitDamage.CalcWeaponInstantHitDamage_C.SetAdditionalDamageInfo
// 0x0150 (0x0150 - 0x0000)
struct CalcWeaponInstantHitDamage_C_SetAdditionalDamageInfo final
{
public:
	struct FM1AbilityOpCalcParam                  Param;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0008(0x0140)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue;                   // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalcWeaponInstantHitDamage_C_SetAdditionalDamageInfo) == 0x000008, "Wrong alignment on CalcWeaponInstantHitDamage_C_SetAdditionalDamageInfo");
static_assert(sizeof(CalcWeaponInstantHitDamage_C_SetAdditionalDamageInfo) == 0x000150, "Wrong size on CalcWeaponInstantHitDamage_C_SetAdditionalDamageInfo");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_SetAdditionalDamageInfo, Param) == 0x000000, "Member 'CalcWeaponInstantHitDamage_C_SetAdditionalDamageInfo::Param' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_SetAdditionalDamageInfo, DamageInfo) == 0x000008, "Member 'CalcWeaponInstantHitDamage_C_SetAdditionalDamageInfo::DamageInfo' has a wrong offset!");
static_assert(offsetof(CalcWeaponInstantHitDamage_C_SetAdditionalDamageInfo, CallFunc_GetRefStat_ReturnValue) == 0x000148, "Member 'CalcWeaponInstantHitDamage_C_SetAdditionalDamageInfo::CallFunc_GetRefStat_ReturnValue' has a wrong offset!");

}

