#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalcShieldInitializeStats

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "M1_structs.hpp"
#include "M1Data_structs.hpp"


namespace SDK::Params
{

// Function CalcShieldInitializeStats.CalcShieldInitializeStats_C.DoCalculation
// 0x0488 (0x0488 - 0x0000)
struct CalcShieldInitializeStats_C_DoCalculation final
{
public:
	struct FM1AbilityOpCalcParam                  Param;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0008(0x0140)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FM1AbilityOpExecCalcOutput             Output;                                            // 0x0148(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0158(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01B0(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0200(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0260(0x0018)()
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue;                   // 0x0278(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0280(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue;       // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x02E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x02F8(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_1;     // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0358(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0368(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0380(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0398(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x03E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x03F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0408(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0420(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue;                    // 0x0430(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_FromInt_ReturnValue;                      // 0x0438(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Multiply_ScaledIntScaledInt_ReturnValue;  // 0x0440(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_ScaledIntegerOne_ReturnValue;             // 0x0448(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue_1;                  // 0x0450(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_1;                 // 0x0458(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Add_ScaledIntScaledInt_ReturnValue;       // 0x0460(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Multiply_ScaledIntScaledInt_ReturnValue_1; // 0x0468(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Add_ScaledIntScaledInt_ReturnValue_1;     // 0x0470(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Add_ScaledIntScaledInt_ReturnValue_2;     // 0x0478(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast;           // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast_1;         // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalcShieldInitializeStats_C_DoCalculation) == 0x000008, "Wrong alignment on CalcShieldInitializeStats_C_DoCalculation");
static_assert(sizeof(CalcShieldInitializeStats_C_DoCalculation) == 0x000488, "Wrong size on CalcShieldInitializeStats_C_DoCalculation");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, Param) == 0x000000, "Member 'CalcShieldInitializeStats_C_DoCalculation::Param' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, DamageInfo) == 0x000008, "Member 'CalcShieldInitializeStats_C_DoCalculation::DamageInfo' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, Output) == 0x000148, "Member 'CalcShieldInitializeStats_C_DoCalculation::Output' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData) == 0x000158, "Member 'CalcShieldInitializeStats_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001A8, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001B0, "Member 'CalcShieldInitializeStats_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_2) == 0x000200, "Member 'CalcShieldInitializeStats_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000250, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue) == 0x000260, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_GetRefStat_ReturnValue) == 0x000278, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_GetRefStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_3) == 0x000280, "Member 'CalcShieldInitializeStats_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_Conv_ScaledIntToString_ReturnValue) == 0x0002D0, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_Conv_ScaledIntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0002E0, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_4) == 0x0002F8, "Member 'CalcShieldInitializeStats_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_Conv_ScaledIntToString_ReturnValue_1) == 0x000348, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_Conv_ScaledIntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, K2Node_MakeArray_Array) == 0x000358, "Member 'CalcShieldInitializeStats_C_DoCalculation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000368, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_Format_ReturnValue) == 0x000380, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_5) == 0x000398, "Member 'CalcShieldInitializeStats_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_Conv_TextToString_ReturnValue) == 0x0003E8, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, K2Node_MakeArray_Array_1) == 0x0003F8, "Member 'CalcShieldInitializeStats_C_DoCalculation::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_Format_ReturnValue_1) == 0x000408, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000420, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_FromFloat_ReturnValue) == 0x000430, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_FromFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_FromInt_ReturnValue) == 0x000438, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_FromInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_Multiply_ScaledIntScaledInt_ReturnValue) == 0x000440, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_Multiply_ScaledIntScaledInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_ScaledIntegerOne_ReturnValue) == 0x000448, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_ScaledIntegerOne_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_FromFloat_ReturnValue_1) == 0x000450, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_FromFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_GetRefStat_ReturnValue_1) == 0x000458, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_GetRefStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_Add_ScaledIntScaledInt_ReturnValue) == 0x000460, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_Add_ScaledIntScaledInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_Multiply_ScaledIntScaledInt_ReturnValue_1) == 0x000468, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_Multiply_ScaledIntScaledInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_Add_ScaledIntScaledInt_ReturnValue_1) == 0x000470, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_Add_ScaledIntScaledInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_Add_ScaledIntScaledInt_ReturnValue_2) == 0x000478, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_Add_ScaledIntScaledInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_FromFloat_InValue_ImplicitCast) == 0x000480, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_FromFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CalcShieldInitializeStats_C_DoCalculation, CallFunc_FromFloat_InValue_ImplicitCast_1) == 0x000484, "Member 'CalcShieldInitializeStats_C_DoCalculation::CallFunc_FromFloat_InValue_ImplicitCast_1' has a wrong offset!");

}

