#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalcHaileyUltraColdDamage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "M1_structs.hpp"
#include "M1Data_structs.hpp"


namespace SDK::Params
{

// Function CalcHaileyUltraColdDamage.CalcHaileyUltraColdDamage_C.DoCalculation
// 0x02A8 (0x02A8 - 0x0000)
struct CalcHaileyUltraColdDamage_C_DoCalculation final
{
public:
	struct FM1AbilityOpCalcParam                  Param;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0008(0x0140)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0148(0x0050)(HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue;                    // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue_1;                  // 0x01A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Multiply_ScaledIntScaledInt_ReturnValue;  // 0x01A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ScaledIntToText_ReturnValue;         // 0x01B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01C8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0218(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0268(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0278(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast;           // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast_1;         // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalcHaileyUltraColdDamage_C_DoCalculation) == 0x000008, "Wrong alignment on CalcHaileyUltraColdDamage_C_DoCalculation");
static_assert(sizeof(CalcHaileyUltraColdDamage_C_DoCalculation) == 0x0002A8, "Wrong size on CalcHaileyUltraColdDamage_C_DoCalculation");
static_assert(offsetof(CalcHaileyUltraColdDamage_C_DoCalculation, Param) == 0x000000, "Member 'CalcHaileyUltraColdDamage_C_DoCalculation::Param' has a wrong offset!");
static_assert(offsetof(CalcHaileyUltraColdDamage_C_DoCalculation, DamageInfo) == 0x000008, "Member 'CalcHaileyUltraColdDamage_C_DoCalculation::DamageInfo' has a wrong offset!");
static_assert(offsetof(CalcHaileyUltraColdDamage_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData) == 0x000148, "Member 'CalcHaileyUltraColdDamage_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CalcHaileyUltraColdDamage_C_DoCalculation, CallFunc_FromFloat_ReturnValue) == 0x000198, "Member 'CalcHaileyUltraColdDamage_C_DoCalculation::CallFunc_FromFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcHaileyUltraColdDamage_C_DoCalculation, CallFunc_FromFloat_ReturnValue_1) == 0x0001A0, "Member 'CalcHaileyUltraColdDamage_C_DoCalculation::CallFunc_FromFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcHaileyUltraColdDamage_C_DoCalculation, CallFunc_Multiply_ScaledIntScaledInt_ReturnValue) == 0x0001A8, "Member 'CalcHaileyUltraColdDamage_C_DoCalculation::CallFunc_Multiply_ScaledIntScaledInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcHaileyUltraColdDamage_C_DoCalculation, CallFunc_Conv_ScaledIntToText_ReturnValue) == 0x0001B0, "Member 'CalcHaileyUltraColdDamage_C_DoCalculation::CallFunc_Conv_ScaledIntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcHaileyUltraColdDamage_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001C8, "Member 'CalcHaileyUltraColdDamage_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CalcHaileyUltraColdDamage_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_2) == 0x000218, "Member 'CalcHaileyUltraColdDamage_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(CalcHaileyUltraColdDamage_C_DoCalculation, K2Node_MakeArray_Array) == 0x000268, "Member 'CalcHaileyUltraColdDamage_C_DoCalculation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CalcHaileyUltraColdDamage_C_DoCalculation, CallFunc_Format_ReturnValue) == 0x000278, "Member 'CalcHaileyUltraColdDamage_C_DoCalculation::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcHaileyUltraColdDamage_C_DoCalculation, CallFunc_Conv_TextToString_ReturnValue) == 0x000290, "Member 'CalcHaileyUltraColdDamage_C_DoCalculation::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcHaileyUltraColdDamage_C_DoCalculation, CallFunc_FromFloat_InValue_ImplicitCast) == 0x0002A0, "Member 'CalcHaileyUltraColdDamage_C_DoCalculation::CallFunc_FromFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CalcHaileyUltraColdDamage_C_DoCalculation, CallFunc_FromFloat_InValue_ImplicitCast_1) == 0x0002A4, "Member 'CalcHaileyUltraColdDamage_C_DoCalculation::CallFunc_FromFloat_InValue_ImplicitCast_1' has a wrong offset!");

}

