#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalcTargetHPRatioDamage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "M1_structs.hpp"
#include "M1Data_structs.hpp"


namespace SDK::Params
{

// Function CalcTargetHPRatioDamage.CalcTargetHPRatioDamage_C.DoCalculation
// 0x0468 (0x0468 - 0x0000)
struct CalcTargetHPRatioDamage_C_DoCalculation final
{
public:
	struct FM1AbilityOpCalcParam                  Param;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0008(0x0140)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FM1ScaledInteger                       TmpAtk;                                            // 0x0148(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue;                    // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue_1;                  // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue;       // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_1;     // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0180(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0198(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01B0(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0200(0x0050)(HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue_2;                  // 0x0250(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue_3;                  // 0x0258(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue;                   // 0x0260(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_1;                 // 0x0268(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Multiply_ScaledIntScaledInt_ReturnValue;  // 0x0270(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Multiply_ScaledIntScaledInt_ReturnValue_1; // 0x0278(0x0008)(NoDestructor, HasGetValueTypeHash)
	EM1MonsterCategory                            CallFunc_GetMonsterCategoryFromOpTarget_ReturnValue; // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue_4;                  // 0x0288(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_2;     // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_2;                 // 0x02A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x02A8(0x0018)()
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_3;     // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x02D0(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0320(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0338(0x0050)(HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue_5;                  // 0x0388(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_GetRefStat_ReturnValue_3;                 // 0x0390(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue_4;     // 0x0398(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Multiply_ScaledIntScaledInt_ReturnValue_2; // 0x03A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x03B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x03C8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0418(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0428(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0440(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast;           // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast_1;         // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast_2;         // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast_3;         // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast_4;         // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast_5;         // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalcTargetHPRatioDamage_C_DoCalculation) == 0x000008, "Wrong alignment on CalcTargetHPRatioDamage_C_DoCalculation");
static_assert(sizeof(CalcTargetHPRatioDamage_C_DoCalculation) == 0x000468, "Wrong size on CalcTargetHPRatioDamage_C_DoCalculation");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, Param) == 0x000000, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::Param' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, DamageInfo) == 0x000008, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::DamageInfo' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, TmpAtk) == 0x000148, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::TmpAtk' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_FromFloat_ReturnValue) == 0x000150, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_FromFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_FromFloat_ReturnValue_1) == 0x000158, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_FromFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_Conv_ScaledIntToString_ReturnValue) == 0x000160, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_Conv_ScaledIntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_Conv_ScaledIntToString_ReturnValue_1) == 0x000170, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_Conv_ScaledIntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue) == 0x000180, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000198, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData) == 0x0001B0, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_1) == 0x000200, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_FromFloat_ReturnValue_2) == 0x000250, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_FromFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_FromFloat_ReturnValue_3) == 0x000258, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_FromFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_GetRefStat_ReturnValue) == 0x000260, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_GetRefStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_GetRefStat_ReturnValue_1) == 0x000268, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_GetRefStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_Multiply_ScaledIntScaledInt_ReturnValue) == 0x000270, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_Multiply_ScaledIntScaledInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_Multiply_ScaledIntScaledInt_ReturnValue_1) == 0x000278, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_Multiply_ScaledIntScaledInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_GetMonsterCategoryFromOpTarget_ReturnValue) == 0x000280, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_GetMonsterCategoryFromOpTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, K2Node_SwitchEnum_CmpSuccess) == 0x000281, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_FromFloat_ReturnValue_4) == 0x000288, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_FromFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_Conv_ScaledIntToString_ReturnValue_2) == 0x000290, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_Conv_ScaledIntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_GetRefStat_ReturnValue_2) == 0x0002A0, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_GetRefStat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0002A8, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_Conv_ScaledIntToString_ReturnValue_3) == 0x0002C0, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_Conv_ScaledIntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_2) == 0x0002D0, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000320, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_3) == 0x000338, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_FromFloat_ReturnValue_5) == 0x000388, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_FromFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_GetRefStat_ReturnValue_3) == 0x000390, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_GetRefStat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_Conv_ScaledIntToString_ReturnValue_4) == 0x000398, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_Conv_ScaledIntToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_Multiply_ScaledIntScaledInt_ReturnValue_2) == 0x0003A8, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_Multiply_ScaledIntScaledInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue_4) == 0x0003B0, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_4) == 0x0003C8, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, K2Node_MakeArray_Array) == 0x000418, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_Format_ReturnValue) == 0x000428, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_Conv_TextToString_ReturnValue) == 0x000440, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_FromFloat_InValue_ImplicitCast) == 0x000450, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_FromFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_FromFloat_InValue_ImplicitCast_1) == 0x000454, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_FromFloat_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_FromFloat_InValue_ImplicitCast_2) == 0x000458, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_FromFloat_InValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_FromFloat_InValue_ImplicitCast_3) == 0x00045C, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_FromFloat_InValue_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_FromFloat_InValue_ImplicitCast_4) == 0x000460, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_FromFloat_InValue_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(CalcTargetHPRatioDamage_C_DoCalculation, CallFunc_FromFloat_InValue_ImplicitCast_5) == 0x000464, "Member 'CalcTargetHPRatioDamage_C_DoCalculation::CallFunc_FromFloat_InValue_ImplicitCast_5' has a wrong offset!");

}

