#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalcElementalDotDamage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "M1_structs.hpp"
#include "M1Data_structs.hpp"


namespace SDK::Params
{

// Function CalcElementalDotDamage.CalcElementalDotDamage_C.DoCalculation
// 0x0310 (0x0310 - 0x0000)
struct CalcElementalDotDamage_C_DoCalculation final
{
public:
	struct FM1AbilityOpCalcParam                  Param;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0008(0x0140)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue;       // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0158(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0170(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01D0(0x0018)()
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01F8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0248(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0260(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x02B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02C0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ScaledIntScaledInt_ReturnValue;   // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue;                    // 0x02F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue_1;                  // 0x02F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       CallFunc_Multiply_ScaledIntScaledInt_ReturnValue;  // 0x0300(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast;           // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast_1;         // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalcElementalDotDamage_C_DoCalculation) == 0x000008, "Wrong alignment on CalcElementalDotDamage_C_DoCalculation");
static_assert(sizeof(CalcElementalDotDamage_C_DoCalculation) == 0x000310, "Wrong size on CalcElementalDotDamage_C_DoCalculation");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, Param) == 0x000000, "Member 'CalcElementalDotDamage_C_DoCalculation::Param' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, DamageInfo) == 0x000008, "Member 'CalcElementalDotDamage_C_DoCalculation::DamageInfo' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, CallFunc_Conv_ScaledIntToString_ReturnValue) == 0x000148, "Member 'CalcElementalDotDamage_C_DoCalculation::CallFunc_Conv_ScaledIntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue) == 0x000158, "Member 'CalcElementalDotDamage_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData) == 0x000170, "Member 'CalcElementalDotDamage_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, CallFunc_Conv_DoubleToString_ReturnValue) == 0x0001C0, "Member 'CalcElementalDotDamage_C_DoCalculation::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001D0, "Member 'CalcElementalDotDamage_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x0001E8, "Member 'CalcElementalDotDamage_C_DoCalculation::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001F8, "Member 'CalcElementalDotDamage_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000248, "Member 'CalcElementalDotDamage_C_DoCalculation::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, K2Node_MakeStruct_FormatArgumentData_2) == 0x000260, "Member 'CalcElementalDotDamage_C_DoCalculation::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, K2Node_MakeArray_Array) == 0x0002B0, "Member 'CalcElementalDotDamage_C_DoCalculation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, CallFunc_Format_ReturnValue) == 0x0002C0, "Member 'CalcElementalDotDamage_C_DoCalculation::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, CallFunc_Conv_TextToString_ReturnValue) == 0x0002D8, "Member 'CalcElementalDotDamage_C_DoCalculation::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, CallFunc_Greater_ScaledIntScaledInt_ReturnValue) == 0x0002E8, "Member 'CalcElementalDotDamage_C_DoCalculation::CallFunc_Greater_ScaledIntScaledInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, CallFunc_FromFloat_ReturnValue) == 0x0002F0, "Member 'CalcElementalDotDamage_C_DoCalculation::CallFunc_FromFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, CallFunc_FromFloat_ReturnValue_1) == 0x0002F8, "Member 'CalcElementalDotDamage_C_DoCalculation::CallFunc_FromFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, CallFunc_Multiply_ScaledIntScaledInt_ReturnValue) == 0x000300, "Member 'CalcElementalDotDamage_C_DoCalculation::CallFunc_Multiply_ScaledIntScaledInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, CallFunc_FromFloat_InValue_ImplicitCast) == 0x000308, "Member 'CalcElementalDotDamage_C_DoCalculation::CallFunc_FromFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(CalcElementalDotDamage_C_DoCalculation, CallFunc_FromFloat_InValue_ImplicitCast_1) == 0x00030C, "Member 'CalcElementalDotDamage_C_DoCalculation::CallFunc_FromFloat_InValue_ImplicitCast_1' has a wrong offset!");

}

