#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CinematicSkelMesh_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass CinematicSkelMesh_AnimBP.CinematicSkelMesh_AnimBP_C
// 0x0150 (0x0470 - 0x0320)
class UCinematicSkelMesh_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0328(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0330(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0338(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0358(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03A0(0x00C8)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_CinematicSkelMesh_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CinematicSkelMesh_AnimBP_C">();
	}
	static class UCinematicSkelMesh_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCinematicSkelMesh_AnimBP_C>();
	}
};
static_assert(alignof(UCinematicSkelMesh_AnimBP_C) == 0x000010, "Wrong alignment on UCinematicSkelMesh_AnimBP_C");
static_assert(sizeof(UCinematicSkelMesh_AnimBP_C) == 0x000470, "Wrong size on UCinematicSkelMesh_AnimBP_C");
static_assert(offsetof(UCinematicSkelMesh_AnimBP_C, UberGraphFrame) == 0x000320, "Member 'UCinematicSkelMesh_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCinematicSkelMesh_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000328, "Member 'UCinematicSkelMesh_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UCinematicSkelMesh_AnimBP_C, AnimBlueprintExtension_Base) == 0x000330, "Member 'UCinematicSkelMesh_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UCinematicSkelMesh_AnimBP_C, AnimGraphNode_Root) == 0x000338, "Member 'UCinematicSkelMesh_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UCinematicSkelMesh_AnimBP_C, AnimGraphNode_Slot) == 0x000358, "Member 'UCinematicSkelMesh_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UCinematicSkelMesh_AnimBP_C, AnimGraphNode_LinkedInputPose) == 0x0003A0, "Member 'UCinematicSkelMesh_AnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");

}

