#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Default_Fist

#include "Basic.hpp"

#include "M1Data_structs.hpp"
#include "SubSkillSetting_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SubSkillCollision_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "M1_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function Default_Fist.Default_Fist_C.ServerDamageToEnemy
// 0x0010 (0x0010 - 0x0000)
struct Default_Fist_C_ServerDamageToEnemy final
{
public:
	TArray<class AActor*>                         InEnemies;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Default_Fist_C_ServerDamageToEnemy) == 0x000008, "Wrong alignment on Default_Fist_C_ServerDamageToEnemy");
static_assert(sizeof(Default_Fist_C_ServerDamageToEnemy) == 0x000010, "Wrong size on Default_Fist_C_ServerDamageToEnemy");
static_assert(offsetof(Default_Fist_C_ServerDamageToEnemy, InEnemies) == 0x000000, "Member 'Default_Fist_C_ServerDamageToEnemy::InEnemies' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.SendRuneEvent
// 0x0148 (0x0148 - 0x0000)
struct Default_Fist_C_SendRuneEvent final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AM1Character*                           K2Node_DynamicCast_AsM1Character;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FM1AbilityEvent                        K2Node_MakeStruct_M1AbilityEvent;                  // 0x0028(0x0040)()
	struct FM1AbilityEvent                        K2Node_MakeStruct_M1AbilityEvent_1;                // 0x0068(0x0040)()
	struct FM1AbilityEvent                        K2Node_MakeStruct_M1AbilityEvent_2;                // 0x00A8(0x0040)()
	struct FM1AbilityEvent                        K2Node_MakeStruct_M1AbilityEvent_3;                // 0x00E8(0x0040)()
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue_1;                     // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue_2;              // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue_3;              // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Default_Fist_C_SendRuneEvent) == 0x000008, "Wrong alignment on Default_Fist_C_SendRuneEvent");
static_assert(sizeof(Default_Fist_C_SendRuneEvent) == 0x000148, "Wrong size on Default_Fist_C_SendRuneEvent");
static_assert(offsetof(Default_Fist_C_SendRuneEvent, Object) == 0x000000, "Member 'Default_Fist_C_SendRuneEvent::Object' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendRuneEvent, CallFunc_GetOwnerActor_ReturnValue) == 0x000008, "Member 'Default_Fist_C_SendRuneEvent::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendRuneEvent, K2Node_DynamicCast_AsM1Character) == 0x000010, "Member 'Default_Fist_C_SendRuneEvent::K2Node_DynamicCast_AsM1Character' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendRuneEvent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Default_Fist_C_SendRuneEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendRuneEvent, CallFunc_GetOwnerActor_ReturnValue_1) == 0x000020, "Member 'Default_Fist_C_SendRuneEvent::CallFunc_GetOwnerActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendRuneEvent, K2Node_MakeStruct_M1AbilityEvent) == 0x000028, "Member 'Default_Fist_C_SendRuneEvent::K2Node_MakeStruct_M1AbilityEvent' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendRuneEvent, K2Node_MakeStruct_M1AbilityEvent_1) == 0x000068, "Member 'Default_Fist_C_SendRuneEvent::K2Node_MakeStruct_M1AbilityEvent_1' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendRuneEvent, K2Node_MakeStruct_M1AbilityEvent_2) == 0x0000A8, "Member 'Default_Fist_C_SendRuneEvent::K2Node_MakeStruct_M1AbilityEvent_2' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendRuneEvent, K2Node_MakeStruct_M1AbilityEvent_3) == 0x0000E8, "Member 'Default_Fist_C_SendRuneEvent::K2Node_MakeStruct_M1AbilityEvent_3' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendRuneEvent, CallFunc_IsDead_ReturnValue) == 0x000128, "Member 'Default_Fist_C_SendRuneEvent::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendRuneEvent, CallFunc_IsDead_ReturnValue_1) == 0x000129, "Member 'Default_Fist_C_SendRuneEvent::CallFunc_IsDead_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendRuneEvent, CallFunc_GetOwnerActor_ReturnValue_2) == 0x000130, "Member 'Default_Fist_C_SendRuneEvent::CallFunc_GetOwnerActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendRuneEvent, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000138, "Member 'Default_Fist_C_SendRuneEvent::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendRuneEvent, CallFunc_GetOwnerActor_ReturnValue_3) == 0x000140, "Member 'Default_Fist_C_SendRuneEvent::CallFunc_GetOwnerActor_ReturnValue_3' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.SendPrevRuneEvent
// 0x0098 (0x0098 - 0x0000)
struct Default_Fist_C_SendPrevRuneEvent final
{
public:
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FM1AbilityEvent                        K2Node_MakeStruct_M1AbilityEvent;                  // 0x0008(0x0040)()
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FM1AbilityEvent                        K2Node_MakeStruct_M1AbilityEvent_1;                // 0x0058(0x0040)()
};
static_assert(alignof(Default_Fist_C_SendPrevRuneEvent) == 0x000008, "Wrong alignment on Default_Fist_C_SendPrevRuneEvent");
static_assert(sizeof(Default_Fist_C_SendPrevRuneEvent) == 0x000098, "Wrong size on Default_Fist_C_SendPrevRuneEvent");
static_assert(offsetof(Default_Fist_C_SendPrevRuneEvent, CallFunc_GetOwnerActor_ReturnValue) == 0x000000, "Member 'Default_Fist_C_SendPrevRuneEvent::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendPrevRuneEvent, K2Node_MakeStruct_M1AbilityEvent) == 0x000008, "Member 'Default_Fist_C_SendPrevRuneEvent::K2Node_MakeStruct_M1AbilityEvent' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendPrevRuneEvent, CallFunc_NotEqual_GameplayTag_ReturnValue) == 0x000048, "Member 'Default_Fist_C_SendPrevRuneEvent::CallFunc_NotEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendPrevRuneEvent, CallFunc_GetOwnerActor_ReturnValue_1) == 0x000050, "Member 'Default_Fist_C_SendPrevRuneEvent::CallFunc_GetOwnerActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_SendPrevRuneEvent, K2Node_MakeStruct_M1AbilityEvent_1) == 0x000058, "Member 'Default_Fist_C_SendPrevRuneEvent::K2Node_MakeStruct_M1AbilityEvent_1' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.RotateToAttackDirectionIfNeed
// 0x0018 (0x0018 - 0x0000)
struct Default_Fist_C_RotateToAttackDirectionIfNeed final
{
public:
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Vector_IsNearlyZero_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Default_Fist_C_RotateToAttackDirectionIfNeed) == 0x000008, "Wrong alignment on Default_Fist_C_RotateToAttackDirectionIfNeed");
static_assert(sizeof(Default_Fist_C_RotateToAttackDirectionIfNeed) == 0x000018, "Wrong size on Default_Fist_C_RotateToAttackDirectionIfNeed");
static_assert(offsetof(Default_Fist_C_RotateToAttackDirectionIfNeed, CallFunc_GetOwnerActor_ReturnValue) == 0x000000, "Member 'Default_Fist_C_RotateToAttackDirectionIfNeed::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_RotateToAttackDirectionIfNeed, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000008, "Member 'Default_Fist_C_RotateToAttackDirectionIfNeed::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_RotateToAttackDirectionIfNeed, CallFunc_Vector_IsNearlyZero_ReturnValue) == 0x000014, "Member 'Default_Fist_C_RotateToAttackDirectionIfNeed::CallFunc_Vector_IsNearlyZero_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_RotateToAttackDirectionIfNeed, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000015, "Member 'Default_Fist_C_RotateToAttackDirectionIfNeed::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.OnUpdate_1C9BEB0A42DB15447A2DAA9BAFDF1BEE
// 0x0004 (0x0004 - 0x0000)
struct Default_Fist_C_OnUpdate_1C9BEB0A42DB15447A2DAA9BAFDF1BEE final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Default_Fist_C_OnUpdate_1C9BEB0A42DB15447A2DAA9BAFDF1BEE) == 0x000004, "Wrong alignment on Default_Fist_C_OnUpdate_1C9BEB0A42DB15447A2DAA9BAFDF1BEE");
static_assert(sizeof(Default_Fist_C_OnUpdate_1C9BEB0A42DB15447A2DAA9BAFDF1BEE) == 0x000004, "Wrong size on Default_Fist_C_OnUpdate_1C9BEB0A42DB15447A2DAA9BAFDF1BEE");
static_assert(offsetof(Default_Fist_C_OnUpdate_1C9BEB0A42DB15447A2DAA9BAFDF1BEE, DeltaTime) == 0x000000, "Member 'Default_Fist_C_OnUpdate_1C9BEB0A42DB15447A2DAA9BAFDF1BEE::DeltaTime' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.OnRep_bIsLanded
// 0x0018 (0x0018 - 0x0000)
struct Default_Fist_C_OnRep_bIsLanded final
{
public:
	class UAnimMontage*                           CallFunc_GetAnimMontage_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Default_Fist_C_OnRep_bIsLanded) == 0x000008, "Wrong alignment on Default_Fist_C_OnRep_bIsLanded");
static_assert(sizeof(Default_Fist_C_OnRep_bIsLanded) == 0x000018, "Wrong size on Default_Fist_C_OnRep_bIsLanded");
static_assert(offsetof(Default_Fist_C_OnRep_bIsLanded, CallFunc_GetAnimMontage_ReturnValue) == 0x000000, "Member 'Default_Fist_C_OnRep_bIsLanded::CallFunc_GetAnimMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_OnRep_bIsLanded, CallFunc_GetOwnerActor_ReturnValue) == 0x000008, "Member 'Default_Fist_C_OnRep_bIsLanded::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_OnRep_bIsLanded, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Default_Fist_C_OnRep_bIsLanded::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.OnFinished_FA896AD34AED6B31532A3BB7F0DD5EC9
// 0x0010 (0x0010 - 0x0000)
struct Default_Fist_C_OnFinished_FA896AD34AED6B31532A3BB7F0DD5EC9 final
{
public:
	bool                                          DestinationReached;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TimedOut;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FinalTargetLocation;                               // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Default_Fist_C_OnFinished_FA896AD34AED6B31532A3BB7F0DD5EC9) == 0x000004, "Wrong alignment on Default_Fist_C_OnFinished_FA896AD34AED6B31532A3BB7F0DD5EC9");
static_assert(sizeof(Default_Fist_C_OnFinished_FA896AD34AED6B31532A3BB7F0DD5EC9) == 0x000010, "Wrong size on Default_Fist_C_OnFinished_FA896AD34AED6B31532A3BB7F0DD5EC9");
static_assert(offsetof(Default_Fist_C_OnFinished_FA896AD34AED6B31532A3BB7F0DD5EC9, DestinationReached) == 0x000000, "Member 'Default_Fist_C_OnFinished_FA896AD34AED6B31532A3BB7F0DD5EC9::DestinationReached' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_OnFinished_FA896AD34AED6B31532A3BB7F0DD5EC9, TimedOut) == 0x000001, "Member 'Default_Fist_C_OnFinished_FA896AD34AED6B31532A3BB7F0DD5EC9::TimedOut' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_OnFinished_FA896AD34AED6B31532A3BB7F0DD5EC9, FinalTargetLocation) == 0x000004, "Member 'Default_Fist_C_OnFinished_FA896AD34AED6B31532A3BB7F0DD5EC9::FinalTargetLocation' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.OnEventReceived_D54F2B39422DA08EA130338C89FA1FCE
// 0x0040 (0x0040 - 0x0000)
struct Default_Fist_C_OnEventReceived_D54F2B39422DA08EA130338C89FA1FCE final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Default_Fist_C_OnEventReceived_D54F2B39422DA08EA130338C89FA1FCE) == 0x000008, "Wrong alignment on Default_Fist_C_OnEventReceived_D54F2B39422DA08EA130338C89FA1FCE");
static_assert(sizeof(Default_Fist_C_OnEventReceived_D54F2B39422DA08EA130338C89FA1FCE) == 0x000040, "Wrong size on Default_Fist_C_OnEventReceived_D54F2B39422DA08EA130338C89FA1FCE");
static_assert(offsetof(Default_Fist_C_OnEventReceived_D54F2B39422DA08EA130338C89FA1FCE, Event) == 0x000000, "Member 'Default_Fist_C_OnEventReceived_D54F2B39422DA08EA130338C89FA1FCE::Event' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.OnEventReceived_5E573E1E46AA8A55B901328E15DB16D6
// 0x0040 (0x0040 - 0x0000)
struct Default_Fist_C_OnEventReceived_5E573E1E46AA8A55B901328E15DB16D6 final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Default_Fist_C_OnEventReceived_5E573E1E46AA8A55B901328E15DB16D6) == 0x000008, "Wrong alignment on Default_Fist_C_OnEventReceived_5E573E1E46AA8A55B901328E15DB16D6");
static_assert(sizeof(Default_Fist_C_OnEventReceived_5E573E1E46AA8A55B901328E15DB16D6) == 0x000040, "Wrong size on Default_Fist_C_OnEventReceived_5E573E1E46AA8A55B901328E15DB16D6");
static_assert(offsetof(Default_Fist_C_OnEventReceived_5E573E1E46AA8A55B901328E15DB16D6, Event) == 0x000000, "Member 'Default_Fist_C_OnEventReceived_5E573E1E46AA8A55B901328E15DB16D6::Event' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.OnEventReceived_07EC16C846839553D378A2A49AB9C354
// 0x0040 (0x0040 - 0x0000)
struct Default_Fist_C_OnEventReceived_07EC16C846839553D378A2A49AB9C354 final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Default_Fist_C_OnEventReceived_07EC16C846839553D378A2A49AB9C354) == 0x000008, "Wrong alignment on Default_Fist_C_OnEventReceived_07EC16C846839553D378A2A49AB9C354");
static_assert(sizeof(Default_Fist_C_OnEventReceived_07EC16C846839553D378A2A49AB9C354) == 0x000040, "Wrong size on Default_Fist_C_OnEventReceived_07EC16C846839553D378A2A49AB9C354");
static_assert(offsetof(Default_Fist_C_OnEventReceived_07EC16C846839553D378A2A49AB9C354, Event) == 0x000000, "Member 'Default_Fist_C_OnEventReceived_07EC16C846839553D378A2A49AB9C354::Event' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.OnEvent_726A9F1347453B65ABB65DAE8EEB8F6E
// 0x0140 (0x0140 - 0x0000)
struct Default_Fist_C_OnEvent_726A9F1347453B65ABB65DAE8EEB8F6E final
{
public:
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0000(0x0140)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Default_Fist_C_OnEvent_726A9F1347453B65ABB65DAE8EEB8F6E) == 0x000008, "Wrong alignment on Default_Fist_C_OnEvent_726A9F1347453B65ABB65DAE8EEB8F6E");
static_assert(sizeof(Default_Fist_C_OnEvent_726A9F1347453B65ABB65DAE8EEB8F6E) == 0x000140, "Wrong size on Default_Fist_C_OnEvent_726A9F1347453B65ABB65DAE8EEB8F6E");
static_assert(offsetof(Default_Fist_C_OnEvent_726A9F1347453B65ABB65DAE8EEB8F6E, DamageInfo) == 0x000000, "Member 'Default_Fist_C_OnEvent_726A9F1347453B65ABB65DAE8EEB8F6E::DamageInfo' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.OnCompleted_D54F2B39422DA08EA130338C89FA1FCE
// 0x0040 (0x0040 - 0x0000)
struct Default_Fist_C_OnCompleted_D54F2B39422DA08EA130338C89FA1FCE final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Default_Fist_C_OnCompleted_D54F2B39422DA08EA130338C89FA1FCE) == 0x000008, "Wrong alignment on Default_Fist_C_OnCompleted_D54F2B39422DA08EA130338C89FA1FCE");
static_assert(sizeof(Default_Fist_C_OnCompleted_D54F2B39422DA08EA130338C89FA1FCE) == 0x000040, "Wrong size on Default_Fist_C_OnCompleted_D54F2B39422DA08EA130338C89FA1FCE");
static_assert(offsetof(Default_Fist_C_OnCompleted_D54F2B39422DA08EA130338C89FA1FCE, Event) == 0x000000, "Member 'Default_Fist_C_OnCompleted_D54F2B39422DA08EA130338C89FA1FCE::Event' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.OnCompleted_5E573E1E46AA8A55B901328E15DB16D6
// 0x0040 (0x0040 - 0x0000)
struct Default_Fist_C_OnCompleted_5E573E1E46AA8A55B901328E15DB16D6 final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Default_Fist_C_OnCompleted_5E573E1E46AA8A55B901328E15DB16D6) == 0x000008, "Wrong alignment on Default_Fist_C_OnCompleted_5E573E1E46AA8A55B901328E15DB16D6");
static_assert(sizeof(Default_Fist_C_OnCompleted_5E573E1E46AA8A55B901328E15DB16D6) == 0x000040, "Wrong size on Default_Fist_C_OnCompleted_5E573E1E46AA8A55B901328E15DB16D6");
static_assert(offsetof(Default_Fist_C_OnCompleted_5E573E1E46AA8A55B901328E15DB16D6, Event) == 0x000000, "Member 'Default_Fist_C_OnCompleted_5E573E1E46AA8A55B901328E15DB16D6::Event' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.OnCompleted_07EC16C846839553D378A2A49AB9C354
// 0x0040 (0x0040 - 0x0000)
struct Default_Fist_C_OnCompleted_07EC16C846839553D378A2A49AB9C354 final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Default_Fist_C_OnCompleted_07EC16C846839553D378A2A49AB9C354) == 0x000008, "Wrong alignment on Default_Fist_C_OnCompleted_07EC16C846839553D378A2A49AB9C354");
static_assert(sizeof(Default_Fist_C_OnCompleted_07EC16C846839553D378A2A49AB9C354) == 0x000040, "Wrong size on Default_Fist_C_OnCompleted_07EC16C846839553D378A2A49AB9C354");
static_assert(offsetof(Default_Fist_C_OnCompleted_07EC16C846839553D378A2A49AB9C354, Event) == 0x000000, "Member 'Default_Fist_C_OnCompleted_07EC16C846839553D378A2A49AB9C354::Event' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.OnBlendOut_D54F2B39422DA08EA130338C89FA1FCE
// 0x0040 (0x0040 - 0x0000)
struct Default_Fist_C_OnBlendOut_D54F2B39422DA08EA130338C89FA1FCE final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Default_Fist_C_OnBlendOut_D54F2B39422DA08EA130338C89FA1FCE) == 0x000008, "Wrong alignment on Default_Fist_C_OnBlendOut_D54F2B39422DA08EA130338C89FA1FCE");
static_assert(sizeof(Default_Fist_C_OnBlendOut_D54F2B39422DA08EA130338C89FA1FCE) == 0x000040, "Wrong size on Default_Fist_C_OnBlendOut_D54F2B39422DA08EA130338C89FA1FCE");
static_assert(offsetof(Default_Fist_C_OnBlendOut_D54F2B39422DA08EA130338C89FA1FCE, Event) == 0x000000, "Member 'Default_Fist_C_OnBlendOut_D54F2B39422DA08EA130338C89FA1FCE::Event' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.OnBlendOut_5E573E1E46AA8A55B901328E15DB16D6
// 0x0040 (0x0040 - 0x0000)
struct Default_Fist_C_OnBlendOut_5E573E1E46AA8A55B901328E15DB16D6 final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Default_Fist_C_OnBlendOut_5E573E1E46AA8A55B901328E15DB16D6) == 0x000008, "Wrong alignment on Default_Fist_C_OnBlendOut_5E573E1E46AA8A55B901328E15DB16D6");
static_assert(sizeof(Default_Fist_C_OnBlendOut_5E573E1E46AA8A55B901328E15DB16D6) == 0x000040, "Wrong size on Default_Fist_C_OnBlendOut_5E573E1E46AA8A55B901328E15DB16D6");
static_assert(offsetof(Default_Fist_C_OnBlendOut_5E573E1E46AA8A55B901328E15DB16D6, Event) == 0x000000, "Member 'Default_Fist_C_OnBlendOut_5E573E1E46AA8A55B901328E15DB16D6::Event' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.OnBlendOut_07EC16C846839553D378A2A49AB9C354
// 0x0040 (0x0040 - 0x0000)
struct Default_Fist_C_OnBlendOut_07EC16C846839553D378A2A49AB9C354 final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Default_Fist_C_OnBlendOut_07EC16C846839553D378A2A49AB9C354) == 0x000008, "Wrong alignment on Default_Fist_C_OnBlendOut_07EC16C846839553D378A2A49AB9C354");
static_assert(sizeof(Default_Fist_C_OnBlendOut_07EC16C846839553D378A2A49AB9C354) == 0x000040, "Wrong size on Default_Fist_C_OnBlendOut_07EC16C846839553D378A2A49AB9C354");
static_assert(offsetof(Default_Fist_C_OnBlendOut_07EC16C846839553D378A2A49AB9C354, Event) == 0x000000, "Member 'Default_Fist_C_OnBlendOut_07EC16C846839553D378A2A49AB9C354::Event' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.OnAbilityEvent_283F594C46065D7C2BA6929F6639E384
// 0x0040 (0x0040 - 0x0000)
struct Default_Fist_C_OnAbilityEvent_283F594C46065D7C2BA6929F6639E384 final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Default_Fist_C_OnAbilityEvent_283F594C46065D7C2BA6929F6639E384) == 0x000008, "Wrong alignment on Default_Fist_C_OnAbilityEvent_283F594C46065D7C2BA6929F6639E384");
static_assert(sizeof(Default_Fist_C_OnAbilityEvent_283F594C46065D7C2BA6929F6639E384) == 0x000040, "Wrong size on Default_Fist_C_OnAbilityEvent_283F594C46065D7C2BA6929F6639E384");
static_assert(offsetof(Default_Fist_C_OnAbilityEvent_283F594C46065D7C2BA6929F6639E384, Event) == 0x000000, "Member 'Default_Fist_C_OnAbilityEvent_283F594C46065D7C2BA6929F6639E384::Event' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.OnAbilityEvent_09DFF00F4B92C4EE431B928C804677D1
// 0x0040 (0x0040 - 0x0000)
struct Default_Fist_C_OnAbilityEvent_09DFF00F4B92C4EE431B928C804677D1 final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Default_Fist_C_OnAbilityEvent_09DFF00F4B92C4EE431B928C804677D1) == 0x000008, "Wrong alignment on Default_Fist_C_OnAbilityEvent_09DFF00F4B92C4EE431B928C804677D1");
static_assert(sizeof(Default_Fist_C_OnAbilityEvent_09DFF00F4B92C4EE431B928C804677D1) == 0x000040, "Wrong size on Default_Fist_C_OnAbilityEvent_09DFF00F4B92C4EE431B928C804677D1");
static_assert(offsetof(Default_Fist_C_OnAbilityEvent_09DFF00F4B92C4EE431B928C804677D1, Event) == 0x000000, "Member 'Default_Fist_C_OnAbilityEvent_09DFF00F4B92C4EE431B928C804677D1::Event' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.LaunchForWireLand
// 0x0018 (0x0018 - 0x0000)
struct Default_Fist_C_LaunchForWireLand final
{
public:
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_As___;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Default_Fist_C_LaunchForWireLand) == 0x000008, "Wrong alignment on Default_Fist_C_LaunchForWireLand");
static_assert(sizeof(Default_Fist_C_LaunchForWireLand) == 0x000018, "Wrong size on Default_Fist_C_LaunchForWireLand");
static_assert(offsetof(Default_Fist_C_LaunchForWireLand, CallFunc_GetOwnerActor_ReturnValue) == 0x000000, "Member 'Default_Fist_C_LaunchForWireLand::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_LaunchForWireLand, K2Node_DynamicCast_As___) == 0x000008, "Member 'Default_Fist_C_LaunchForWireLand::K2Node_DynamicCast_As___' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_LaunchForWireLand, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Default_Fist_C_LaunchForWireLand::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.HandleAbilityEvent
// 0x00C8 (0x00C8 - 0x0000)
struct Default_Fist_C_HandleAbilityEvent final
{
public:
	struct FM1AbilityEvent                        AbilityEvent;                                      // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   AttachSocket;                                      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AM1SkeletalMeshActor*                   SpawnedMesh;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FM1AbilityEventData_AnimNotifySubSkillMeshSpawn EventData;                                         // 0x0050(0x0028)(Edit, BlueprintVisible)
	struct FM1AbilityEventData_AnimNotifySubSkillMeshSpawn CallFunc_GetAbilityEventData_AnimNotifySubSkillMeshSpawn_ReturnValue; // 0x0078(0x0028)()
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue_1;                 // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AM1SkeletalMeshActor*                   CallFunc_Map_Find_Value;                           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AM1SkeletalMeshActor*                   CallFunc_Map_Find_Value_1;                         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Default_Fist_C_HandleAbilityEvent) == 0x000008, "Wrong alignment on Default_Fist_C_HandleAbilityEvent");
static_assert(sizeof(Default_Fist_C_HandleAbilityEvent) == 0x0000C8, "Wrong size on Default_Fist_C_HandleAbilityEvent");
static_assert(offsetof(Default_Fist_C_HandleAbilityEvent, AbilityEvent) == 0x000000, "Member 'Default_Fist_C_HandleAbilityEvent::AbilityEvent' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_HandleAbilityEvent, AttachSocket) == 0x000040, "Member 'Default_Fist_C_HandleAbilityEvent::AttachSocket' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_HandleAbilityEvent, SpawnedMesh) == 0x000048, "Member 'Default_Fist_C_HandleAbilityEvent::SpawnedMesh' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_HandleAbilityEvent, EventData) == 0x000050, "Member 'Default_Fist_C_HandleAbilityEvent::EventData' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_HandleAbilityEvent, CallFunc_GetAbilityEventData_AnimNotifySubSkillMeshSpawn_ReturnValue) == 0x000078, "Member 'Default_Fist_C_HandleAbilityEvent::CallFunc_GetAbilityEventData_AnimNotifySubSkillMeshSpawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_HandleAbilityEvent, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0000A0, "Member 'Default_Fist_C_HandleAbilityEvent::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_HandleAbilityEvent, CallFunc_Map_Remove_ReturnValue) == 0x0000A1, "Member 'Default_Fist_C_HandleAbilityEvent::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_HandleAbilityEvent, CallFunc_Map_Remove_ReturnValue_1) == 0x0000A2, "Member 'Default_Fist_C_HandleAbilityEvent::CallFunc_Map_Remove_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_HandleAbilityEvent, CallFunc_Map_Find_Value) == 0x0000A8, "Member 'Default_Fist_C_HandleAbilityEvent::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_HandleAbilityEvent, CallFunc_Map_Find_ReturnValue) == 0x0000B0, "Member 'Default_Fist_C_HandleAbilityEvent::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_HandleAbilityEvent, CallFunc_IsValid_ReturnValue) == 0x0000B1, "Member 'Default_Fist_C_HandleAbilityEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_HandleAbilityEvent, CallFunc_Map_Find_Value_1) == 0x0000B8, "Member 'Default_Fist_C_HandleAbilityEvent::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_HandleAbilityEvent, CallFunc_Map_Find_ReturnValue_1) == 0x0000C0, "Member 'Default_Fist_C_HandleAbilityEvent::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_HandleAbilityEvent, CallFunc_IsValid_ReturnValue_1) == 0x0000C1, "Member 'Default_Fist_C_HandleAbilityEvent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.GetNonChargeAnimMontage
// 0x0060 (0x0060 - 0x0000)
struct Default_Fist_C_GetNonChargeAnimMontage final
{
public:
	class UAnimMontage*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EM1PlayerAnimType                             CallFunc_GetPlayerAnimType_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSubSkillSetting                       CallFunc_Map_Find_Value;                           // 0x0020(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue_1;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EM1CharacterGender                            CallFunc_GetPlayerAnimPresetType_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Default_Fist_C_GetNonChargeAnimMontage) == 0x000008, "Wrong alignment on Default_Fist_C_GetNonChargeAnimMontage");
static_assert(sizeof(Default_Fist_C_GetNonChargeAnimMontage) == 0x000060, "Wrong size on Default_Fist_C_GetNonChargeAnimMontage");
static_assert(offsetof(Default_Fist_C_GetNonChargeAnimMontage, ReturnValue) == 0x000000, "Member 'Default_Fist_C_GetNonChargeAnimMontage::ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetNonChargeAnimMontage, Temp_bool_Variable) == 0x000008, "Member 'Default_Fist_C_GetNonChargeAnimMontage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetNonChargeAnimMontage, CallFunc_GetOwnerActor_ReturnValue) == 0x000010, "Member 'Default_Fist_C_GetNonChargeAnimMontage::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetNonChargeAnimMontage, CallFunc_GetPlayerAnimType_ReturnValue) == 0x000018, "Member 'Default_Fist_C_GetNonChargeAnimMontage::CallFunc_GetPlayerAnimType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetNonChargeAnimMontage, CallFunc_Map_Find_Value) == 0x000020, "Member 'Default_Fist_C_GetNonChargeAnimMontage::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetNonChargeAnimMontage, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'Default_Fist_C_GetNonChargeAnimMontage::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetNonChargeAnimMontage, CallFunc_GetOwnerActor_ReturnValue_1) == 0x000048, "Member 'Default_Fist_C_GetNonChargeAnimMontage::CallFunc_GetOwnerActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetNonChargeAnimMontage, CallFunc_GetPlayerAnimPresetType_ReturnValue) == 0x000050, "Member 'Default_Fist_C_GetNonChargeAnimMontage::CallFunc_GetPlayerAnimPresetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetNonChargeAnimMontage, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000051, "Member 'Default_Fist_C_GetNonChargeAnimMontage::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetNonChargeAnimMontage, K2Node_Select_Default) == 0x000058, "Member 'Default_Fist_C_GetNonChargeAnimMontage::K2Node_Select_Default' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.GetAttackTag
// 0x0058 (0x0058 - 0x0000)
struct Default_Fist_C_GetAttackTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCharacterMovementComponent*            CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default_1;                           // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Default_Fist_C_GetAttackTag) == 0x000008, "Wrong alignment on Default_Fist_C_GetAttackTag");
static_assert(sizeof(Default_Fist_C_GetAttackTag) == 0x000058, "Wrong size on Default_Fist_C_GetAttackTag");
static_assert(offsetof(Default_Fist_C_GetAttackTag, Tag) == 0x000000, "Member 'Default_Fist_C_GetAttackTag::Tag' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAttackTag, Temp_struct_Variable) == 0x000008, "Member 'Default_Fist_C_GetAttackTag::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAttackTag, Temp_bool_Variable) == 0x000010, "Member 'Default_Fist_C_GetAttackTag::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAttackTag, Temp_struct_Variable_1) == 0x000014, "Member 'Default_Fist_C_GetAttackTag::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAttackTag, Temp_struct_Variable_2) == 0x00001C, "Member 'Default_Fist_C_GetAttackTag::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAttackTag, Temp_struct_Variable_3) == 0x000024, "Member 'Default_Fist_C_GetAttackTag::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAttackTag, CallFunc_GetOwnerActor_ReturnValue) == 0x000030, "Member 'Default_Fist_C_GetAttackTag::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAttackTag, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'Default_Fist_C_GetAttackTag::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAttackTag, Temp_bool_Variable_1) == 0x000040, "Member 'Default_Fist_C_GetAttackTag::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAttackTag, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000041, "Member 'Default_Fist_C_GetAttackTag::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAttackTag, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000042, "Member 'Default_Fist_C_GetAttackTag::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAttackTag, K2Node_Select_Default) == 0x000044, "Member 'Default_Fist_C_GetAttackTag::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAttackTag, CallFunc_BooleanOR_ReturnValue) == 0x00004C, "Member 'Default_Fist_C_GetAttackTag::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAttackTag, K2Node_Select_Default_1) == 0x000050, "Member 'Default_Fist_C_GetAttackTag::K2Node_Select_Default_1' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.GetAnimMontage
// 0x0058 (0x0058 - 0x0000)
struct Default_Fist_C_GetAnimMontage final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSubSkillSetting                       CallFunc_Map_Find_Value;                           // 0x0018(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EM1CharacterGender                            CallFunc_GetPlayerAnimPresetType_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Default_Fist_C_GetAnimMontage) == 0x000008, "Wrong alignment on Default_Fist_C_GetAnimMontage");
static_assert(sizeof(Default_Fist_C_GetAnimMontage) == 0x000058, "Wrong size on Default_Fist_C_GetAnimMontage");
static_assert(offsetof(Default_Fist_C_GetAnimMontage, Key) == 0x000000, "Member 'Default_Fist_C_GetAnimMontage::Key' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAnimMontage, ReturnValue) == 0x000008, "Member 'Default_Fist_C_GetAnimMontage::ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAnimMontage, Temp_bool_Variable) == 0x000010, "Member 'Default_Fist_C_GetAnimMontage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAnimMontage, CallFunc_Map_Find_Value) == 0x000018, "Member 'Default_Fist_C_GetAnimMontage::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAnimMontage, CallFunc_Map_Find_ReturnValue) == 0x000038, "Member 'Default_Fist_C_GetAnimMontage::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAnimMontage, CallFunc_GetOwnerActor_ReturnValue) == 0x000040, "Member 'Default_Fist_C_GetAnimMontage::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAnimMontage, CallFunc_GetPlayerAnimPresetType_ReturnValue) == 0x000048, "Member 'Default_Fist_C_GetAnimMontage::CallFunc_GetPlayerAnimPresetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAnimMontage, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000049, "Member 'Default_Fist_C_GetAnimMontage::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_Fist_C_GetAnimMontage, K2Node_Select_Default) == 0x000050, "Member 'Default_Fist_C_GetAnimMontage::K2Node_Select_Default' has a wrong offset!");

// Function Default_Fist.Default_Fist_C.Get Target Actors
// 0x01F8 (0x01F8 - 0x0000)
struct Default_Fist_C_Get_Target_Actors final
{
public:
	struct FSubSkillCollision                     DamageCollision;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         OutActors;                                         // 0x0028(0x0010)(Parm, OutParm)
	double                                        DamageLocationXOffset;                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FinalDamageExtent;                                 // 0x0040(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               FinalDamageRotation;                               // 0x004C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                FinalDamageLocation;                               // 0x0058(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0064(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x006C(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0074(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheatIsAbilityDrawDebug_ReturnValue;      // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheatIsAbilityDrawDebug_ReturnValue_1;    // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheatIsAbilityDrawDebug_ReturnValue_2;    // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_4;                          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue_1;              // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue_2;              // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_FindCapsuleOverlapActors_OutActors;       // 0x0140(0x0010)(ReferenceParm)
	bool                                          CallFunc_FindCapsuleOverlapActors_ReturnValue;     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_FindActorsInRadius_OutActors;             // 0x0158(0x0010)(ReferenceParm)
	bool                                          CallFunc_FindActorsInRadius_ReturnValue;           // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue_3;              // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue_4;              // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_FindBoxOverlapActors_OutActors;           // 0x0180(0x0010)(ReferenceParm)
	bool                                          CallFunc_FindBoxOverlapActors_ReturnValue;         // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue_5;              // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
