#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PL_Select_B010

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function PL_Select_B010.PL_Select_B010_DirectorBP_C.ExecuteUbergraph_PL_Select_B010_DirectorBP
// 0x0038 (0x0038 - 0x0000)
struct PL_Select_B010_DirectorBP_C_ExecuteUbergraph_PL_Select_B010_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PL_Select_B010_DirectorBP_C_ExecuteUbergraph_PL_Select_B010_DirectorBP) == 0x000008, "Wrong alignment on PL_Select_B010_DirectorBP_C_ExecuteUbergraph_PL_Select_B010_DirectorBP");
static_assert(sizeof(PL_Select_B010_DirectorBP_C_ExecuteUbergraph_PL_Select_B010_DirectorBP) == 0x000038, "Wrong size on PL_Select_B010_DirectorBP_C_ExecuteUbergraph_PL_Select_B010_DirectorBP");
static_assert(offsetof(PL_Select_B010_DirectorBP_C_ExecuteUbergraph_PL_Select_B010_DirectorBP, EntryPoint) == 0x000000, "Member 'PL_Select_B010_DirectorBP_C_ExecuteUbergraph_PL_Select_B010_DirectorBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PL_Select_B010_DirectorBP_C_ExecuteUbergraph_PL_Select_B010_DirectorBP, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'PL_Select_B010_DirectorBP_C_ExecuteUbergraph_PL_Select_B010_DirectorBP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PL_Select_B010_DirectorBP_C_ExecuteUbergraph_PL_Select_B010_DirectorBP, Temp_struct_Variable) == 0x000010, "Member 'PL_Select_B010_DirectorBP_C_ExecuteUbergraph_PL_Select_B010_DirectorBP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PL_Select_B010_DirectorBP_C_ExecuteUbergraph_PL_Select_B010_DirectorBP, Temp_delegate_Variable) == 0x000020, "Member 'PL_Select_B010_DirectorBP_C_ExecuteUbergraph_PL_Select_B010_DirectorBP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(PL_Select_B010_DirectorBP_C_ExecuteUbergraph_PL_Select_B010_DirectorBP, CallFunc_PostEvent_ReturnValue) == 0x000030, "Member 'PL_Select_B010_DirectorBP_C_ExecuteUbergraph_PL_Select_B010_DirectorBP::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

}

