#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrologueBunnyPath

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrologueBunnyPath.PrologueBunnyPath_C
// 0x0038 (0x0280 - 0x0248)
class APrologueBunnyPath_C final : public AActor
{
public:
	class UTextRenderComponent*                   EndText;                                           // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   End;                                               // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   StartText;                                         // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Start;                                             // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PrologueBunnyPath_C">();
	}
	static class APrologueBunnyPath_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrologueBunnyPath_C>();
	}
};
static_assert(alignof(APrologueBunnyPath_C) == 0x000008, "Wrong alignment on APrologueBunnyPath_C");
static_assert(sizeof(APrologueBunnyPath_C) == 0x000280, "Wrong size on APrologueBunnyPath_C");
static_assert(offsetof(APrologueBunnyPath_C, EndText) == 0x000248, "Member 'APrologueBunnyPath_C::EndText' has a wrong offset!");
static_assert(offsetof(APrologueBunnyPath_C, Arrow1) == 0x000250, "Member 'APrologueBunnyPath_C::Arrow1' has a wrong offset!");
static_assert(offsetof(APrologueBunnyPath_C, End) == 0x000258, "Member 'APrologueBunnyPath_C::End' has a wrong offset!");
static_assert(offsetof(APrologueBunnyPath_C, Arrow) == 0x000260, "Member 'APrologueBunnyPath_C::Arrow' has a wrong offset!");
static_assert(offsetof(APrologueBunnyPath_C, StartText) == 0x000268, "Member 'APrologueBunnyPath_C::StartText' has a wrong offset!");
static_assert(offsetof(APrologueBunnyPath_C, Start) == 0x000270, "Member 'APrologueBunnyPath_C::Start' has a wrong offset!");
static_assert(offsetof(APrologueBunnyPath_C, Spline) == 0x000278, "Member 'APrologueBunnyPath_C::Spline' has a wrong offset!");

}

