#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrologueBunny_Specification_BP

#include "Basic.hpp"

#include "M1_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PrologueBunny_Specification_BP.PrologueBunny_Specification_BP_C
// 0x0380 (0x06F0 - 0x0370)
class UPrologueBunny_Specification_BP_C final : public UM1BaseAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0388(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03A8(0x00C8)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x0470(0x01B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0620(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0640(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0660(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0680(0x0048)()
	double                                        LocoMoveYaw;                                       // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocoSpeed;                                         // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBossFightStarted;                                 // 0x06D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9[0x3];                                      // 0x06D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BossLoc;                                           // 0x06DC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BossLookAlpha;                                     // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SpecificationLayer(const struct FPoseLink& InPose, struct FPoseLink* SpecificationLayer_0);
	void ExecuteUbergraph_PrologueBunny_Specification_BP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PrologueBunny_Specification_BP_AnimGraphNode_LookAt_6E2EA7F2417C6E7AC5C7A9BD72D1B2B5();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PrologueBunny_Specification_BP_C">();
	}
	static class UPrologueBunny_Specification_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrologueBunny_Specification_BP_C>();
	}
};
static_assert(alignof(UPrologueBunny_Specification_BP_C) == 0x000010, "Wrong alignment on UPrologueBunny_Specification_BP_C");
static_assert(sizeof(UPrologueBunny_Specification_BP_C) == 0x0006F0, "Wrong size on UPrologueBunny_Specification_BP_C");
static_assert(offsetof(UPrologueBunny_Specification_BP_C, UberGraphFrame) == 0x000370, "Member 'UPrologueBunny_Specification_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPrologueBunny_Specification_BP_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UPrologueBunny_Specification_BP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UPrologueBunny_Specification_BP_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UPrologueBunny_Specification_BP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UPrologueBunny_Specification_BP_C, AnimGraphNode_Root_1) == 0x000388, "Member 'UPrologueBunny_Specification_BP_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UPrologueBunny_Specification_BP_C, AnimGraphNode_LinkedInputPose) == 0x0003A8, "Member 'UPrologueBunny_Specification_BP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UPrologueBunny_Specification_BP_C, AnimGraphNode_LookAt) == 0x000470, "Member 'UPrologueBunny_Specification_BP_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UPrologueBunny_Specification_BP_C, AnimGraphNode_LocalToComponentSpace) == 0x000620, "Member 'UPrologueBunny_Specification_BP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UPrologueBunny_Specification_BP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000640, "Member 'UPrologueBunny_Specification_BP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UPrologueBunny_Specification_BP_C, AnimGraphNode_Root) == 0x000660, "Member 'UPrologueBunny_Specification_BP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPrologueBunny_Specification_BP_C, AnimGraphNode_SequencePlayer) == 0x000680, "Member 'UPrologueBunny_Specification_BP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UPrologueBunny_Specification_BP_C, LocoMoveYaw) == 0x0006C8, "Member 'UPrologueBunny_Specification_BP_C::LocoMoveYaw' has a wrong offset!");
static_assert(offsetof(UPrologueBunny_Specification_BP_C, LocoSpeed) == 0x0006D0, "Member 'UPrologueBunny_Specification_BP_C::LocoSpeed' has a wrong offset!");
static_assert(offsetof(UPrologueBunny_Specification_BP_C, bBossFightStarted) == 0x0006D8, "Member 'UPrologueBunny_Specification_BP_C::bBossFightStarted' has a wrong offset!");
static_assert(offsetof(UPrologueBunny_Specification_BP_C, BossLoc) == 0x0006DC, "Member 'UPrologueBunny_Specification_BP_C::BossLoc' has a wrong offset!");
static_assert(offsetof(UPrologueBunny_Specification_BP_C, BossLookAlpha) == 0x0006E8, "Member 'UPrologueBunny_Specification_BP_C::BossLookAlpha' has a wrong offset!");

}

