#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrologueBunny_Specification_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PrologueBunny_Specification_BP.PrologueBunny_Specification_BP_C.SpecificationLayer
// 0x0020 (0x0020 - 0x0000)
struct PrologueBunny_Specification_BP_C_SpecificationLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              SpecificationLayer_0;                              // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(PrologueBunny_Specification_BP_C_SpecificationLayer) == 0x000008, "Wrong alignment on PrologueBunny_Specification_BP_C_SpecificationLayer");
static_assert(sizeof(PrologueBunny_Specification_BP_C_SpecificationLayer) == 0x000020, "Wrong size on PrologueBunny_Specification_BP_C_SpecificationLayer");
static_assert(offsetof(PrologueBunny_Specification_BP_C_SpecificationLayer, InPose) == 0x000000, "Member 'PrologueBunny_Specification_BP_C_SpecificationLayer::InPose' has a wrong offset!");
static_assert(offsetof(PrologueBunny_Specification_BP_C_SpecificationLayer, SpecificationLayer_0) == 0x000010, "Member 'PrologueBunny_Specification_BP_C_SpecificationLayer::SpecificationLayer_0' has a wrong offset!");

// Function PrologueBunny_Specification_BP.PrologueBunny_Specification_BP_C.ExecuteUbergraph_PrologueBunny_Specification_BP
// 0x0014 (0x0014 - 0x0000)
struct PrologueBunny_Specification_BP_C_ExecuteUbergraph_PrologueBunny_Specification_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Option_1_ImplicitCast;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrologueBunny_Specification_BP_C_ExecuteUbergraph_PrologueBunny_Specification_BP) == 0x000004, "Wrong alignment on PrologueBunny_Specification_BP_C_ExecuteUbergraph_PrologueBunny_Specification_BP");
static_assert(sizeof(PrologueBunny_Specification_BP_C_ExecuteUbergraph_PrologueBunny_Specification_BP) == 0x000014, "Wrong size on PrologueBunny_Specification_BP_C_ExecuteUbergraph_PrologueBunny_Specification_BP");
static_assert(offsetof(PrologueBunny_Specification_BP_C_ExecuteUbergraph_PrologueBunny_Specification_BP, EntryPoint) == 0x000000, "Member 'PrologueBunny_Specification_BP_C_ExecuteUbergraph_PrologueBunny_Specification_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PrologueBunny_Specification_BP_C_ExecuteUbergraph_PrologueBunny_Specification_BP, Temp_real_Variable) == 0x000004, "Member 'PrologueBunny_Specification_BP_C_ExecuteUbergraph_PrologueBunny_Specification_BP::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(PrologueBunny_Specification_BP_C_ExecuteUbergraph_PrologueBunny_Specification_BP, Temp_bool_Variable) == 0x000008, "Member 'PrologueBunny_Specification_BP_C_ExecuteUbergraph_PrologueBunny_Specification_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PrologueBunny_Specification_BP_C_ExecuteUbergraph_PrologueBunny_Specification_BP, K2Node_Select_Default) == 0x00000C, "Member 'PrologueBunny_Specification_BP_C_ExecuteUbergraph_PrologueBunny_Specification_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PrologueBunny_Specification_BP_C_ExecuteUbergraph_PrologueBunny_Specification_BP, K2Node_Select_Option_1_ImplicitCast) == 0x000010, "Member 'PrologueBunny_Specification_BP_C_ExecuteUbergraph_PrologueBunny_Specification_BP::K2Node_Select_Option_1_ImplicitCast' has a wrong offset!");

// Function PrologueBunny_Specification_BP.PrologueBunny_Specification_BP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct PrologueBunny_Specification_BP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(PrologueBunny_Specification_BP_C_AnimGraph) == 0x000008, "Wrong alignment on PrologueBunny_Specification_BP_C_AnimGraph");
static_assert(sizeof(PrologueBunny_Specification_BP_C_AnimGraph) == 0x000010, "Wrong size on PrologueBunny_Specification_BP_C_AnimGraph");
static_assert(offsetof(PrologueBunny_Specification_BP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'PrologueBunny_Specification_BP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

