#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrologueTriggerSphere

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrologueTriggerSphere.PrologueTriggerSphere_C
// 0x0060 (0x02B0 - 0x0250)
class APrologueTriggerSphere_C final : public ATriggerSphere
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class UClass*, class FName>              DialogKeyName;                                     // 0x0258(0x0050)(Edit, BlueprintVisible)
	bool                                          bBunnyOrPlayer;                                    // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAlreadyPlayed;                                    // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void PlayDialog();
	void ExecuteUbergraph_PrologueTriggerSphere(int32 EntryPoint);

	void IsPlayer(class AActor* Actor, bool* bResult) const;
	void IsBunny(class AActor* Actor, bool* bResult) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PrologueTriggerSphere_C">();
	}
	static class APrologueTriggerSphere_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrologueTriggerSphere_C>();
	}
};
static_assert(alignof(APrologueTriggerSphere_C) == 0x000008, "Wrong alignment on APrologueTriggerSphere_C");
static_assert(sizeof(APrologueTriggerSphere_C) == 0x0002B0, "Wrong size on APrologueTriggerSphere_C");
static_assert(offsetof(APrologueTriggerSphere_C, UberGraphFrame) == 0x000250, "Member 'APrologueTriggerSphere_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APrologueTriggerSphere_C, DialogKeyName) == 0x000258, "Member 'APrologueTriggerSphere_C::DialogKeyName' has a wrong offset!");
static_assert(offsetof(APrologueTriggerSphere_C, bBunnyOrPlayer) == 0x0002A8, "Member 'APrologueTriggerSphere_C::bBunnyOrPlayer' has a wrong offset!");
static_assert(offsetof(APrologueTriggerSphere_C, bAlreadyPlayed) == 0x0002A9, "Member 'APrologueTriggerSphere_C::bAlreadyPlayed' has a wrong offset!");

}

