#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Skill_SpawnPreviewBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "M1_structs.hpp"


namespace SDK::Params
{

// Function Skill_SpawnPreviewBase.Skill_SpawnPreviewBase_C.Spawn Impl
// 0x000C (0x000C - 0x0000)
struct Skill_SpawnPreviewBase_C_Spawn_Impl final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Skill_SpawnPreviewBase_C_Spawn_Impl) == 0x000004, "Wrong alignment on Skill_SpawnPreviewBase_C_Spawn_Impl");
static_assert(sizeof(Skill_SpawnPreviewBase_C_Spawn_Impl) == 0x00000C, "Wrong size on Skill_SpawnPreviewBase_C_Spawn_Impl");
static_assert(offsetof(Skill_SpawnPreviewBase_C_Spawn_Impl, SpawnLocation) == 0x000000, "Member 'Skill_SpawnPreviewBase_C_Spawn_Impl::SpawnLocation' has a wrong offset!");

// Function Skill_SpawnPreviewBase.Skill_SpawnPreviewBase_C.ServerRequestSpawn
// 0x001C (0x001C - 0x0000)
struct Skill_SpawnPreviewBase_C_ServerRequestSpawn final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OwnerLocation;                                     // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnLocation;                                     // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Skill_SpawnPreviewBase_C_ServerRequestSpawn) == 0x000004, "Wrong alignment on Skill_SpawnPreviewBase_C_ServerRequestSpawn");
static_assert(sizeof(Skill_SpawnPreviewBase_C_ServerRequestSpawn) == 0x00001C, "Wrong size on Skill_SpawnPreviewBase_C_ServerRequestSpawn");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ServerRequestSpawn, bResult) == 0x000000, "Member 'Skill_SpawnPreviewBase_C_ServerRequestSpawn::bResult' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ServerRequestSpawn, OwnerLocation) == 0x000004, "Member 'Skill_SpawnPreviewBase_C_ServerRequestSpawn::OwnerLocation' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ServerRequestSpawn, SpawnLocation) == 0x000010, "Member 'Skill_SpawnPreviewBase_C_ServerRequestSpawn::SpawnLocation' has a wrong offset!");

// Function Skill_SpawnPreviewBase.Skill_SpawnPreviewBase_C.RemovePreview
// 0x0001 (0x0001 - 0x0000)
struct Skill_SpawnPreviewBase_C_RemovePreview final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Skill_SpawnPreviewBase_C_RemovePreview) == 0x000001, "Wrong alignment on Skill_SpawnPreviewBase_C_RemovePreview");
static_assert(sizeof(Skill_SpawnPreviewBase_C_RemovePreview) == 0x000001, "Wrong size on Skill_SpawnPreviewBase_C_RemovePreview");
static_assert(offsetof(Skill_SpawnPreviewBase_C_RemovePreview, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Skill_SpawnPreviewBase_C_RemovePreview::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Skill_SpawnPreviewBase.Skill_SpawnPreviewBase_C.OnEventReceived_0EA239094823F9872CECFCB111481D86
// 0x0040 (0x0040 - 0x0000)
struct Skill_SpawnPreviewBase_C_OnEventReceived_0EA239094823F9872CECFCB111481D86 final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Skill_SpawnPreviewBase_C_OnEventReceived_0EA239094823F9872CECFCB111481D86) == 0x000008, "Wrong alignment on Skill_SpawnPreviewBase_C_OnEventReceived_0EA239094823F9872CECFCB111481D86");
static_assert(sizeof(Skill_SpawnPreviewBase_C_OnEventReceived_0EA239094823F9872CECFCB111481D86) == 0x000040, "Wrong size on Skill_SpawnPreviewBase_C_OnEventReceived_0EA239094823F9872CECFCB111481D86");
static_assert(offsetof(Skill_SpawnPreviewBase_C_OnEventReceived_0EA239094823F9872CECFCB111481D86, Event) == 0x000000, "Member 'Skill_SpawnPreviewBase_C_OnEventReceived_0EA239094823F9872CECFCB111481D86::Event' has a wrong offset!");

// Function Skill_SpawnPreviewBase.Skill_SpawnPreviewBase_C.OnCompleted_0EA239094823F9872CECFCB111481D86
// 0x0040 (0x0040 - 0x0000)
struct Skill_SpawnPreviewBase_C_OnCompleted_0EA239094823F9872CECFCB111481D86 final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Skill_SpawnPreviewBase_C_OnCompleted_0EA239094823F9872CECFCB111481D86) == 0x000008, "Wrong alignment on Skill_SpawnPreviewBase_C_OnCompleted_0EA239094823F9872CECFCB111481D86");
static_assert(sizeof(Skill_SpawnPreviewBase_C_OnCompleted_0EA239094823F9872CECFCB111481D86) == 0x000040, "Wrong size on Skill_SpawnPreviewBase_C_OnCompleted_0EA239094823F9872CECFCB111481D86");
static_assert(offsetof(Skill_SpawnPreviewBase_C_OnCompleted_0EA239094823F9872CECFCB111481D86, Event) == 0x000000, "Member 'Skill_SpawnPreviewBase_C_OnCompleted_0EA239094823F9872CECFCB111481D86::Event' has a wrong offset!");

// Function Skill_SpawnPreviewBase.Skill_SpawnPreviewBase_C.OnBlendOut_0EA239094823F9872CECFCB111481D86
// 0x0040 (0x0040 - 0x0000)
struct Skill_SpawnPreviewBase_C_OnBlendOut_0EA239094823F9872CECFCB111481D86 final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Skill_SpawnPreviewBase_C_OnBlendOut_0EA239094823F9872CECFCB111481D86) == 0x000008, "Wrong alignment on Skill_SpawnPreviewBase_C_OnBlendOut_0EA239094823F9872CECFCB111481D86");
static_assert(sizeof(Skill_SpawnPreviewBase_C_OnBlendOut_0EA239094823F9872CECFCB111481D86) == 0x000040, "Wrong size on Skill_SpawnPreviewBase_C_OnBlendOut_0EA239094823F9872CECFCB111481D86");
static_assert(offsetof(Skill_SpawnPreviewBase_C_OnBlendOut_0EA239094823F9872CECFCB111481D86, Event) == 0x000000, "Member 'Skill_SpawnPreviewBase_C_OnBlendOut_0EA239094823F9872CECFCB111481D86::Event' has a wrong offset!");

// Function Skill_SpawnPreviewBase.Skill_SpawnPreviewBase_C.NetMulticast_Spawn
// 0x000C (0x000C - 0x0000)
struct Skill_SpawnPreviewBase_C_NetMulticast_Spawn final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Skill_SpawnPreviewBase_C_NetMulticast_Spawn) == 0x000004, "Wrong alignment on Skill_SpawnPreviewBase_C_NetMulticast_Spawn");
static_assert(sizeof(Skill_SpawnPreviewBase_C_NetMulticast_Spawn) == 0x00000C, "Wrong size on Skill_SpawnPreviewBase_C_NetMulticast_Spawn");
static_assert(offsetof(Skill_SpawnPreviewBase_C_NetMulticast_Spawn, SpawnLocation) == 0x000000, "Member 'Skill_SpawnPreviewBase_C_NetMulticast_Spawn::SpawnLocation' has a wrong offset!");

// Function Skill_SpawnPreviewBase.Skill_SpawnPreviewBase_C.IsSpawnable
// 0x0003 (0x0003 - 0x0000)
struct Skill_SpawnPreviewBase_C_IsSpawnable final
{
public:
	bool                                          bSpawnable;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpawnable_bIsSpawnable;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Skill_SpawnPreviewBase_C_IsSpawnable) == 0x000001, "Wrong alignment on Skill_SpawnPreviewBase_C_IsSpawnable");
static_assert(sizeof(Skill_SpawnPreviewBase_C_IsSpawnable) == 0x000003, "Wrong size on Skill_SpawnPreviewBase_C_IsSpawnable");
static_assert(offsetof(Skill_SpawnPreviewBase_C_IsSpawnable, bSpawnable) == 0x000000, "Member 'Skill_SpawnPreviewBase_C_IsSpawnable::bSpawnable' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_IsSpawnable, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Skill_SpawnPreviewBase_C_IsSpawnable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_IsSpawnable, CallFunc_IsSpawnable_bIsSpawnable) == 0x000002, "Member 'Skill_SpawnPreviewBase_C_IsSpawnable::CallFunc_IsSpawnable_bIsSpawnable' has a wrong offset!");

// Function Skill_SpawnPreviewBase.Skill_SpawnPreviewBase_C.GetPreivewLocation
// 0x001C (0x001C - 0x0000)
struct Skill_SpawnPreviewBase_C_GetPreivewLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Skill_SpawnPreviewBase_C_GetPreivewLocation) == 0x000004, "Wrong alignment on Skill_SpawnPreviewBase_C_GetPreivewLocation");
static_assert(sizeof(Skill_SpawnPreviewBase_C_GetPreivewLocation) == 0x00001C, "Wrong size on Skill_SpawnPreviewBase_C_GetPreivewLocation");
static_assert(offsetof(Skill_SpawnPreviewBase_C_GetPreivewLocation, ReturnValue) == 0x000000, "Member 'Skill_SpawnPreviewBase_C_GetPreivewLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_GetPreivewLocation, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'Skill_SpawnPreviewBase_C_GetPreivewLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_GetPreivewLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'Skill_SpawnPreviewBase_C_GetPreivewLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function Skill_SpawnPreviewBase.Skill_SpawnPreviewBase_C.ExecuteUbergraph_Skill_SpawnPreviewBase
// 0x03E0 (0x03E0 - 0x0000)
struct Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetOwnerLocation_ReturnValue;             // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FM1AbilityEvent                        K2Node_CustomEvent_Event;                          // 0x0010(0x0040)(ConstParm)
	TDelegate<void(struct FM1AbilityEvent& Event)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FM1AbilityEvent                        Temp_struct_Variable;                              // 0x0060(0x0040)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UM1AbilityTask_LocalWaitInput*          CallFunc_LocalWaitInput_ReturnValue;               // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UM1AbilityTask_LocalWaitInput*          CallFunc_LocalWaitInput_ReturnValue_1;             // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCancelled;                           // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityEvent                        K2Node_CustomEvent_Event_1;                        // 0x00E0(0x0040)(ConstParm)
	bool                                          K2Node_CustomEvent_bResult;                        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_OwnerLocation;                  // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_SpawnLocation_2;                // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceTerrain_OutHit;                  // 0x013C(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceTerrain_ReturnValue;             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DB[0x1];                                      // 0x01DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0266(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_267[0x1];                                      // 0x0267(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_SpawnLocation_1;                // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_LocalRebaseVec_ReturnValue;               // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryCommitAbility_ReturnValue;             // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_286[0x2];                                      // 0x0286(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPreivewLocation_ReturnValue;           // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ZeroRebaseVec_ReturnValue;                // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_SpawnLocation;                  // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FM1AbilityEvent& Event)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x02AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BF[0x1];                                      // 0x02BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpawnable_bSpawnable;                   // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CB[0x5];                                      // 0x02CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UM1AbilityTask_PlayMontageAndWait*      CallFunc_PlayMontageAndWaitForEvent_ReturnValue;   // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA[0x2];                                      // 0x02DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetOwnerLocation_ReturnValue_1;           // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02F0(0x0030)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetOwnerLocation_ReturnValue_2;           // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ZeroRebaseVec_ReturnValue_1;              // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpawnPreviewActorBase_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FM1AbilityEvent                        K2Node_CustomEvent_Event_2;                        // 0x0350(0x0040)(ConstParm)
	class ASkillPreviewActor_C*                   K2Node_DynamicCast_AsSkill_Preview_Actor;          // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue_1;              // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateClientLocation_ReturnValue;       // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FM1AbilityEvent& Event)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x03AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue_2;              // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateClientLocation_ReturnValue_1;     // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ValidateClientLocation_ExtentValidationSize_ImplicitCast; // 0x03D4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase) == 0x000010, "Wrong alignment on Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase");
static_assert(sizeof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase) == 0x0003E0, "Wrong size on Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, EntryPoint) == 0x000000, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_GetOwnerLocation_ReturnValue) == 0x000004, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_GetOwnerLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, K2Node_CustomEvent_Event) == 0x000010, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::K2Node_CustomEvent_Event' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, Temp_struct_Variable) == 0x000060, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A0, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_LocalWaitInput_ReturnValue) == 0x0000B0, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_LocalWaitInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B8, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_LocalWaitInput_ReturnValue_1) == 0x0000D0, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_LocalWaitInput_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_IsValid_ReturnValue_1) == 0x0000D8, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, K2Node_Event_bCancelled) == 0x0000D9, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::K2Node_Event_bCancelled' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, K2Node_CustomEvent_Event_1) == 0x0000E0, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::K2Node_CustomEvent_Event_1' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, K2Node_CustomEvent_bResult) == 0x000120, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::K2Node_CustomEvent_bResult' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, K2Node_CustomEvent_OwnerLocation) == 0x000124, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::K2Node_CustomEvent_OwnerLocation' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, K2Node_CustomEvent_SpawnLocation_2) == 0x000130, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::K2Node_CustomEvent_SpawnLocation_2' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_LineTraceTerrain_OutHit) == 0x00013C, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_LineTraceTerrain_OutHit' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_LineTraceTerrain_ReturnValue) == 0x0001D8, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_LineTraceTerrain_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_bBlockingHit) == 0x0001D9, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001DA, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_Time) == 0x0001DC, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_Distance) == 0x0001E0, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_Location) == 0x0001E4, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_ImpactPoint) == 0x0001F0, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_Normal) == 0x0001FC, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_ImpactNormal) == 0x000208, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_PhysMat) == 0x000218, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_HitActor) == 0x000220, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_HitComponent) == 0x000228, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_HitBoneName) == 0x000230, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_BoneName) == 0x000238, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_HitItem) == 0x000240, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_ElementIndex) == 0x000244, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_FaceIndex) == 0x000248, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_TraceStart) == 0x00024C, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BreakHitResult_TraceEnd) == 0x000258, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_ObjectIsA_ReturnValue) == 0x000264, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_IsDedicatedServer_ReturnValue) == 0x000265, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_IsValid_ReturnValue_2) == 0x000266, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, K2Node_CustomEvent_SpawnLocation_1) == 0x000268, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::K2Node_CustomEvent_SpawnLocation_1' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_IsValid_ReturnValue_3) == 0x000274, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_LocalRebaseVec_ReturnValue) == 0x000278, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_LocalRebaseVec_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_TryCommitAbility_ReturnValue) == 0x000284, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_TryCommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_IsLocallyControlled_ReturnValue) == 0x000285, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_GetPreivewLocation_ReturnValue) == 0x000288, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_GetPreivewLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_ZeroRebaseVec_ReturnValue) == 0x000294, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_ZeroRebaseVec_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, K2Node_CustomEvent_SpawnLocation) == 0x0002A0, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::K2Node_CustomEvent_SpawnLocation' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002AC, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0002BC, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_IsValid_ReturnValue_4) == 0x0002BD, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_IsValid_ReturnValue_5) == 0x0002BE, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_GetOwnerActor_ReturnValue) == 0x0002C0, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0002C8, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_IsSpawnable_bSpawnable) == 0x0002C9, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_IsSpawnable_bSpawnable' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_IsLocallyControlled_ReturnValue_2) == 0x0002CA, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_IsLocallyControlled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_PlayMontageAndWaitForEvent_ReturnValue) == 0x0002D0, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_PlayMontageAndWaitForEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_IsValid_ReturnValue_6) == 0x0002D8, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_IsValid_ReturnValue_7) == 0x0002D9, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_GetOwnerLocation_ReturnValue_1) == 0x0002DC, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_GetOwnerLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_MakeTransform_ReturnValue) == 0x0002F0, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_GetOwnerLocation_ReturnValue_2) == 0x000320, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_GetOwnerLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000330, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_ZeroRebaseVec_ReturnValue_1) == 0x000338, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_ZeroRebaseVec_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_FinishSpawningActor_ReturnValue) == 0x000348, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, K2Node_CustomEvent_Event_2) == 0x000350, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::K2Node_CustomEvent_Event_2' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, K2Node_DynamicCast_AsSkill_Preview_Actor) == 0x000390, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::K2Node_DynamicCast_AsSkill_Preview_Actor' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, K2Node_DynamicCast_bSuccess) == 0x000398, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_GetOwnerActor_ReturnValue_1) == 0x0003A0, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_GetOwnerActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_ValidateClientLocation_ReturnValue) == 0x0003A8, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_ValidateClientLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, K2Node_CreateDelegate_OutputDelegate_4) == 0x0003AC, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_GetOwnerActor_ReturnValue_2) == 0x0003C0, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_GetOwnerActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0003C8, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_ValidateClientLocation_ReturnValue_1) == 0x0003D0, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_ValidateClientLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase, CallFunc_ValidateClientLocation_ExtentValidationSize_ImplicitCast) == 0x0003D4, "Member 'Skill_SpawnPreviewBase_C_ExecuteUbergraph_Skill_SpawnPreviewBase::CallFunc_ValidateClientLocation_ExtentValidationSize_ImplicitCast' has a wrong offset!");

// Function Skill_SpawnPreviewBase.Skill_SpawnPreviewBase_C.CalcSpawnRotation
// 0x0078 (0x0078 - 0x0000)
struct Skill_SpawnPreviewBase_C_CalcSpawnRotation final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ReturnValue;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetOwnerLocation_ReturnValue;             // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Skill_SpawnPreviewBase_C_CalcSpawnRotation) == 0x000004, "Wrong alignment on Skill_SpawnPreviewBase_C_CalcSpawnRotation");
static_assert(sizeof(Skill_SpawnPreviewBase_C_CalcSpawnRotation) == 0x000078, "Wrong size on Skill_SpawnPreviewBase_C_CalcSpawnRotation");
static_assert(offsetof(Skill_SpawnPreviewBase_C_CalcSpawnRotation, SpawnLocation) == 0x000000, "Member 'Skill_SpawnPreviewBase_C_CalcSpawnRotation::SpawnLocation' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_CalcSpawnRotation, ReturnValue) == 0x00000C, "Member 'Skill_SpawnPreviewBase_C_CalcSpawnRotation::ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_CalcSpawnRotation, CallFunc_GetOwnerLocation_ReturnValue) == 0x000018, "Member 'Skill_SpawnPreviewBase_C_CalcSpawnRotation::CallFunc_GetOwnerLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_CalcSpawnRotation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000024, "Member 'Skill_SpawnPreviewBase_C_CalcSpawnRotation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_CalcSpawnRotation, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000030, "Member 'Skill_SpawnPreviewBase_C_CalcSpawnRotation::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_CalcSpawnRotation, CallFunc_SelectVector_ReturnValue) == 0x00003C, "Member 'Skill_SpawnPreviewBase_C_CalcSpawnRotation::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_CalcSpawnRotation, CallFunc_Normal_ReturnValue) == 0x000048, "Member 'Skill_SpawnPreviewBase_C_CalcSpawnRotation::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_CalcSpawnRotation, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000054, "Member 'Skill_SpawnPreviewBase_C_CalcSpawnRotation::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_CalcSpawnRotation, CallFunc_BreakRotator_Roll) == 0x000060, "Member 'Skill_SpawnPreviewBase_C_CalcSpawnRotation::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_CalcSpawnRotation, CallFunc_BreakRotator_Pitch) == 0x000064, "Member 'Skill_SpawnPreviewBase_C_CalcSpawnRotation::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_CalcSpawnRotation, CallFunc_BreakRotator_Yaw) == 0x000068, "Member 'Skill_SpawnPreviewBase_C_CalcSpawnRotation::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Skill_SpawnPreviewBase_C_CalcSpawnRotation, CallFunc_MakeRotator_ReturnValue) == 0x00006C, "Member 'Skill_SpawnPreviewBase_C_CalcSpawnRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function Skill_SpawnPreviewBase.Skill_SpawnPreviewBase_C.BP_OnDeactivated
// 0x0001 (0x0001 - 0x0000)
struct Skill_SpawnPreviewBase_C_BP_OnDeactivated final
{
public:
	bool                                          bCancelled;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Skill_SpawnPreviewBase_C_BP_OnDeactivated) == 0x000001, "Wrong alignment on Skill_SpawnPreviewBase_C_BP_OnDeactivated");
static_assert(sizeof(Skill_SpawnPreviewBase_C_BP_OnDeactivated) == 0x000001, "Wrong size on Skill_SpawnPreviewBase_C_BP_OnDeactivated");
static_assert(offsetof(Skill_SpawnPreviewBase_C_BP_OnDeactivated, bCancelled) == 0x000000, "Member 'Skill_SpawnPreviewBase_C_BP_OnDeactivated::bCancelled' has a wrong offset!");

}

