#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnPreviewActorBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SpawnPreviewActorBase.SpawnPreviewActorBase_C.UpdateTransform
// 0x0004 (0x0004 - 0x0000)
struct SpawnPreviewActorBase_C_UpdateTransform final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpawnPreviewActorBase_C_UpdateTransform) == 0x000004, "Wrong alignment on SpawnPreviewActorBase_C_UpdateTransform");
static_assert(sizeof(SpawnPreviewActorBase_C_UpdateTransform) == 0x000004, "Wrong size on SpawnPreviewActorBase_C_UpdateTransform");
static_assert(offsetof(SpawnPreviewActorBase_C_UpdateTransform, DeltaSeconds) == 0x000000, "Member 'SpawnPreviewActorBase_C_UpdateTransform::DeltaSeconds' has a wrong offset!");

// Function SpawnPreviewActorBase.SpawnPreviewActorBase_C.UpdatePreviewInfo
// 0x00F0 (0x00F0 - 0x0000)
struct SpawnPreviewActorBase_C_UpdatePreviewInfo final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               New_Transform_Rotation;                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSpawnable_bIsSpawnable;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0050(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpawnPreviewActorBase_C_UpdatePreviewInfo) == 0x000010, "Wrong alignment on SpawnPreviewActorBase_C_UpdatePreviewInfo");
static_assert(sizeof(SpawnPreviewActorBase_C_UpdatePreviewInfo) == 0x0000F0, "Wrong size on SpawnPreviewActorBase_C_UpdatePreviewInfo");
static_assert(offsetof(SpawnPreviewActorBase_C_UpdatePreviewInfo, SpawnLocation) == 0x000000, "Member 'SpawnPreviewActorBase_C_UpdatePreviewInfo::SpawnLocation' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_UpdatePreviewInfo, New_Transform_Rotation) == 0x00000C, "Member 'SpawnPreviewActorBase_C_UpdatePreviewInfo::New_Transform_Rotation' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_UpdatePreviewInfo, CallFunc_IsSpawnable_bIsSpawnable) == 0x000018, "Member 'SpawnPreviewActorBase_C_UpdatePreviewInfo::CallFunc_IsSpawnable_bIsSpawnable' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_UpdatePreviewInfo, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'SpawnPreviewActorBase_C_UpdatePreviewInfo::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_UpdatePreviewInfo, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000050, "Member 'SpawnPreviewActorBase_C_UpdatePreviewInfo::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_UpdatePreviewInfo, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0000EC, "Member 'SpawnPreviewActorBase_C_UpdatePreviewInfo::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function SpawnPreviewActorBase.SpawnPreviewActorBase_C.IsSpawnPointFound
// 0x0001 (0x0001 - 0x0000)
struct SpawnPreviewActorBase_C_IsSpawnPointFound final
{
public:
	bool                                          Found;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpawnPreviewActorBase_C_IsSpawnPointFound) == 0x000001, "Wrong alignment on SpawnPreviewActorBase_C_IsSpawnPointFound");
static_assert(sizeof(SpawnPreviewActorBase_C_IsSpawnPointFound) == 0x000001, "Wrong size on SpawnPreviewActorBase_C_IsSpawnPointFound");
static_assert(offsetof(SpawnPreviewActorBase_C_IsSpawnPointFound, Found) == 0x000000, "Member 'SpawnPreviewActorBase_C_IsSpawnPointFound::Found' has a wrong offset!");

// Function SpawnPreviewActorBase.SpawnPreviewActorBase_C.IsSpawnable
// 0x0003 (0x0003 - 0x0000)
struct SpawnPreviewActorBase_C_IsSpawnable final
{
public:
	bool                                          bIsSpawnable;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpawnPointFound_Found;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpawnPreviewActorBase_C_IsSpawnable) == 0x000001, "Wrong alignment on SpawnPreviewActorBase_C_IsSpawnable");
static_assert(sizeof(SpawnPreviewActorBase_C_IsSpawnable) == 0x000003, "Wrong size on SpawnPreviewActorBase_C_IsSpawnable");
static_assert(offsetof(SpawnPreviewActorBase_C_IsSpawnable, bIsSpawnable) == 0x000000, "Member 'SpawnPreviewActorBase_C_IsSpawnable::bIsSpawnable' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_IsSpawnable, CallFunc_IsSpawnPointFound_Found) == 0x000001, "Member 'SpawnPreviewActorBase_C_IsSpawnable::CallFunc_IsSpawnPointFound_Found' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_IsSpawnable, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'SpawnPreviewActorBase_C_IsSpawnable::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function SpawnPreviewActorBase.SpawnPreviewActorBase_C.FindSpawnPoint_Sweep
// 0x0260 (0x0260 - 0x0000)
struct SpawnPreviewActorBase_C_FindSpawnPoint_Sweep final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Dir;                                               // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Dist;                                              // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius;                                            // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReverse;                                          // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InDebugDraw;                                       // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           TraceColor;                                        // 0x002C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             OutHit;                                            // 0x003C(0x009C)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00D8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               Temp_byte_Variable;                                // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               Temp_byte_Variable_1;                              // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00E0(0x0010)(ConstParm, ReferenceParm)
	EDrawDebugTrace                               K2Node_Select_Default;                             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0124(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C3[0x1];                                      // 0x01C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24E[0x2];                                      // 0x024E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SphereTraceSingle_Radius_ImplicitCast;    // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep) == 0x000008, "Wrong alignment on SpawnPreviewActorBase_C_FindSpawnPoint_Sweep");
static_assert(sizeof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep) == 0x000260, "Wrong size on SpawnPreviewActorBase_C_FindSpawnPoint_Sweep");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, Start) == 0x000000, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::Start' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, Dir) == 0x00000C, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::Dir' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, Dist) == 0x000018, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::Dist' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, Radius) == 0x000020, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::Radius' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, bReverse) == 0x000028, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::bReverse' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, InDebugDraw) == 0x000029, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::InDebugDraw' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, TraceColor) == 0x00002C, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::TraceColor' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, OutHit) == 0x00003C, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::OutHit' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, ReturnValue) == 0x0000D8, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, Temp_bool_Variable) == 0x0000D9, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, Temp_byte_Variable) == 0x0000DA, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, Temp_byte_Variable_1) == 0x0000DB, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, Temp_object_Variable) == 0x0000E0, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, K2Node_Select_Default) == 0x0000F0, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F4, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_Add_VectorVector_ReturnValue) == 0x000100, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_SelectVector_ReturnValue) == 0x00010C, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_SelectVector_ReturnValue_1) == 0x000118, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_SphereTraceSingle_OutHit) == 0x000124, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_SphereTraceSingle_ReturnValue) == 0x0001C0, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_bBlockingHit) == 0x0001C1, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001C2, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_Time) == 0x0001C4, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_Distance) == 0x0001C8, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_Location) == 0x0001CC, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_ImpactPoint) == 0x0001D8, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_Normal) == 0x0001E4, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_ImpactNormal) == 0x0001F0, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_PhysMat) == 0x000200, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_HitActor) == 0x000208, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_HitComponent) == 0x000210, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_HitBoneName) == 0x000218, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_BoneName) == 0x000220, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_HitItem) == 0x000228, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_ElementIndex) == 0x00022C, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_FaceIndex) == 0x000230, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_TraceStart) == 0x000234, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BreakHitResult_TraceEnd) == 0x000240, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00024C, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_BooleanAND_ReturnValue) == 0x00024D, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_SphereTraceSingle_Radius_ImplicitCast) == 0x000250, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_SphereTraceSingle_Radius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint_Sweep, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000258, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint_Sweep::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function SpawnPreviewActorBase.SpawnPreviewActorBase_C.FindSpawnPoint
// 0x0700 (0x0700 - 0x0000)
struct SpawnPreviewActorBase_C_FindSpawnPoint final
{
public:
	class AActor*                                 Owner_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bFullDetect;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnFound;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnLoc;                                         // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFound;                                            // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             GroundTestHitInfo;                                 // 0x001C(0x009C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        SpawnCorrectRadius;                                // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        UpperWallHeight;                                   // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNeedFullDetect;                                   // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TraceEnd;                                          // 0x00CC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AimedLocation;                                     // 0x00D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ViewLocation;                                      // 0x00E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AimImpactNormal;                                   // 0x00F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceStart;                                        // 0x00FC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               Temp_byte_Variable;                                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               Temp_byte_Variable_1;                              // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12F[0x1];                                      // 0x012F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsViewTargetLocalPlayer_ReturnValue;      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWalkableFloor_ReturnValue;              // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               K2Node_Select_Default;                             // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B3[0x1];                                      // 0x01B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindSpawnPoint_ReturnFound;               // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FindSpawnPoint_ReturnLoc;                 // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTargetOnPlayerScreen_ReturnValue;       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x01F0(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0200(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_CapsuleTraceSingleByProfile_OutHit;       // 0x0210(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingleByProfile_ReturnValue;  // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               Temp_byte_Variable_2;                              // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               Temp_byte_Variable_3;                              // 0x0335(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_336[0x2];                                      // 0x0336(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_FindSpawnPoint_Sweep_OutHit;              // 0x0338(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_FindSpawnPoint_Sweep_ReturnValue;         // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E2[0x2];                                      // 0x03E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x03EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0404(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0430(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0454(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0460(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue; // 0x046D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               K2Node_Select_Default_1;                           // 0x046E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x046F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x3];                                      // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x04AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Vector_IsZero_ReturnValue;                // 0x04BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BB[0x1];                                      // 0x04BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x04BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x04C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x04D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x04E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x04FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FD[0x3];                                      // 0x04FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0500(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x050C(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x05A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x05AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x05AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x05B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x05C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x05CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x05D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x05E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x05F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_2;                // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x061C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0628(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0634(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0635(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_636[0x2];                                      // 0x0636(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0638(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_LineTraceFromViewport_OutHits;            // 0x0648(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceFromViewport_ReturnValue;        // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_3;            // 0x0659(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_3;         // 0x065A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65B[0x1];                                      // 0x065B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_3;                    // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_3;                // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_3;                // 0x0664(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_3;             // 0x0670(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_3;                  // 0x067C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_3;            // 0x0688(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_694[0x4];                                      // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_3;                 // 0x0698(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_3;                // 0x06A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_3;            // 0x06A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_3;             // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_3;                // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_3;                 // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_3;            // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_3;               // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_3;              // 0x06CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_3;                // 0x06D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_2;               // 0x06E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CapsuleTraceSingleByProfile_Radius_ImplicitCast; // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CapsuleTraceSingleByProfile_HalfHeight_ImplicitCast; // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LineTraceFromViewport_Range_ImplicitCast; // 0x06F8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpawnPreviewActorBase_C_FindSpawnPoint) == 0x000008, "Wrong alignment on SpawnPreviewActorBase_C_FindSpawnPoint");
static_assert(sizeof(SpawnPreviewActorBase_C_FindSpawnPoint) == 0x000700, "Wrong size on SpawnPreviewActorBase_C_FindSpawnPoint");
static_assert(offsetof(SpawnPreviewActorBase_C_FindSpawnPoint, Owner_0) == 0x000000, "Member 'SpawnPreviewActorBase_C_FindSpawnPoint::Owner_0' has a wrong offset!");
