#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrapInitializeStats

#include "Basic.hpp"

#include "M1_structs.hpp"
#include "M1Data_structs.hpp"


namespace SDK::Params
{

// Function TrapInitializeStats.TrapInitializeStats_C.Execute
// 0x0068 (0x0068 - 0x0000)
struct TrapInitializeStats_C_Execute final
{
public:
	struct FM1AbilityOpCalcParam                  Param;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FM1AbilityOpExecCalcOutput             Output;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EM1StatType                                   InitializedMaxShieldType;                          // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1StatType                                   InitializedMaxHPType;                              // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue;                    // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1StatTypeOpValue                     K2Node_MakeStruct_M1StatTypeOpValue;               // 0x0028(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1ScaledInteger                       CallFunc_FromFloat_ReturnValue_1;                  // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FM1StatTypeOpValue                     K2Node_MakeStruct_M1StatTypeOpValue_1;             // 0x0048(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast;           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromFloat_InValue_ImplicitCast_1;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrapInitializeStats_C_Execute) == 0x000008, "Wrong alignment on TrapInitializeStats_C_Execute");
static_assert(sizeof(TrapInitializeStats_C_Execute) == 0x000068, "Wrong size on TrapInitializeStats_C_Execute");
static_assert(offsetof(TrapInitializeStats_C_Execute, Param) == 0x000000, "Member 'TrapInitializeStats_C_Execute::Param' has a wrong offset!");
static_assert(offsetof(TrapInitializeStats_C_Execute, Output) == 0x000008, "Member 'TrapInitializeStats_C_Execute::Output' has a wrong offset!");
static_assert(offsetof(TrapInitializeStats_C_Execute, InitializedMaxShieldType) == 0x000018, "Member 'TrapInitializeStats_C_Execute::InitializedMaxShieldType' has a wrong offset!");
static_assert(offsetof(TrapInitializeStats_C_Execute, InitializedMaxHPType) == 0x000019, "Member 'TrapInitializeStats_C_Execute::InitializedMaxHPType' has a wrong offset!");
static_assert(offsetof(TrapInitializeStats_C_Execute, CallFunc_FromFloat_ReturnValue) == 0x000020, "Member 'TrapInitializeStats_C_Execute::CallFunc_FromFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrapInitializeStats_C_Execute, K2Node_MakeStruct_M1StatTypeOpValue) == 0x000028, "Member 'TrapInitializeStats_C_Execute::K2Node_MakeStruct_M1StatTypeOpValue' has a wrong offset!");
static_assert(offsetof(TrapInitializeStats_C_Execute, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'TrapInitializeStats_C_Execute::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrapInitializeStats_C_Execute, CallFunc_FromFloat_ReturnValue_1) == 0x000040, "Member 'TrapInitializeStats_C_Execute::CallFunc_FromFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrapInitializeStats_C_Execute, K2Node_MakeStruct_M1StatTypeOpValue_1) == 0x000048, "Member 'TrapInitializeStats_C_Execute::K2Node_MakeStruct_M1StatTypeOpValue_1' has a wrong offset!");
static_assert(offsetof(TrapInitializeStats_C_Execute, CallFunc_Array_Add_ReturnValue_1) == 0x000058, "Member 'TrapInitializeStats_C_Execute::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrapInitializeStats_C_Execute, CallFunc_FromFloat_InValue_ImplicitCast) == 0x00005C, "Member 'TrapInitializeStats_C_Execute::CallFunc_FromFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(TrapInitializeStats_C_Execute, CallFunc_FromFloat_InValue_ImplicitCast_1) == 0x000060, "Member 'TrapInitializeStats_C_Execute::CallFunc_FromFloat_InValue_ImplicitCast_1' has a wrong offset!");

}

