#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Button_04_Help

#include "Basic.hpp"

#include "M1_structs.hpp"
#include "M1_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Button_04_Help.UI_Button_04_Help_C
// 0x0020 (0x08C8 - 0x08A8)
class UUI_Button_04_Help_C final : public UM1UIButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           IconColor;                                         // 0x08B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UIFocused;                                         // 0x08C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_ChangeButtonUI(EM1ButtonUIType InType);
	void BP_Selected(bool InSelected);
	void ExecuteUbergraph_UI_Button_04_Help(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetIconColor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Button_04_Help_C">();
	}
	static class UUI_Button_04_Help_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Button_04_Help_C>();
	}
};
static_assert(alignof(UUI_Button_04_Help_C) == 0x000008, "Wrong alignment on UUI_Button_04_Help_C");
static_assert(sizeof(UUI_Button_04_Help_C) == 0x0008C8, "Wrong size on UUI_Button_04_Help_C");
static_assert(offsetof(UUI_Button_04_Help_C, UberGraphFrame) == 0x0008A8, "Member 'UUI_Button_04_Help_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Button_04_Help_C, IconColor) == 0x0008B0, "Member 'UUI_Button_04_Help_C::IconColor' has a wrong offset!");
static_assert(offsetof(UUI_Button_04_Help_C, UIFocused) == 0x0008C0, "Member 'UUI_Button_04_Help_C::UIFocused' has a wrong offset!");

}

