#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Button_04_Help

#include "Basic.hpp"

#include "M1_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_Button_04_Help.UI_Button_04_Help_C.BP_ChangeButtonUI
// 0x0001 (0x0001 - 0x0000)
struct UI_Button_04_Help_C_BP_ChangeButtonUI final
{
public:
	EM1ButtonUIType                               InType;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Button_04_Help_C_BP_ChangeButtonUI) == 0x000001, "Wrong alignment on UI_Button_04_Help_C_BP_ChangeButtonUI");
static_assert(sizeof(UI_Button_04_Help_C_BP_ChangeButtonUI) == 0x000001, "Wrong size on UI_Button_04_Help_C_BP_ChangeButtonUI");
static_assert(offsetof(UI_Button_04_Help_C_BP_ChangeButtonUI, InType) == 0x000000, "Member 'UI_Button_04_Help_C_BP_ChangeButtonUI::InType' has a wrong offset!");

// Function UI_Button_04_Help.UI_Button_04_Help_C.BP_Selected
// 0x0001 (0x0001 - 0x0000)
struct UI_Button_04_Help_C_BP_Selected final
{
public:
	bool                                          InSelected;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Button_04_Help_C_BP_Selected) == 0x000001, "Wrong alignment on UI_Button_04_Help_C_BP_Selected");
static_assert(sizeof(UI_Button_04_Help_C_BP_Selected) == 0x000001, "Wrong size on UI_Button_04_Help_C_BP_Selected");
static_assert(offsetof(UI_Button_04_Help_C_BP_Selected, InSelected) == 0x000000, "Member 'UI_Button_04_Help_C_BP_Selected::InSelected' has a wrong offset!");

// Function UI_Button_04_Help.UI_Button_04_Help_C.ExecuteUbergraph_UI_Button_04_Help
// 0x0068 (0x0068 - 0x0000)
struct UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InSelected;                           // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1ButtonUIType                               Temp_byte_Variable;                                // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1ButtonUIType                               K2Node_Event_InType;                               // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Button_Deco_Default1_C*             K2Node_DynamicCast_AsUI_Button_Deco_Default_1;     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help) == 0x000008, "Wrong alignment on UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help");
static_assert(sizeof(UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help) == 0x000068, "Wrong size on UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help");
static_assert(offsetof(UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help, EntryPoint) == 0x000000, "Member 'UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help, Temp_struct_Variable) == 0x000004, "Member 'UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help, Temp_struct_Variable_1) == 0x000014, "Member 'UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help, Temp_struct_Variable_2) == 0x000024, "Member 'UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help, Temp_struct_Variable_3) == 0x000034, "Member 'UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help, K2Node_Event_IsDesignTime) == 0x000044, "Member 'UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help, K2Node_Event_InSelected) == 0x000045, "Member 'UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help::K2Node_Event_InSelected' has a wrong offset!");
static_assert(offsetof(UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help, Temp_byte_Variable) == 0x000046, "Member 'UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help, K2Node_Event_InType) == 0x000047, "Member 'UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help::K2Node_Event_InType' has a wrong offset!");
static_assert(offsetof(UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help, K2Node_DynamicCast_AsUI_Button_Deco_Default_1) == 0x000048, "Member 'UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help::K2Node_DynamicCast_AsUI_Button_Deco_Default_1' has a wrong offset!");
static_assert(offsetof(UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help, K2Node_Select_Default) == 0x000054, "Member 'UI_Button_04_Help_C_ExecuteUbergraph_UI_Button_04_Help::K2Node_Select_Default' has a wrong offset!");

// Function UI_Button_04_Help.UI_Button_04_Help_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Button_04_Help_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Button_04_Help_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Button_04_Help_C_PreConstruct");
static_assert(sizeof(UI_Button_04_Help_C_PreConstruct) == 0x000001, "Wrong size on UI_Button_04_Help_C_PreConstruct");
static_assert(offsetof(UI_Button_04_Help_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Button_04_Help_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_Button_04_Help.UI_Button_04_Help_C.SetIconColor
// 0x0001 (0x0001 - 0x0000)
struct UI_Button_04_Help_C_SetIconColor final
{
public:
	bool                                          CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Button_04_Help_C_SetIconColor) == 0x000001, "Wrong alignment on UI_Button_04_Help_C_SetIconColor");
static_assert(sizeof(UI_Button_04_Help_C_SetIconColor) == 0x000001, "Wrong size on UI_Button_04_Help_C_SetIconColor");
static_assert(offsetof(UI_Button_04_Help_C_SetIconColor, CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue) == 0x000000, "Member 'UI_Button_04_Help_C_SetIconColor::CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue' has a wrong offset!");

}

