#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Button_Tooltip_Default_V01

#include "Basic.hpp"

#include "M1_structs.hpp"


namespace SDK::Params
{

// Function UI_Button_Tooltip_Default_V01.UI_Button_Tooltip_Default_V01_C.ExecuteUbergraph_UI_Button_Tooltip_Default_V01
// 0x0018 (0x0018 - 0x0000)
struct UI_Button_Tooltip_Default_V01_C_ExecuteUbergraph_UI_Button_Tooltip_Default_V01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EM1WidgetAnimDirection                        K2Node_Event_InDirection;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Button_Tooltip_Default_V01_C_ExecuteUbergraph_UI_Button_Tooltip_Default_V01) == 0x000008, "Wrong alignment on UI_Button_Tooltip_Default_V01_C_ExecuteUbergraph_UI_Button_Tooltip_Default_V01");
static_assert(sizeof(UI_Button_Tooltip_Default_V01_C_ExecuteUbergraph_UI_Button_Tooltip_Default_V01) == 0x000018, "Wrong size on UI_Button_Tooltip_Default_V01_C_ExecuteUbergraph_UI_Button_Tooltip_Default_V01");
static_assert(offsetof(UI_Button_Tooltip_Default_V01_C_ExecuteUbergraph_UI_Button_Tooltip_Default_V01, EntryPoint) == 0x000000, "Member 'UI_Button_Tooltip_Default_V01_C_ExecuteUbergraph_UI_Button_Tooltip_Default_V01::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Button_Tooltip_Default_V01_C_ExecuteUbergraph_UI_Button_Tooltip_Default_V01, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'UI_Button_Tooltip_Default_V01_C_ExecuteUbergraph_UI_Button_Tooltip_Default_V01::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Button_Tooltip_Default_V01_C_ExecuteUbergraph_UI_Button_Tooltip_Default_V01, K2Node_Event_InDirection) == 0x000010, "Member 'UI_Button_Tooltip_Default_V01_C_ExecuteUbergraph_UI_Button_Tooltip_Default_V01::K2Node_Event_InDirection' has a wrong offset!");

// Function UI_Button_Tooltip_Default_V01.UI_Button_Tooltip_Default_V01_C.OnEventWidgetOpen
// 0x0001 (0x0001 - 0x0000)
struct UI_Button_Tooltip_Default_V01_C_OnEventWidgetOpen final
{
public:
	EM1WidgetAnimDirection                        InDirection;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Button_Tooltip_Default_V01_C_OnEventWidgetOpen) == 0x000001, "Wrong alignment on UI_Button_Tooltip_Default_V01_C_OnEventWidgetOpen");
static_assert(sizeof(UI_Button_Tooltip_Default_V01_C_OnEventWidgetOpen) == 0x000001, "Wrong size on UI_Button_Tooltip_Default_V01_C_OnEventWidgetOpen");
static_assert(offsetof(UI_Button_Tooltip_Default_V01_C_OnEventWidgetOpen, InDirection) == 0x000000, "Member 'UI_Button_Tooltip_Default_V01_C_OnEventWidgetOpen::InDirection' has a wrong offset!");

}

