#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_EternityDungeonInteraction

#include "Basic.hpp"

#include "M1_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Game_EternityDungeonInteraction.UI_Game_EternityDungeonInteraction_C
// 0x0028 (0x0730 - 0x0708)
class UUI_Game_EternityDungeonInteraction_C final : public UM1UIWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0708(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Icon;                                              // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Message_BG;                                        // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UM1OverflowTextBlock*                   TB_Interaction;                                    // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UM1TextBlock*                           TB_InteractionNum;                                 // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_Game_EternityDungeonInteraction(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_Color(uint8 Type);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Game_EternityDungeonInteraction_C">();
	}
	static class UUI_Game_EternityDungeonInteraction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Game_EternityDungeonInteraction_C>();
	}
};
static_assert(alignof(UUI_Game_EternityDungeonInteraction_C) == 0x000008, "Wrong alignment on UUI_Game_EternityDungeonInteraction_C");
static_assert(sizeof(UUI_Game_EternityDungeonInteraction_C) == 0x000730, "Wrong size on UUI_Game_EternityDungeonInteraction_C");
static_assert(offsetof(UUI_Game_EternityDungeonInteraction_C, UberGraphFrame) == 0x000708, "Member 'UUI_Game_EternityDungeonInteraction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Game_EternityDungeonInteraction_C, Icon) == 0x000710, "Member 'UUI_Game_EternityDungeonInteraction_C::Icon' has a wrong offset!");
static_assert(offsetof(UUI_Game_EternityDungeonInteraction_C, Message_BG) == 0x000718, "Member 'UUI_Game_EternityDungeonInteraction_C::Message_BG' has a wrong offset!");
static_assert(offsetof(UUI_Game_EternityDungeonInteraction_C, TB_Interaction) == 0x000720, "Member 'UUI_Game_EternityDungeonInteraction_C::TB_Interaction' has a wrong offset!");
static_assert(offsetof(UUI_Game_EternityDungeonInteraction_C, TB_InteractionNum) == 0x000728, "Member 'UUI_Game_EternityDungeonInteraction_C::TB_InteractionNum' has a wrong offset!");

}

