#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_InvasionDungeon_TimeAttack

#include "Basic.hpp"

#include "M1_structs.hpp"
#include "M1_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Game_InvasionDungeon_TimeAttack.UI_Game_InvasionDungeon_TimeAttack_C
// 0x0040 (0x0778 - 0x0738)
class UUI_Game_InvasionDungeon_TimeAttack_C final : public UM1UIInvasionDungeonScore
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0738(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       UIAnim_Open;                                       // 0x0740(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               P_Panel;                                           // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               P_Progress;                                        // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               P_Time;                                            // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_InvasionDungeon_TimeAttackIcon_Item_C* UI_InvasionDungeon_TimeAttackIconItem_Bronze;      // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_InvasionDungeon_TimeAttackIcon_Item_C* UI_InvasionDungeon_TimeAttackIconItem_Gold;        // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_InvasionDungeon_TimeAttackIcon_Item_C* UI_InvasionDungeon_TimeAttackIconItem_Silver;      // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_ChangeActiveTimeAttack(int32 InUniqueId);
	void BP_SetUIDefault();
	void Construct();
	void ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack(int32 EntryPoint);
	void OnEventWidgetOpen(EM1WidgetAnimDirection InDirection);
	void UISet_Default();

	TArray<class UM1UIInvasionDungeonScoreItem*> BP_GetTimeAttackItems() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Game_InvasionDungeon_TimeAttack_C">();
	}
	static class UUI_Game_InvasionDungeon_TimeAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Game_InvasionDungeon_TimeAttack_C>();
	}
};
static_assert(alignof(UUI_Game_InvasionDungeon_TimeAttack_C) == 0x000008, "Wrong alignment on UUI_Game_InvasionDungeon_TimeAttack_C");
static_assert(sizeof(UUI_Game_InvasionDungeon_TimeAttack_C) == 0x000778, "Wrong size on UUI_Game_InvasionDungeon_TimeAttack_C");
static_assert(offsetof(UUI_Game_InvasionDungeon_TimeAttack_C, UberGraphFrame) == 0x000738, "Member 'UUI_Game_InvasionDungeon_TimeAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Game_InvasionDungeon_TimeAttack_C, UIAnim_Open) == 0x000740, "Member 'UUI_Game_InvasionDungeon_TimeAttack_C::UIAnim_Open' has a wrong offset!");
static_assert(offsetof(UUI_Game_InvasionDungeon_TimeAttack_C, P_Panel) == 0x000748, "Member 'UUI_Game_InvasionDungeon_TimeAttack_C::P_Panel' has a wrong offset!");
static_assert(offsetof(UUI_Game_InvasionDungeon_TimeAttack_C, P_Progress) == 0x000750, "Member 'UUI_Game_InvasionDungeon_TimeAttack_C::P_Progress' has a wrong offset!");
static_assert(offsetof(UUI_Game_InvasionDungeon_TimeAttack_C, P_Time) == 0x000758, "Member 'UUI_Game_InvasionDungeon_TimeAttack_C::P_Time' has a wrong offset!");
static_assert(offsetof(UUI_Game_InvasionDungeon_TimeAttack_C, UI_InvasionDungeon_TimeAttackIconItem_Bronze) == 0x000760, "Member 'UUI_Game_InvasionDungeon_TimeAttack_C::UI_InvasionDungeon_TimeAttackIconItem_Bronze' has a wrong offset!");
static_assert(offsetof(UUI_Game_InvasionDungeon_TimeAttack_C, UI_InvasionDungeon_TimeAttackIconItem_Gold) == 0x000768, "Member 'UUI_Game_InvasionDungeon_TimeAttack_C::UI_InvasionDungeon_TimeAttackIconItem_Gold' has a wrong offset!");
static_assert(offsetof(UUI_Game_InvasionDungeon_TimeAttack_C, UI_InvasionDungeon_TimeAttackIconItem_Silver) == 0x000770, "Member 'UUI_Game_InvasionDungeon_TimeAttack_C::UI_InvasionDungeon_TimeAttackIconItem_Silver' has a wrong offset!");

}

