#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_InvasionDungeon_TimeAttack

#include "Basic.hpp"

#include "M1_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_Game_InvasionDungeon_TimeAttack.UI_Game_InvasionDungeon_TimeAttack_C.BP_ChangeActiveTimeAttack
// 0x0004 (0x0004 - 0x0000)
struct UI_Game_InvasionDungeon_TimeAttack_C_BP_ChangeActiveTimeAttack final
{
public:
	int32                                         InUniqueId;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_InvasionDungeon_TimeAttack_C_BP_ChangeActiveTimeAttack) == 0x000004, "Wrong alignment on UI_Game_InvasionDungeon_TimeAttack_C_BP_ChangeActiveTimeAttack");
static_assert(sizeof(UI_Game_InvasionDungeon_TimeAttack_C_BP_ChangeActiveTimeAttack) == 0x000004, "Wrong size on UI_Game_InvasionDungeon_TimeAttack_C_BP_ChangeActiveTimeAttack");
static_assert(offsetof(UI_Game_InvasionDungeon_TimeAttack_C_BP_ChangeActiveTimeAttack, InUniqueId) == 0x000000, "Member 'UI_Game_InvasionDungeon_TimeAttack_C_BP_ChangeActiveTimeAttack::InUniqueId' has a wrong offset!");

// Function UI_Game_InvasionDungeon_TimeAttack.UI_Game_InvasionDungeon_TimeAttack_C.ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack
// 0x0070 (0x0070 - 0x0000)
struct UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1WidgetAnimDirection                        K2Node_Event_InDirection;                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayUIAnimation_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InUniqueId;                           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack) == 0x000008, "Wrong alignment on UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack");
static_assert(sizeof(UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack) == 0x000070, "Wrong size on UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack");
static_assert(offsetof(UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack, EntryPoint) == 0x000000, "Member 'UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack, Temp_int_Variable) == 0x000004, "Member 'UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack, Temp_struct_Variable) == 0x000008, "Member 'UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack, Temp_struct_Variable_1) == 0x000018, "Member 'UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack, Temp_struct_Variable_2) == 0x000028, "Member 'UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack, Temp_struct_Variable_3) == 0x000038, "Member 'UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack, K2Node_Event_InDirection) == 0x000048, "Member 'UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack::K2Node_Event_InDirection' has a wrong offset!");
static_assert(offsetof(UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack, CallFunc_PlayUIAnimation_ReturnValue) == 0x000050, "Member 'UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack::CallFunc_PlayUIAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack, K2Node_Event_InUniqueId) == 0x000058, "Member 'UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack::K2Node_Event_InUniqueId' has a wrong offset!");
static_assert(offsetof(UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack, K2Node_Select_Default) == 0x00005C, "Member 'UI_Game_InvasionDungeon_TimeAttack_C_ExecuteUbergraph_UI_Game_InvasionDungeon_TimeAttack::K2Node_Select_Default' has a wrong offset!");

// Function UI_Game_InvasionDungeon_TimeAttack.UI_Game_InvasionDungeon_TimeAttack_C.OnEventWidgetOpen
// 0x0001 (0x0001 - 0x0000)
struct UI_Game_InvasionDungeon_TimeAttack_C_OnEventWidgetOpen final
{
public:
	EM1WidgetAnimDirection                        InDirection;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_InvasionDungeon_TimeAttack_C_OnEventWidgetOpen) == 0x000001, "Wrong alignment on UI_Game_InvasionDungeon_TimeAttack_C_OnEventWidgetOpen");
static_assert(sizeof(UI_Game_InvasionDungeon_TimeAttack_C_OnEventWidgetOpen) == 0x000001, "Wrong size on UI_Game_InvasionDungeon_TimeAttack_C_OnEventWidgetOpen");
static_assert(offsetof(UI_Game_InvasionDungeon_TimeAttack_C_OnEventWidgetOpen, InDirection) == 0x000000, "Member 'UI_Game_InvasionDungeon_TimeAttack_C_OnEventWidgetOpen::InDirection' has a wrong offset!");

// Function UI_Game_InvasionDungeon_TimeAttack.UI_Game_InvasionDungeon_TimeAttack_C.BP_GetTimeAttackItems
// 0x0020 (0x0020 - 0x0000)
struct UI_Game_InvasionDungeon_TimeAttack_C_BP_GetTimeAttackItems final
{
public:
	TArray<class UM1UIInvasionDungeonScoreItem*>  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UM1UIInvasionDungeonScoreItem*>  K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(UI_Game_InvasionDungeon_TimeAttack_C_BP_GetTimeAttackItems) == 0x000008, "Wrong alignment on UI_Game_InvasionDungeon_TimeAttack_C_BP_GetTimeAttackItems");
static_assert(sizeof(UI_Game_InvasionDungeon_TimeAttack_C_BP_GetTimeAttackItems) == 0x000020, "Wrong size on UI_Game_InvasionDungeon_TimeAttack_C_BP_GetTimeAttackItems");
static_assert(offsetof(UI_Game_InvasionDungeon_TimeAttack_C_BP_GetTimeAttackItems, ReturnValue) == 0x000000, "Member 'UI_Game_InvasionDungeon_TimeAttack_C_BP_GetTimeAttackItems::ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Game_InvasionDungeon_TimeAttack_C_BP_GetTimeAttackItems, K2Node_MakeArray_Array) == 0x000010, "Member 'UI_Game_InvasionDungeon_TimeAttack_C_BP_GetTimeAttackItems::K2Node_MakeArray_Array' has a wrong offset!");

}

