#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Game_EternityDungeonInteraction

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_Game_EternityDungeonInteraction.UI_Game_EternityDungeonInteraction_C.ExecuteUbergraph_UI_Game_EternityDungeonInteraction
// 0x0008 (0x0008 - 0x0000)
struct UI_Game_EternityDungeonInteraction_C_ExecuteUbergraph_UI_Game_EternityDungeonInteraction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_EternityDungeonInteraction_C_ExecuteUbergraph_UI_Game_EternityDungeonInteraction) == 0x000004, "Wrong alignment on UI_Game_EternityDungeonInteraction_C_ExecuteUbergraph_UI_Game_EternityDungeonInteraction");
static_assert(sizeof(UI_Game_EternityDungeonInteraction_C_ExecuteUbergraph_UI_Game_EternityDungeonInteraction) == 0x000008, "Wrong size on UI_Game_EternityDungeonInteraction_C_ExecuteUbergraph_UI_Game_EternityDungeonInteraction");
static_assert(offsetof(UI_Game_EternityDungeonInteraction_C_ExecuteUbergraph_UI_Game_EternityDungeonInteraction, EntryPoint) == 0x000000, "Member 'UI_Game_EternityDungeonInteraction_C_ExecuteUbergraph_UI_Game_EternityDungeonInteraction::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Game_EternityDungeonInteraction_C_ExecuteUbergraph_UI_Game_EternityDungeonInteraction, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UI_Game_EternityDungeonInteraction_C_ExecuteUbergraph_UI_Game_EternityDungeonInteraction::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UI_Game_EternityDungeonInteraction.UI_Game_EternityDungeonInteraction_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Game_EternityDungeonInteraction_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_EternityDungeonInteraction_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Game_EternityDungeonInteraction_C_PreConstruct");
static_assert(sizeof(UI_Game_EternityDungeonInteraction_C_PreConstruct) == 0x000001, "Wrong size on UI_Game_EternityDungeonInteraction_C_PreConstruct");
static_assert(offsetof(UI_Game_EternityDungeonInteraction_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Game_EternityDungeonInteraction_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_Game_EternityDungeonInteraction.UI_Game_EternityDungeonInteraction_C.Set Color
// 0x007C (0x007C - 0x0000)
struct UI_Game_EternityDungeonInteraction_C_Set_Color final
{
public:
	uint8                                         Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0048(0x0014)()
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Game_EternityDungeonInteraction_C_Set_Color) == 0x000004, "Wrong alignment on UI_Game_EternityDungeonInteraction_C_Set_Color");
static_assert(sizeof(UI_Game_EternityDungeonInteraction_C_Set_Color) == 0x00007C, "Wrong size on UI_Game_EternityDungeonInteraction_C_Set_Color");
static_assert(offsetof(UI_Game_EternityDungeonInteraction_C_Set_Color, Type) == 0x000000, "Member 'UI_Game_EternityDungeonInteraction_C_Set_Color::Type' has a wrong offset!");
static_assert(offsetof(UI_Game_EternityDungeonInteraction_C_Set_Color, Temp_byte_Variable) == 0x000001, "Member 'UI_Game_EternityDungeonInteraction_C_Set_Color::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_EternityDungeonInteraction_C_Set_Color, Temp_struct_Variable) == 0x000004, "Member 'UI_Game_EternityDungeonInteraction_C_Set_Color::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_Game_EternityDungeonInteraction_C_Set_Color, Temp_struct_Variable_1) == 0x000014, "Member 'UI_Game_EternityDungeonInteraction_C_Set_Color::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_EternityDungeonInteraction_C_Set_Color, Temp_byte_Variable_1) == 0x000024, "Member 'UI_Game_EternityDungeonInteraction_C_Set_Color::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Game_EternityDungeonInteraction_C_Set_Color, K2Node_Select_Default) == 0x000028, "Member 'UI_Game_EternityDungeonInteraction_C_Set_Color::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Game_EternityDungeonInteraction_C_Set_Color, Temp_struct_Variable_2) == 0x000038, "Member 'UI_Game_EternityDungeonInteraction_C_Set_Color::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Game_EternityDungeonInteraction_C_Set_Color, K2Node_MakeStruct_SlateColor) == 0x000048, "Member 'UI_Game_EternityDungeonInteraction_C_Set_Color::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UI_Game_EternityDungeonInteraction_C_Set_Color, Temp_struct_Variable_3) == 0x00005C, "Member 'UI_Game_EternityDungeonInteraction_C_Set_Color::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Game_EternityDungeonInteraction_C_Set_Color, K2Node_Select_Default_1) == 0x00006C, "Member 'UI_Game_EternityDungeonInteraction_C_Set_Color::K2Node_Select_Default_1' has a wrong offset!");

}

