#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_InstanceDungeon_RotationInfo2

#include "Basic.hpp"

#include "M1_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_InstanceDungeon_RotationInfo2.UI_InstanceDungeon_RotationInfo2_C
// 0x0028 (0x0750 - 0x0728)
class UUI_InstanceDungeon_RotationInfo2_C final : public UM1UIInstanceDungeonRotationInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0728(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_DecoLine_2;                                  // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         P_InstanceDungeon_RotationScoreReward;             // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_InstanceDungeon_RotationItem_C*     UI_InstanceDungeon_RotationItem;                   // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Condition;                                         // 0x0748(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_InstanceDungeon_RotationInfo2(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetDataImpl(class UM1UIData* InData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_InstanceDungeon_RotationInfo2_C">();
	}
	static class UUI_InstanceDungeon_RotationInfo2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_InstanceDungeon_RotationInfo2_C>();
	}
};
static_assert(alignof(UUI_InstanceDungeon_RotationInfo2_C) == 0x000008, "Wrong alignment on UUI_InstanceDungeon_RotationInfo2_C");
static_assert(sizeof(UUI_InstanceDungeon_RotationInfo2_C) == 0x000750, "Wrong size on UUI_InstanceDungeon_RotationInfo2_C");
static_assert(offsetof(UUI_InstanceDungeon_RotationInfo2_C, UberGraphFrame) == 0x000728, "Member 'UUI_InstanceDungeon_RotationInfo2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_InstanceDungeon_RotationInfo2_C, Image_DecoLine_2) == 0x000730, "Member 'UUI_InstanceDungeon_RotationInfo2_C::Image_DecoLine_2' has a wrong offset!");
static_assert(offsetof(UUI_InstanceDungeon_RotationInfo2_C, P_InstanceDungeon_RotationScoreReward) == 0x000738, "Member 'UUI_InstanceDungeon_RotationInfo2_C::P_InstanceDungeon_RotationScoreReward' has a wrong offset!");
static_assert(offsetof(UUI_InstanceDungeon_RotationInfo2_C, UI_InstanceDungeon_RotationItem) == 0x000740, "Member 'UUI_InstanceDungeon_RotationInfo2_C::UI_InstanceDungeon_RotationItem' has a wrong offset!");
static_assert(offsetof(UUI_InstanceDungeon_RotationInfo2_C, Condition) == 0x000748, "Member 'UUI_InstanceDungeon_RotationInfo2_C::Condition' has a wrong offset!");

}

