#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Popup_MoviePlayer

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function UI_Popup_MoviePlayer.UI_Popup_MoviePlayer_C.ExecuteUbergraph_UI_Popup_MoviePlayer
// 0x0018 (0x0018 - 0x0000)
struct UI_Popup_MoviePlayer_C_ExecuteUbergraph_UI_Popup_MoviePlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkResult Result)>             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAkResult                                     K2Node_CustomEvent_Result;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Popup_MoviePlayer_C_ExecuteUbergraph_UI_Popup_MoviePlayer) == 0x000004, "Wrong alignment on UI_Popup_MoviePlayer_C_ExecuteUbergraph_UI_Popup_MoviePlayer");
static_assert(sizeof(UI_Popup_MoviePlayer_C_ExecuteUbergraph_UI_Popup_MoviePlayer) == 0x000018, "Wrong size on UI_Popup_MoviePlayer_C_ExecuteUbergraph_UI_Popup_MoviePlayer");
static_assert(offsetof(UI_Popup_MoviePlayer_C_ExecuteUbergraph_UI_Popup_MoviePlayer, EntryPoint) == 0x000000, "Member 'UI_Popup_MoviePlayer_C_ExecuteUbergraph_UI_Popup_MoviePlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Popup_MoviePlayer_C_ExecuteUbergraph_UI_Popup_MoviePlayer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UI_Popup_MoviePlayer_C_ExecuteUbergraph_UI_Popup_MoviePlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Popup_MoviePlayer_C_ExecuteUbergraph_UI_Popup_MoviePlayer, K2Node_CustomEvent_Result) == 0x000014, "Member 'UI_Popup_MoviePlayer_C_ExecuteUbergraph_UI_Popup_MoviePlayer::K2Node_CustomEvent_Result' has a wrong offset!");

// Function UI_Popup_MoviePlayer.UI_Popup_MoviePlayer_C.PlayAkSound
// 0x0001 (0x0001 - 0x0000)
struct UI_Popup_MoviePlayer_C_PlayAkSound final
{
public:
	EAkResult                                     Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Popup_MoviePlayer_C_PlayAkSound) == 0x000001, "Wrong alignment on UI_Popup_MoviePlayer_C_PlayAkSound");
static_assert(sizeof(UI_Popup_MoviePlayer_C_PlayAkSound) == 0x000001, "Wrong size on UI_Popup_MoviePlayer_C_PlayAkSound");
static_assert(offsetof(UI_Popup_MoviePlayer_C_PlayAkSound, Result) == 0x000000, "Member 'UI_Popup_MoviePlayer_C_PlayAkSound::Result' has a wrong offset!");

}

