#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UltimateFreyma_Run6_StackCount_Value

#include "Basic.hpp"

#include "M1_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UltimateFreyma_Run6_StackCount_Value.UltimateFreyma_Run6_StackCount_Value_C
// 0x0018 (0x0110 - 0x00F8)
class UUltimateFreyma_Run6_StackCount_Value_C final : public UM1AbilityOpExecCalc
{
public:
	int32                                         StackCount;                                        // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CriticalValue;                                     // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ATKValue;                                          // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Execute(const struct FM1AbilityOpCalcParam& Param, struct FM1AbilityOpExecCalcOutput& Output) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UltimateFreyma_Run6_StackCount_Value_C">();
	}
	static class UUltimateFreyma_Run6_StackCount_Value_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUltimateFreyma_Run6_StackCount_Value_C>();
	}
};
static_assert(alignof(UUltimateFreyma_Run6_StackCount_Value_C) == 0x000008, "Wrong alignment on UUltimateFreyma_Run6_StackCount_Value_C");
static_assert(sizeof(UUltimateFreyma_Run6_StackCount_Value_C) == 0x000110, "Wrong size on UUltimateFreyma_Run6_StackCount_Value_C");
static_assert(offsetof(UUltimateFreyma_Run6_StackCount_Value_C, StackCount) == 0x0000F8, "Member 'UUltimateFreyma_Run6_StackCount_Value_C::StackCount' has a wrong offset!");
static_assert(offsetof(UUltimateFreyma_Run6_StackCount_Value_C, CriticalValue) == 0x000100, "Member 'UUltimateFreyma_Run6_StackCount_Value_C::CriticalValue' has a wrong offset!");
static_assert(offsetof(UUltimateFreyma_Run6_StackCount_Value_C, ATKValue) == 0x000108, "Member 'UUltimateFreyma_Run6_StackCount_Value_C::ATKValue' has a wrong offset!");

}

