#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Viessa_Active01_IceBeam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "M1_structs.hpp"


namespace SDK::Params
{

// Function Viessa_Active01_IceBeam.Viessa_Active01_IceBeam_C.ProcessExplosionToActor
// 0x00A8 (0x00A8 - 0x0000)
struct Viessa_Active01_IceBeam_C_ProcessExplosionToActor final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             ExplosionResult;                                   // 0x0008(0x009C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Viessa_Active01_IceBeam_C_ProcessExplosionToActor) == 0x000008, "Wrong alignment on Viessa_Active01_IceBeam_C_ProcessExplosionToActor");
static_assert(sizeof(Viessa_Active01_IceBeam_C_ProcessExplosionToActor) == 0x0000A8, "Wrong size on Viessa_Active01_IceBeam_C_ProcessExplosionToActor");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ProcessExplosionToActor, OtherActor) == 0x000000, "Member 'Viessa_Active01_IceBeam_C_ProcessExplosionToActor::OtherActor' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ProcessExplosionToActor, ExplosionResult) == 0x000008, "Member 'Viessa_Active01_IceBeam_C_ProcessExplosionToActor::ExplosionResult' has a wrong offset!");

// Function Viessa_Active01_IceBeam.Viessa_Active01_IceBeam_C.OnEvent_46555BE444D896771F1D178692C2B76B
// 0x0140 (0x0140 - 0x0000)
struct Viessa_Active01_IceBeam_C_OnEvent_46555BE444D896771F1D178692C2B76B final
{
public:
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0000(0x0140)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Viessa_Active01_IceBeam_C_OnEvent_46555BE444D896771F1D178692C2B76B) == 0x000008, "Wrong alignment on Viessa_Active01_IceBeam_C_OnEvent_46555BE444D896771F1D178692C2B76B");
static_assert(sizeof(Viessa_Active01_IceBeam_C_OnEvent_46555BE444D896771F1D178692C2B76B) == 0x000140, "Wrong size on Viessa_Active01_IceBeam_C_OnEvent_46555BE444D896771F1D178692C2B76B");
static_assert(offsetof(Viessa_Active01_IceBeam_C_OnEvent_46555BE444D896771F1D178692C2B76B, DamageInfo) == 0x000000, "Member 'Viessa_Active01_IceBeam_C_OnEvent_46555BE444D896771F1D178692C2B76B::DamageInfo' has a wrong offset!");

// Function Viessa_Active01_IceBeam.Viessa_Active01_IceBeam_C.ExecuteUbergraph_Viessa_Active01_IceBeam
// 0x0448 (0x0448 - 0x0000)
struct Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1CalcDamageInfo                      Temp_struct_Variable;                              // 0x0008(0x0140)(ContainsInstancedReference)
	class UM1AbilityAsync_WaitDamageEvent*        CallFunc_WaitGiveDamageEventToActor_ReturnValue;   // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_ExplosionResult;                      // 0x0160(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityContextHandle                CallFunc_GetAbilityContextHandle_ReturnValue;      // 0x0200(0x0010)(ConstParm)
	class AActor*                                 CallFunc_AbilityContextGetInstigator_ReturnValue;  // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FM1CalcDamageInfo                      K2Node_CustomEvent_DamageInfo;                     // 0x0218(0x0140)(ConstParm, ContainsInstancedReference)
	TDelegate<void(struct FM1CalcDamageInfo& DamageInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0358(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FM1AbilityContextHandle                CallFunc_GetAbilityContextHandle_ReturnValue_1;    // 0x0370(0x0010)(ConstParm)
	class AActor*                                 CallFunc_AbilityContextGetInstigator_ReturnValue_1; // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0390(0x009C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_bPenetrated;                          // 0x042C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42D[0x3];                                      // 0x042D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam) == 0x000008, "Wrong alignment on Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam");
static_assert(sizeof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam) == 0x000448, "Wrong size on Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, EntryPoint) == 0x000000, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::EntryPoint' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, Temp_struct_Variable) == 0x000008, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, CallFunc_WaitGiveDamageEventToActor_ReturnValue) == 0x000148, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::CallFunc_WaitGiveDamageEventToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, Temp_int_Array_Index_Variable) == 0x000150, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, CallFunc_IsValid_ReturnValue) == 0x000154, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, K2Node_Event_OtherActor_1) == 0x000158, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, K2Node_Event_ExplosionResult) == 0x000160, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::K2Node_Event_ExplosionResult' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0001FC, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, CallFunc_GetAbilityContextHandle_ReturnValue) == 0x000200, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::CallFunc_GetAbilityContextHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, CallFunc_AbilityContextGetInstigator_ReturnValue) == 0x000210, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::CallFunc_AbilityContextGetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, K2Node_CustomEvent_DamageInfo) == 0x000218, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, K2Node_CreateDelegate_OutputDelegate) == 0x000358, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, Temp_int_Loop_Counter_Variable) == 0x000368, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, CallFunc_Add_IntInt_ReturnValue) == 0x00036C, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, CallFunc_GetAbilityContextHandle_ReturnValue_1) == 0x000370, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::CallFunc_GetAbilityContextHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, CallFunc_AbilityContextGetInstigator_ReturnValue_1) == 0x000380, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::CallFunc_AbilityContextGetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, K2Node_Event_OtherActor) == 0x000388, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, K2Node_Event_HitResult) == 0x000390, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, K2Node_Event_bPenetrated) == 0x00042C, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::K2Node_Event_bPenetrated' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, CallFunc_Array_Get_Item) == 0x000430, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, CallFunc_Array_Add_ReturnValue) == 0x000438, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, CallFunc_Array_Length_ReturnValue) == 0x00043C, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam, CallFunc_Less_IntInt_ReturnValue) == 0x000440, "Member 'Viessa_Active01_IceBeam_C_ExecuteUbergraph_Viessa_Active01_IceBeam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Viessa_Active01_IceBeam.Viessa_Active01_IceBeam_C.BP_OnPreProcessHit
// 0x00A8 (0x00A8 - 0x0000)
struct Viessa_Active01_IceBeam_C_BP_OnPreProcessHit final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0008(0x009C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          bPenetrated;                                       // 0x00A4(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Viessa_Active01_IceBeam_C_BP_OnPreProcessHit) == 0x000008, "Wrong alignment on Viessa_Active01_IceBeam_C_BP_OnPreProcessHit");
static_assert(sizeof(Viessa_Active01_IceBeam_C_BP_OnPreProcessHit) == 0x0000A8, "Wrong size on Viessa_Active01_IceBeam_C_BP_OnPreProcessHit");
static_assert(offsetof(Viessa_Active01_IceBeam_C_BP_OnPreProcessHit, OtherActor) == 0x000000, "Member 'Viessa_Active01_IceBeam_C_BP_OnPreProcessHit::OtherActor' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_BP_OnPreProcessHit, HitResult) == 0x000008, "Member 'Viessa_Active01_IceBeam_C_BP_OnPreProcessHit::HitResult' has a wrong offset!");
static_assert(offsetof(Viessa_Active01_IceBeam_C_BP_OnPreProcessHit, bPenetrated) == 0x0000A4, "Member 'Viessa_Active01_IceBeam_C_BP_OnPreProcessHit::bPenetrated' has a wrong offset!");

}

