#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorldView_Sequence

#include "Basic.hpp"


namespace SDK::Params
{

// Function WorldView_Sequence.WorldView_Sequence_DirectorBP_C.ExecuteUbergraph_WorldView_Sequence_DirectorBP
// 0x0028 (0x0028 - 0x0000)
struct WorldView_Sequence_DirectorBP_C_ExecuteUbergraph_WorldView_Sequence_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBoundActor_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_WorldViewControllerComponent_C*     CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldView_Sequence_DirectorBP_C_ExecuteUbergraph_WorldView_Sequence_DirectorBP) == 0x000008, "Wrong alignment on WorldView_Sequence_DirectorBP_C_ExecuteUbergraph_WorldView_Sequence_DirectorBP");
static_assert(sizeof(WorldView_Sequence_DirectorBP_C_ExecuteUbergraph_WorldView_Sequence_DirectorBP) == 0x000028, "Wrong size on WorldView_Sequence_DirectorBP_C_ExecuteUbergraph_WorldView_Sequence_DirectorBP");
static_assert(offsetof(WorldView_Sequence_DirectorBP_C_ExecuteUbergraph_WorldView_Sequence_DirectorBP, EntryPoint) == 0x000000, "Member 'WorldView_Sequence_DirectorBP_C_ExecuteUbergraph_WorldView_Sequence_DirectorBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(WorldView_Sequence_DirectorBP_C_ExecuteUbergraph_WorldView_Sequence_DirectorBP, CallFunc_GetBoundActor_ReturnValue) == 0x000008, "Member 'WorldView_Sequence_DirectorBP_C_ExecuteUbergraph_WorldView_Sequence_DirectorBP::CallFunc_GetBoundActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorldView_Sequence_DirectorBP_C_ExecuteUbergraph_WorldView_Sequence_DirectorBP, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WorldView_Sequence_DirectorBP_C_ExecuteUbergraph_WorldView_Sequence_DirectorBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorldView_Sequence_DirectorBP_C_ExecuteUbergraph_WorldView_Sequence_DirectorBP, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'WorldView_Sequence_DirectorBP_C_ExecuteUbergraph_WorldView_Sequence_DirectorBP::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WorldView_Sequence_DirectorBP_C_ExecuteUbergraph_WorldView_Sequence_DirectorBP, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'WorldView_Sequence_DirectorBP_C_ExecuteUbergraph_WorldView_Sequence_DirectorBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

